var cityList = {
  "cityList": [
    {
      "id": 0,
      "name": "北京",
      "city": [
        {
          "id": 1,
          "name": "北京市",
          "area": [
            {
              "id": 1,
              "name": "东城区"
            },
            {
              "id": 2,
              "name": "西城区"
            },
            {
              "id": 3,
              "name": "崇文区"
            },
            {
              "id": 4,
              "name": "宣武区"
            },
            {
              "id": 5,
              "name": "朝阳区"
            },
            {
              "id": 6,
              "name": "丰台区"
            },
            {
              "id": 7,
              "name": "石景山区"
            },
            {
              "id": 8,
              "name": "海淀区"
            },
            {
              "id": 9,
              "name": "门头沟区"
            },
            {
              "id": 10,
              "name": "房山区"
            },
            {
              "id": 11,
              "name": "通州区"
            },
            {
              "id": 12,
              "name": "顺义区"
            },
            {
              "id": 13,
              "name": "昌平区"
            },
            {
              "id": 14,
              "name": "大兴区"
            },
            {
              "id": 15,
              "name": "怀柔区"
            },
            {
              "id": 16,
              "name": "平谷区"
            },
            {
              "id": 17,
              "name": "密云县"
            },
            {
              "id": 18,
              "name": "延庆县"
            },
            {
              "id": 19,
              "name": "其它区"
            }
          ]
        }
      ]
    },
    {
      "id": 1,
      "name": "天津",
      "city": [
        {
          "id": 1,
          "name": "天津市",
          "area": [
            {
              "id": 1,
              "name": "和平区"
            },
            {
              "id": 2,
              "name": "河东区"
            },
            {
              "id": 3,
              "name": "河西区"
            },
            {
              "id": 4,
              "name": "南开区"
            },
            {
              "id": 5,
              "name": "河北区"
            },
            {
              "id": 6,
              "name": "红桥区"
            },
            {
              "id": 7,
              "name": "塘沽区"
            },
            {
              "id": 8,
              "name": "汉沽区"
            },
            {
              "id": 9,
              "name": "大港区"
            },
            {
              "id": 10,
              "name": "东丽区"
            },
            {
              "id": 11,
              "name": "西青区"
            },
            {
              "id": 12,
              "name": "津南区"
            },
            {
              "id": 13,
              "name": "北辰区"
            },
            {
              "id": 14,
              "name": "武清区"
            },
            {
              "id": 15,
              "name": "宝坻区"
            },
            {
              "id": 16,
              "name": "宁河县"
            },
            {
              "id": 17,
              "name": "静海县"
            },
            {
              "id": 18,
              "name": "蓟县"
            },
            {
              "id": 19,
              "name": "其它区"
            }
          ]
        }
      ]
    },
    {
      "id": 2,
      "name": "河北",
      "city": [
        {
          "id": 1,
          "name": "石家庄市",
          "area": [
            {
              "id": 1,
              "name": "长安区"
            },
            {
              "id": 2,
              "name": "桥东区"
            },
            {
              "id": 3,
              "name": "桥西区"
            },
            {
              "id": 4,
              "name": "新华区"
            },
            {
              "id": 5,
              "name": "井陉矿区"
            },
            {
              "id": 6,
              "name": "裕华区"
            },
            {
              "id": 7,
              "name": "井陉县"
            },
            {
              "id": 8,
              "name": "正定县"
            },
            {
              "id": 9,
              "name": "栾城县"
            },
            {
              "id": 10,
              "name": "行唐县"
            },
            {
              "id": 11,
              "name": "灵寿县"
            },
            {
              "id": 12,
              "name": "高邑县"
            },
            {
              "id": 13,
              "name": "深泽县"
            },
            {
              "id": 14,
              "name": "赞皇县"
            },
            {
              "id": 15,
              "name": "无极县"
            },
            {
              "id": 16,
              "name": "平山县"
            },
            {
              "id": 17,
              "name": "元氏县"
            },
            {
              "id": 18,
              "name": "赵县"
            },
            {
              "id": 19,
              "name": "辛集市"
            },
            {
              "id": 20,
              "name": "藁城市"
            },
            {
              "id": 21,
              "name": "晋州市"
            },
            {
              "id": 22,
              "name": "新乐市"
            },
            {
              "id": 23,
              "name": "鹿泉市"
            },
            {
              "id": 24,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 2,
          "name": "唐山市",
          "area": [
            {
              "id": 25,
              "name": "路南区"
            },
            {
              "id": 26,
              "name": "路北区"
            },
            {
              "id": 27,
              "name": "古冶区"
            },
            {
              "id": 28,
              "name": "开平区"
            },
            {
              "id": 29,
              "name": "丰南区"
            },
            {
              "id": 30,
              "name": "丰润区"
            },
            {
              "id": 31,
              "name": "滦县"
            },
            {
              "id": 32,
              "name": "滦南县"
            },
            {
              "id": 33,
              "name": "乐亭县"
            },
            {
              "id": 34,
              "name": "迁西县"
            },
            {
              "id": 35,
              "name": "玉田县"
            },
            {
              "id": 36,
              "name": "唐海县"
            },
            {
              "id": 37,
              "name": "遵化市"
            },
            {
              "id": 38,
              "name": "迁安市"
            },
            {
              "id": 39,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 3,
          "name": "秦皇岛市",
          "area": [
            {
              "id": 40,
              "name": "海港区"
            },
            {
              "id": 41,
              "name": "山海关区"
            },
            {
              "id": 42,
              "name": "北戴河区"
            },
            {
              "id": 43,
              "name": "青龙满族自治县"
            },
            {
              "id": 44,
              "name": "昌黎县"
            },
            {
              "id": 45,
              "name": "抚宁县"
            },
            {
              "id": 46,
              "name": "卢龙县"
            },
            {
              "id": 47,
              "name": "其它区"
            },
            {
              "id": 48,
              "name": "经济技术开发区"
            }
          ]
        },
        {
          "id": 4,
          "name": "邯郸市",
          "area": [
            {
              "id": 49,
              "name": "邯山区"
            },
            {
              "id": 50,
              "name": "丛台区"
            },
            {
              "id": 51,
              "name": "复兴区"
            },
            {
              "id": 52,
              "name": "峰峰矿区"
            },
            {
              "id": 53,
              "name": "邯郸县"
            },
            {
              "id": 54,
              "name": "临漳县"
            },
            {
              "id": 55,
              "name": "成安县"
            },
            {
              "id": 56,
              "name": "大名县"
            },
            {
              "id": 57,
              "name": "涉县"
            },
            {
              "id": 58,
              "name": "磁县"
            },
            {
              "id": 59,
              "name": "肥乡县"
            },
            {
              "id": 60,
              "name": "永年县"
            },
            {
              "id": 61,
              "name": "邱县"
            },
            {
              "id": 62,
              "name": "鸡泽县"
            },
            {
              "id": 63,
              "name": "广平县"
            },
            {
              "id": 64,
              "name": "馆陶县"
            },
            {
              "id": 65,
              "name": "魏县"
            },
            {
              "id": 66,
              "name": "曲周县"
            },
            {
              "id": 67,
              "name": "武安市"
            },
            {
              "id": 68,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 5,
          "name": "邢台市",
          "area": [
            {
              "id": 69,
              "name": "桥东区"
            },
            {
              "id": 70,
              "name": "桥西区"
            },
            {
              "id": 71,
              "name": "邢台县"
            },
            {
              "id": 72,
              "name": "临城县"
            },
            {
              "id": 73,
              "name": "内丘县"
            },
            {
              "id": 74,
              "name": "柏乡县"
            },
            {
              "id": 75,
              "name": "隆尧县"
            },
            {
              "id": 76,
              "name": "任县"
            },
            {
              "id": 77,
              "name": "南和县"
            },
            {
              "id": 78,
              "name": "宁晋县"
            },
            {
              "id": 79,
              "name": "巨鹿县"
            },
            {
              "id": 80,
              "name": "新河县"
            },
            {
              "id": 81,
              "name": "广宗县"
            },
            {
              "id": 82,
              "name": "平乡县"
            },
            {
              "id": 83,
              "name": "威县"
            },
            {
              "id": 84,
              "name": "清河县"
            },
            {
              "id": 85,
              "name": "临西县"
            },
            {
              "id": 86,
              "name": "南宫市"
            },
            {
              "id": 87,
              "name": "沙河市"
            },
            {
              "id": 88,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 6,
          "name": "保定市",
          "area": [
            {
              "id": 89,
              "name": "新市区"
            },
            {
              "id": 90,
              "name": "北市区"
            },
            {
              "id": 91,
              "name": "南市区"
            },
            {
              "id": 92,
              "name": "满城县"
            },
            {
              "id": 93,
              "name": "清苑县"
            },
            {
              "id": 94,
              "name": "涞水县"
            },
            {
              "id": 95,
              "name": "阜平县"
            },
            {
              "id": 96,
              "name": "徐水县"
            },
            {
              "id": 97,
              "name": "定兴县"
            },
            {
              "id": 98,
              "name": "唐县"
            },
            {
              "id": 99,
              "name": "高阳县"
            },
            {
              "id": 100,
              "name": "容城县"
            },
            {
              "id": 101,
              "name": "涞源县"
            },
            {
              "id": 102,
              "name": "望都县"
            },
            {
              "id": 103,
              "name": "安新县"
            },
            {
              "id": 104,
              "name": "易县"
            },
            {
              "id": 105,
              "name": "曲阳县"
            },
            {
              "id": 106,
              "name": "蠡县"
            },
            {
              "id": 107,
              "name": "顺平县"
            },
            {
              "id": 108,
              "name": "博野县"
            },
            {
              "id": 109,
              "name": "雄县"
            },
            {
              "id": 110,
              "name": "涿州市"
            },
            {
              "id": 111,
              "name": "定州市"
            },
            {
              "id": 112,
              "name": "安国市"
            },
            {
              "id": 113,
              "name": "高碑店市"
            },
            {
              "id": 114,
              "name": "高开区"
            },
            {
              "id": 115,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 7,
          "name": "张家口市",
          "area": [
            {
              "id": 116,
              "name": "桥东区"
            },
            {
              "id": 117,
              "name": "桥西区"
            },
            {
              "id": 118,
              "name": "宣化区"
            },
            {
              "id": 119,
              "name": "下花园区"
            },
            {
              "id": 120,
              "name": "宣化县"
            },
            {
              "id": 121,
              "name": "张北县"
            },
            {
              "id": 122,
              "name": "康保县"
            },
            {
              "id": 123,
              "name": "沽源县"
            },
            {
              "id": 124,
              "name": "尚义县"
            },
            {
              "id": 125,
              "name": "蔚县"
            },
            {
              "id": 126,
              "name": "阳原县"
            },
            {
              "id": 127,
              "name": "怀安县"
            },
            {
              "id": 128,
              "name": "万全县"
            },
            {
              "id": 129,
              "name": "怀来县"
            },
            {
              "id": 130,
              "name": "涿鹿县"
            },
            {
              "id": 131,
              "name": "赤城县"
            },
            {
              "id": 132,
              "name": "崇礼县"
            },
            {
              "id": 133,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 8,
          "name": "承德市",
          "area": [
            {
              "id": 134,
              "name": "双桥区"
            },
            {
              "id": 135,
              "name": "双滦区"
            },
            {
              "id": 136,
              "name": "鹰手营子矿区"
            },
            {
              "id": 137,
              "name": "承德县"
            },
            {
              "id": 138,
              "name": "兴隆县"
            },
            {
              "id": 139,
              "name": "平泉县"
            },
            {
              "id": 140,
              "name": "滦平县"
            },
            {
              "id": 141,
              "name": "隆化县"
            },
            {
              "id": 142,
              "name": "丰宁满族自治县"
            },
            {
              "id": 143,
              "name": "宽城满族自治县"
            },
            {
              "id": 144,
              "name": "围场满族蒙古族自治县"
            },
            {
              "id": 145,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 9,
          "name": "沧州市",
          "area": [
            {
              "id": 146,
              "name": "新华区"
            },
            {
              "id": 147,
              "name": "运河区"
            },
            {
              "id": 148,
              "name": "沧县"
            },
            {
              "id": 149,
              "name": "青县"
            },
            {
              "id": 150,
              "name": "东光县"
            },
            {
              "id": 151,
              "name": "海兴县"
            },
            {
              "id": 152,
              "name": "盐山县"
            },
            {
              "id": 153,
              "name": "肃宁县"
            },
            {
              "id": 154,
              "name": "南皮县"
            },
            {
              "id": 155,
              "name": "吴桥县"
            },
            {
              "id": 156,
              "name": "献县"
            },
            {
              "id": 157,
              "name": "孟村回族自治县"
            },
            {
              "id": 158,
              "name": "泊头市"
            },
            {
              "id": 159,
              "name": "任丘市"
            },
            {
              "id": 160,
              "name": "黄骅市"
            },
            {
              "id": 161,
              "name": "河间市"
            },
            {
              "id": 162,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 10,
          "name": "廊坊市",
          "area": [
            {
              "id": 163,
              "name": "安次区"
            },
            {
              "id": 164,
              "name": "广阳区"
            },
            {
              "id": 165,
              "name": "固安县"
            },
            {
              "id": 166,
              "name": "永清县"
            },
            {
              "id": 167,
              "name": "香河县"
            },
            {
              "id": 168,
              "name": "大城县"
            },
            {
              "id": 169,
              "name": "文安县"
            },
            {
              "id": 170,
              "name": "大厂回族自治县"
            },
            {
              "id": 171,
              "name": "开发区"
            },
            {
              "id": 172,
              "name": "燕郊经济技术开发区"
            },
            {
              "id": 173,
              "name": "霸州市"
            },
            {
              "id": 174,
              "name": "三河市"
            },
            {
              "id": 175,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 11,
          "name": "衡水市",
          "area": [
            {
              "id": 176,
              "name": "桃城区"
            },
            {
              "id": 177,
              "name": "枣强县"
            },
            {
              "id": 178,
              "name": "武邑县"
            },
            {
              "id": 179,
              "name": "武强县"
            },
            {
              "id": 180,
              "name": "饶阳县"
            },
            {
              "id": 181,
              "name": "安平县"
            },
            {
              "id": 182,
              "name": "故城县"
            },
            {
              "id": 183,
              "name": "景县"
            },
            {
              "id": 184,
              "name": "阜城县"
            },
            {
              "id": 185,
              "name": "冀州市"
            },
            {
              "id": 186,
              "name": "深州市"
            },
            {
              "id": 187,
              "name": "其它区"
            }
          ]
        }
      ]
    },
    {
      "id": 3,
      "name": "山西",
      "city": [
        {
          "id": 1,
          "name": "太原市",
          "area": [
            {
              "id": 1,
              "name": "小店区"
            },
            {
              "id": 2,
              "name": "迎泽区"
            },
            {
              "id": 3,
              "name": "杏花岭区"
            },
            {
              "id": 4,
              "name": "尖草坪区"
            },
            {
              "id": 5,
              "name": "万柏林区"
            },
            {
              "id": 6,
              "name": "晋源区"
            },
            {
              "id": 7,
              "name": "清徐县"
            },
            {
              "id": 8,
              "name": "阳曲县"
            },
            {
              "id": 9,
              "name": "娄烦县"
            },
            {
              "id": 10,
              "name": "古交市"
            },
            {
              "id": 11,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 2,
          "name": "大同市",
          "area": [
            {
              "id": 12,
              "name": "城区"
            },
            {
              "id": 13,
              "name": "矿区"
            },
            {
              "id": 14,
              "name": "南郊区"
            },
            {
              "id": 15,
              "name": "新荣区"
            },
            {
              "id": 16,
              "name": "阳高县"
            },
            {
              "id": 17,
              "name": "天镇县"
            },
            {
              "id": 18,
              "name": "广灵县"
            },
            {
              "id": 19,
              "name": "灵丘县"
            },
            {
              "id": 20,
              "name": "浑源县"
            },
            {
              "id": 21,
              "name": "左云县"
            },
            {
              "id": 22,
              "name": "大同县"
            },
            {
              "id": 23,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 3,
          "name": "阳泉市",
          "area": [
            {
              "id": 24,
              "name": "城区"
            },
            {
              "id": 25,
              "name": "矿区"
            },
            {
              "id": 26,
              "name": "郊区"
            },
            {
              "id": 27,
              "name": "平定县"
            },
            {
              "id": 28,
              "name": "盂县"
            },
            {
              "id": 29,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 4,
          "name": "长治市",
          "area": [
            {
              "id": 30,
              "name": "长治县"
            },
            {
              "id": 31,
              "name": "襄垣县"
            },
            {
              "id": 32,
              "name": "屯留县"
            },
            {
              "id": 33,
              "name": "平顺县"
            },
            {
              "id": 34,
              "name": "黎城县"
            },
            {
              "id": 35,
              "name": "壶关县"
            },
            {
              "id": 36,
              "name": "长子县"
            },
            {
              "id": 37,
              "name": "武乡县"
            },
            {
              "id": 38,
              "name": "沁县"
            },
            {
              "id": 39,
              "name": "沁源县"
            },
            {
              "id": 40,
              "name": "潞城市"
            },
            {
              "id": 41,
              "name": "城区"
            },
            {
              "id": 42,
              "name": "郊区"
            },
            {
              "id": 43,
              "name": "高新区"
            },
            {
              "id": 44,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 5,
          "name": "晋城市",
          "area": [
            {
              "id": 45,
              "name": "城区"
            },
            {
              "id": 46,
              "name": "沁水县"
            },
            {
              "id": 47,
              "name": "阳城县"
            },
            {
              "id": 48,
              "name": "陵川县"
            },
            {
              "id": 49,
              "name": "泽州县"
            },
            {
              "id": 50,
              "name": "高平市"
            },
            {
              "id": 51,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 6,
          "name": "朔州市",
          "area": [
            {
              "id": 52,
              "name": "朔城区"
            },
            {
              "id": 53,
              "name": "平鲁区"
            },
            {
              "id": 54,
              "name": "山阴县"
            },
            {
              "id": 55,
              "name": "应县"
            },
            {
              "id": 56,
              "name": "右玉县"
            },
            {
              "id": 57,
              "name": "怀仁县"
            },
            {
              "id": 58,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 7,
          "name": "晋中市",
          "area": [
            {
              "id": 59,
              "name": "榆次区"
            },
            {
              "id": 60,
              "name": "榆社县"
            },
            {
              "id": 61,
              "name": "左权县"
            },
            {
              "id": 62,
              "name": "和顺县"
            },
            {
              "id": 63,
              "name": "昔阳县"
            },
            {
              "id": 64,
              "name": "寿阳县"
            },
            {
              "id": 65,
              "name": "太谷县"
            },
            {
              "id": 66,
              "name": "祁县"
            },
            {
              "id": 67,
              "name": "平遥县"
            },
            {
              "id": 68,
              "name": "灵石县"
            },
            {
              "id": 69,
              "name": "介休市"
            },
            {
              "id": 70,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 8,
          "name": "运城市",
          "area": [
            {
              "id": 71,
              "name": "盐湖区"
            },
            {
              "id": 72,
              "name": "临猗县"
            },
            {
              "id": 73,
              "name": "万荣县"
            },
            {
              "id": 74,
              "name": "闻喜县"
            },
            {
              "id": 75,
              "name": "稷山县"
            },
            {
              "id": 76,
              "name": "新绛县"
            },
            {
              "id": 77,
              "name": "绛县"
            },
            {
              "id": 78,
              "name": "垣曲县"
            },
            {
              "id": 79,
              "name": "夏县"
            },
            {
              "id": 80,
              "name": "平陆县"
            },
            {
              "id": 81,
              "name": "芮城县"
            },
            {
              "id": 82,
              "name": "永济市"
            },
            {
              "id": 83,
              "name": "河津市"
            },
            {
              "id": 84,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 9,
          "name": "忻州市",
          "area": [
            {
              "id": 85,
              "name": "忻府区"
            },
            {
              "id": 86,
              "name": "定襄县"
            },
            {
              "id": 87,
              "name": "五台县"
            },
            {
              "id": 88,
              "name": "代县"
            },
            {
              "id": 89,
              "name": "繁峙县"
            },
            {
              "id": 90,
              "name": "宁武县"
            },
            {
              "id": 91,
              "name": "静乐县"
            },
            {
              "id": 92,
              "name": "神池县"
            },
            {
              "id": 93,
              "name": "五寨县"
            },
            {
              "id": 94,
              "name": "岢岚县"
            },
            {
              "id": 95,
              "name": "河曲县"
            },
            {
              "id": 96,
              "name": "保德县"
            },
            {
              "id": 97,
              "name": "偏关县"
            },
            {
              "id": 98,
              "name": "原平市"
            },
            {
              "id": 99,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 10,
          "name": "临汾市",
          "area": [
            {
              "id": 100,
              "name": "尧都区"
            },
            {
              "id": 101,
              "name": "曲沃县"
            },
            {
              "id": 102,
              "name": "翼城县"
            },
            {
              "id": 103,
              "name": "襄汾县"
            },
            {
              "id": 104,
              "name": "洪洞县"
            },
            {
              "id": 105,
              "name": "古县"
            },
            {
              "id": 106,
              "name": "安泽县"
            },
            {
              "id": 107,
              "name": "浮山县"
            },
            {
              "id": 108,
              "name": "吉县"
            },
            {
              "id": 109,
              "name": "乡宁县"
            },
            {
              "id": 110,
              "name": "大宁县"
            },
            {
              "id": 111,
              "name": "隰县"
            },
            {
              "id": 112,
              "name": "永和县"
            },
            {
              "id": 113,
              "name": "蒲县"
            },
            {
              "id": 114,
              "name": "汾西县"
            },
            {
              "id": 115,
              "name": "侯马市"
            },
            {
              "id": 116,
              "name": "霍州市"
            },
            {
              "id": 117,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 11,
          "name": "吕梁市",
          "area": [
            {
              "id": 118,
              "name": "离石区"
            },
            {
              "id": 119,
              "name": "文水县"
            },
            {
              "id": 120,
              "name": "交城县"
            },
            {
              "id": 121,
              "name": "兴县"
            },
            {
              "id": 122,
              "name": "临县"
            },
            {
              "id": 123,
              "name": "柳林县"
            },
            {
              "id": 124,
              "name": "石楼县"
            },
            {
              "id": 125,
              "name": "岚县"
            },
            {
              "id": 126,
              "name": "方山县"
            },
            {
              "id": 127,
              "name": "中阳县"
            },
            {
              "id": 128,
              "name": "交口县"
            },
            {
              "id": 129,
              "name": "孝义市"
            },
            {
              "id": 130,
              "name": "汾阳市"
            },
            {
              "id": 131,
              "name": "其它区"
            }
          ]
        }
      ]
    },
    {
      "id": 4,
      "name": "内蒙古",
      "city": [
        {
          "id": 1,
          "name": "呼和浩特市",
          "area": [
            {
              "id": 1,
              "name": "新城区"
            },
            {
              "id": 2,
              "name": "回民区"
            },
            {
              "id": 3,
              "name": "玉泉区"
            },
            {
              "id": 4,
              "name": "赛罕区"
            },
            {
              "id": 5,
              "name": "土默特左旗"
            },
            {
              "id": 6,
              "name": "托克托县"
            },
            {
              "id": 7,
              "name": "和林格尔县"
            },
            {
              "id": 8,
              "name": "清水河县"
            },
            {
              "id": 9,
              "name": "武川县"
            },
            {
              "id": 10,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 2,
          "name": "包头市",
          "area": [
            {
              "id": 11,
              "name": "东河区"
            },
            {
              "id": 12,
              "name": "昆都仑区"
            },
            {
              "id": 13,
              "name": "青山区"
            },
            {
              "id": 14,
              "name": "石拐区"
            },
            {
              "id": 15,
              "name": "白云矿区"
            },
            {
              "id": 16,
              "name": "九原区"
            },
            {
              "id": 17,
              "name": "土默特右旗"
            },
            {
              "id": 18,
              "name": "固阳县"
            },
            {
              "id": 19,
              "name": "达尔罕茂明安联合旗"
            },
            {
              "id": 20,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 3,
          "name": "乌海市",
          "area": [
            {
              "id": 21,
              "name": "海勃湾区"
            },
            {
              "id": 22,
              "name": "海南区"
            },
            {
              "id": 23,
              "name": "乌达区"
            },
            {
              "id": 24,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 4,
          "name": "赤峰市",
          "area": [
            {
              "id": 25,
              "name": "红山区"
            },
            {
              "id": 26,
              "name": "元宝山区"
            },
            {
              "id": 27,
              "name": "松山区"
            },
            {
              "id": 28,
              "name": "阿鲁科尔沁旗"
            },
            {
              "id": 29,
              "name": "巴林左旗"
            },
            {
              "id": 30,
              "name": "巴林右旗"
            },
            {
              "id": 31,
              "name": "林西县"
            },
            {
              "id": 32,
              "name": "克什克腾旗"
            },
            {
              "id": 33,
              "name": "翁牛特旗"
            },
            {
              "id": 34,
              "name": "喀喇沁旗"
            },
            {
              "id": 35,
              "name": "宁城县"
            },
            {
              "id": 36,
              "name": "敖汉旗"
            },
            {
              "id": 37,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 5,
          "name": "通辽市",
          "area": [
            {
              "id": 38,
              "name": "科尔沁区"
            },
            {
              "id": 39,
              "name": "科尔沁左翼中旗"
            },
            {
              "id": 40,
              "name": "科尔沁左翼后旗"
            },
            {
              "id": 41,
              "name": "开鲁县"
            },
            {
              "id": 42,
              "name": "库伦旗"
            },
            {
              "id": 43,
              "name": "奈曼旗"
            },
            {
              "id": 44,
              "name": "扎鲁特旗"
            },
            {
              "id": 45,
              "name": "霍林郭勒市"
            },
            {
              "id": 46,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 6,
          "name": "鄂尔多斯市",
          "area": [
            {
              "id": 47,
              "name": "东胜区"
            },
            {
              "id": 48,
              "name": "达拉特旗"
            },
            {
              "id": 49,
              "name": "准格尔旗"
            },
            {
              "id": 50,
              "name": "鄂托克前旗"
            },
            {
              "id": 51,
              "name": "鄂托克旗"
            },
            {
              "id": 52,
              "name": "杭锦旗"
            },
            {
              "id": 53,
              "name": "乌审旗"
            },
            {
              "id": 54,
              "name": "伊金霍洛旗"
            },
            {
              "id": 55,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 7,
          "name": "呼伦贝尔市",
          "area": [
            {
              "id": 56,
              "name": "海拉尔区"
            },
            {
              "id": 57,
              "name": "阿荣旗"
            },
            {
              "id": 58,
              "name": "莫力达瓦达斡尔族自治旗"
            },
            {
              "id": 59,
              "name": "鄂伦春自治旗"
            },
            {
              "id": 60,
              "name": "鄂温克族自治旗"
            },
            {
              "id": 61,
              "name": "陈巴尔虎旗"
            },
            {
              "id": 62,
              "name": "新巴尔虎左旗"
            },
            {
              "id": 63,
              "name": "新巴尔虎右旗"
            },
            {
              "id": 64,
              "name": "满洲里市"
            },
            {
              "id": 65,
              "name": "牙克石市"
            },
            {
              "id": 66,
              "name": "扎兰屯市"
            },
            {
              "id": 67,
              "name": "额尔古纳市"
            },
            {
              "id": 68,
              "name": "根河市"
            },
            {
              "id": 69,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 8,
          "name": "巴彦淖尔市",
          "area": [
            {
              "id": 70,
              "name": "临河区"
            },
            {
              "id": 71,
              "name": "五原县"
            },
            {
              "id": 72,
              "name": "磴口县"
            },
            {
              "id": 73,
              "name": "乌拉特前旗"
            },
            {
              "id": 74,
              "name": "乌拉特中旗"
            },
            {
              "id": 75,
              "name": "乌拉特后旗"
            },
            {
              "id": 76,
              "name": "杭锦后旗"
            },
            {
              "id": 77,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 9,
          "name": "乌兰察布市",
          "area": [
            {
              "id": 78,
              "name": "集宁区"
            },
            {
              "id": 79,
              "name": "卓资县"
            },
            {
              "id": 80,
              "name": "化德县"
            },
            {
              "id": 81,
              "name": "商都县"
            },
            {
              "id": 82,
              "name": "兴和县"
            },
            {
              "id": 83,
              "name": "凉城县"
            },
            {
              "id": 84,
              "name": "察哈尔右翼前旗"
            },
            {
              "id": 85,
              "name": "察哈尔右翼中旗"
            },
            {
              "id": 86,
              "name": "察哈尔右翼后旗"
            },
            {
              "id": 87,
              "name": "四子王旗"
            },
            {
              "id": 88,
              "name": "丰镇市"
            },
            {
              "id": 89,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 10,
          "name": "兴安盟",
          "area": [
            {
              "id": 90,
              "name": "乌兰浩特市"
            },
            {
              "id": 91,
              "name": "阿尔山市"
            },
            {
              "id": 92,
              "name": "科尔沁右翼前旗"
            },
            {
              "id": 93,
              "name": "科尔沁右翼中旗"
            },
            {
              "id": 94,
              "name": "扎赉特旗"
            },
            {
              "id": 95,
              "name": "突泉县"
            },
            {
              "id": 96,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 11,
          "name": "锡林郭勒盟",
          "area": [
            {
              "id": 97,
              "name": "二连浩特市"
            },
            {
              "id": 98,
              "name": "锡林浩特市"
            },
            {
              "id": 99,
              "name": "阿巴嘎旗"
            },
            {
              "id": 100,
              "name": "苏尼特左旗"
            },
            {
              "id": 101,
              "name": "苏尼特右旗"
            },
            {
              "id": 102,
              "name": "东乌珠穆沁旗"
            },
            {
              "id": 103,
              "name": "西乌珠穆沁旗"
            },
            {
              "id": 104,
              "name": "太仆寺旗"
            },
            {
              "id": 105,
              "name": "镶黄旗"
            },
            {
              "id": 106,
              "name": "正镶白旗"
            },
            {
              "id": 107,
              "name": "正蓝旗"
            },
            {
              "id": 108,
              "name": "多伦县"
            },
            {
              "id": 109,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 12,
          "name": "阿拉善盟",
          "area": [
            {
              "id": 110,
              "name": "阿拉善左旗"
            },
            {
              "id": 111,
              "name": "阿拉善右旗"
            },
            {
              "id": 112,
              "name": "额济纳旗"
            },
            {
              "id": 113,
              "name": "其它区"
            }
          ]
        }
      ]
    },
    {
      "id": 5,
      "name": "辽宁",
      "city": [
        {
          "id": 1,
          "name": "沈阳市",
          "area": [
            {
              "id": 1,
              "name": "和平区"
            },
            {
              "id": 2,
              "name": "沈河区"
            },
            {
              "id": 3,
              "name": "大东区"
            },
            {
              "id": 4,
              "name": "皇姑区"
            },
            {
              "id": 5,
              "name": "铁西区"
            },
            {
              "id": 6,
              "name": "苏家屯区"
            },
            {
              "id": 7,
              "name": "东陵区"
            },
            {
              "id": 8,
              "name": "新城子区"
            },
            {
              "id": 9,
              "name": "于洪区"
            },
            {
              "id": 10,
              "name": "辽中县"
            },
            {
              "id": 11,
              "name": "康平县"
            },
            {
              "id": 12,
              "name": "法库县"
            },
            {
              "id": 13,
              "name": "新民市"
            },
            {
              "id": 14,
              "name": "浑南新区"
            },
            {
              "id": 15,
              "name": "张士开发区"
            },
            {
              "id": 16,
              "name": "沈北新区"
            },
            {
              "id": 17,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 2,
          "name": "大连市",
          "area": [
            {
              "id": 18,
              "name": "中山区"
            },
            {
              "id": 19,
              "name": "西岗区"
            },
            {
              "id": 20,
              "name": "沙河口区"
            },
            {
              "id": 21,
              "name": "甘井子区"
            },
            {
              "id": 22,
              "name": "旅顺口区"
            },
            {
              "id": 23,
              "name": "金州区"
            },
            {
              "id": 24,
              "name": "长海县"
            },
            {
              "id": 25,
              "name": "开发区"
            },
            {
              "id": 26,
              "name": "瓦房店市"
            },
            {
              "id": 27,
              "name": "普兰店市"
            },
            {
              "id": 28,
              "name": "庄河市"
            },
            {
              "id": 29,
              "name": "岭前区"
            },
            {
              "id": 30,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 3,
          "name": "鞍山市",
          "area": [
            {
              "id": 31,
              "name": "铁东区"
            },
            {
              "id": 32,
              "name": "铁西区"
            },
            {
              "id": 33,
              "name": "立山区"
            },
            {
              "id": 34,
              "name": "千山区"
            },
            {
              "id": 35,
              "name": "台安县"
            },
            {
              "id": 36,
              "name": "岫岩满族自治县"
            },
            {
              "id": 37,
              "name": "高新区"
            },
            {
              "id": 38,
              "name": "海城市"
            },
            {
              "id": 39,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 4,
          "name": "抚顺市",
          "area": [
            {
              "id": 40,
              "name": "新抚区"
            },
            {
              "id": 41,
              "name": "东洲区"
            },
            {
              "id": 42,
              "name": "望花区"
            },
            {
              "id": 43,
              "name": "顺城区"
            },
            {
              "id": 44,
              "name": "抚顺县"
            },
            {
              "id": 45,
              "name": "新宾满族自治县"
            },
            {
              "id": 46,
              "name": "清原满族自治县"
            },
            {
              "id": 47,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 5,
          "name": "本溪市",
          "area": [
            {
              "id": 48,
              "name": "平山区"
            },
            {
              "id": 49,
              "name": "溪湖区"
            },
            {
              "id": 50,
              "name": "明山区"
            },
            {
              "id": 51,
              "name": "南芬区"
            },
            {
              "id": 52,
              "name": "本溪满族自治县"
            },
            {
              "id": 53,
              "name": "桓仁满族自治县"
            },
            {
              "id": 54,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 6,
          "name": "丹东市",
          "area": [
            {
              "id": 55,
              "name": "元宝区"
            },
            {
              "id": 56,
              "name": "振兴区"
            },
            {
              "id": 57,
              "name": "振安区"
            },
            {
              "id": 58,
              "name": "宽甸满族自治县"
            },
            {
              "id": 59,
              "name": "东港市"
            },
            {
              "id": 60,
              "name": "凤城市"
            },
            {
              "id": 61,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 7,
          "name": "锦州市",
          "area": [
            {
              "id": 62,
              "name": "古塔区"
            },
            {
              "id": 63,
              "name": "凌河区"
            },
            {
              "id": 64,
              "name": "太和区"
            },
            {
              "id": 65,
              "name": "黑山县"
            },
            {
              "id": 66,
              "name": "义县"
            },
            {
              "id": 67,
              "name": "凌海市"
            },
            {
              "id": 68,
              "name": "北镇市"
            },
            {
              "id": 69,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 8,
          "name": "营口市",
          "area": [
            {
              "id": 70,
              "name": "站前区"
            },
            {
              "id": 71,
              "name": "西市区"
            },
            {
              "id": 72,
              "name": "鲅鱼圈区"
            },
            {
              "id": 73,
              "name": "老边区"
            },
            {
              "id": 74,
              "name": "盖州市"
            },
            {
              "id": 75,
              "name": "大石桥市"
            },
            {
              "id": 76,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 9,
          "name": "阜新市",
          "area": [
            {
              "id": 77,
              "name": "海州区"
            },
            {
              "id": 78,
              "name": "新邱区"
            },
            {
              "id": 79,
              "name": "太平区"
            },
            {
              "id": 80,
              "name": "清河门区"
            },
            {
              "id": 81,
              "name": "细河区"
            },
            {
              "id": 82,
              "name": "阜新蒙古族自治县"
            },
            {
              "id": 83,
              "name": "彰武县"
            },
            {
              "id": 84,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 10,
          "name": "辽阳市",
          "area": [
            {
              "id": 85,
              "name": "白塔区"
            },
            {
              "id": 86,
              "name": "文圣区"
            },
            {
              "id": 87,
              "name": "宏伟区"
            },
            {
              "id": 88,
              "name": "弓长岭区"
            },
            {
              "id": 89,
              "name": "太子河区"
            },
            {
              "id": 90,
              "name": "辽阳县"
            },
            {
              "id": 91,
              "name": "灯塔市"
            },
            {
              "id": 92,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 11,
          "name": "盘锦市",
          "area": [
            {
              "id": 93,
              "name": "双台子区"
            },
            {
              "id": 94,
              "name": "兴隆台区"
            },
            {
              "id": 95,
              "name": "大洼县"
            },
            {
              "id": 96,
              "name": "盘山县"
            },
            {
              "id": 97,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 12,
          "name": "铁岭市",
          "area": [
            {
              "id": 98,
              "name": "银州区"
            },
            {
              "id": 99,
              "name": "清河区"
            },
            {
              "id": 100,
              "name": "铁岭县"
            },
            {
              "id": 101,
              "name": "西丰县"
            },
            {
              "id": 102,
              "name": "昌图县"
            },
            {
              "id": 103,
              "name": "调兵山市"
            },
            {
              "id": 104,
              "name": "开原市"
            },
            {
              "id": 105,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 13,
          "name": "朝阳市",
          "area": [
            {
              "id": 106,
              "name": "双塔区"
            },
            {
              "id": 107,
              "name": "龙城区"
            },
            {
              "id": 108,
              "name": "朝阳县"
            },
            {
              "id": 109,
              "name": "建平县"
            },
            {
              "id": 110,
              "name": "喀喇沁左翼蒙古族自治县"
            },
            {
              "id": 111,
              "name": "北票市"
            },
            {
              "id": 112,
              "name": "凌源市"
            },
            {
              "id": 113,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 14,
          "name": "葫芦岛市",
          "area": [
            {
              "id": 114,
              "name": "连山区"
            },
            {
              "id": 115,
              "name": "龙港区"
            },
            {
              "id": 116,
              "name": "南票区"
            },
            {
              "id": 117,
              "name": "绥中县"
            },
            {
              "id": 118,
              "name": "建昌县"
            },
            {
              "id": 119,
              "name": "兴城市"
            },
            {
              "id": 120,
              "name": "其它区"
            }
          ]
        }
      ]
    },
    {
      "id": 6,
      "name": "吉林",
      "city": [
        {
          "id": 1,
          "name": "长春市",
          "area": [
            {
              "id": 1,
              "name": "南关区"
            },
            {
              "id": 2,
              "name": "宽城区"
            },
            {
              "id": 3,
              "name": "朝阳区"
            },
            {
              "id": 4,
              "name": "二道区"
            },
            {
              "id": 5,
              "name": "绿园区"
            },
            {
              "id": 6,
              "name": "双阳区"
            },
            {
              "id": 7,
              "name": "农安县"
            },
            {
              "id": 8,
              "name": "九台市"
            },
            {
              "id": 9,
              "name": "榆树市"
            },
            {
              "id": 10,
              "name": "德惠市"
            },
            {
              "id": 11,
              "name": "高新技术产业开发区"
            },
            {
              "id": 12,
              "name": "汽车产业开发区"
            },
            {
              "id": 13,
              "name": "经济技术开发区"
            },
            {
              "id": 14,
              "name": "净月旅游开发区"
            },
            {
              "id": 15,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 2,
          "name": "吉林市",
          "area": [
            {
              "id": 16,
              "name": "昌邑区"
            },
            {
              "id": 17,
              "name": "龙潭区"
            },
            {
              "id": 18,
              "name": "船营区"
            },
            {
              "id": 19,
              "name": "丰满区"
            },
            {
              "id": 20,
              "name": "永吉县"
            },
            {
              "id": 21,
              "name": "蛟河市"
            },
            {
              "id": 22,
              "name": "桦甸市"
            },
            {
              "id": 23,
              "name": "舒兰市"
            },
            {
              "id": 24,
              "name": "磐石市"
            },
            {
              "id": 25,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 3,
          "name": "四平市",
          "area": [
            {
              "id": 26,
              "name": "铁西区"
            },
            {
              "id": 27,
              "name": "铁东区"
            },
            {
              "id": 28,
              "name": "梨树县"
            },
            {
              "id": 29,
              "name": "伊通满族自治县"
            },
            {
              "id": 30,
              "name": "公主岭市"
            },
            {
              "id": 31,
              "name": "双辽市"
            },
            {
              "id": 32,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 4,
          "name": "辽源市",
          "area": [
            {
              "id": 33,
              "name": "龙山区"
            },
            {
              "id": 34,
              "name": "西安区"
            },
            {
              "id": 35,
              "name": "东丰县"
            },
            {
              "id": 36,
              "name": "东辽县"
            },
            {
              "id": 37,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 5,
          "name": "通化市",
          "area": [
            {
              "id": 38,
              "name": "东昌区"
            },
            {
              "id": 39,
              "name": "二道江区"
            },
            {
              "id": 40,
              "name": "通化县"
            },
            {
              "id": 41,
              "name": "辉南县"
            },
            {
              "id": 42,
              "name": "柳河县"
            },
            {
              "id": 43,
              "name": "梅河口市"
            },
            {
              "id": 44,
              "name": "集安市"
            },
            {
              "id": 45,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 6,
          "name": "白山市",
          "area": [
            {
              "id": 46,
              "name": "八道江区"
            },
            {
              "id": 47,
              "name": "抚松县"
            },
            {
              "id": 48,
              "name": "靖宇县"
            },
            {
              "id": 49,
              "name": "长白朝鲜族自治县"
            },
            {
              "id": 50,
              "name": "江源县"
            },
            {
              "id": 51,
              "name": "临江市"
            },
            {
              "id": 52,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 7,
          "name": "松原市",
          "area": [
            {
              "id": 53,
              "name": "宁江区"
            },
            {
              "id": 54,
              "name": "前郭尔罗斯蒙古族自治县"
            },
            {
              "id": 55,
              "name": "长岭县"
            },
            {
              "id": 56,
              "name": "乾安县"
            },
            {
              "id": 57,
              "name": "扶余县"
            },
            {
              "id": 58,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 8,
          "name": "白城市",
          "area": [
            {
              "id": 59,
              "name": "洮北区"
            },
            {
              "id": 60,
              "name": "镇赉县"
            },
            {
              "id": 61,
              "name": "通榆县"
            },
            {
              "id": 62,
              "name": "洮南市"
            },
            {
              "id": 63,
              "name": "大安市"
            },
            {
              "id": 64,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 9,
          "name": "延边朝鲜族自治州",
          "area": [
            {
              "id": 65,
              "name": "延吉市"
            },
            {
              "id": 66,
              "name": "图们市"
            },
            {
              "id": 67,
              "name": "敦化市"
            },
            {
              "id": 68,
              "name": "珲春市"
            },
            {
              "id": 69,
              "name": "龙井市"
            },
            {
              "id": 70,
              "name": "和龙市"
            },
            {
              "id": 71,
              "name": "汪清县"
            },
            {
              "id": 72,
              "name": "安图县"
            },
            {
              "id": 73,
              "name": "其它区"
            }
          ]
        }
      ]
    },
    {
      "id": 7,
      "name": "黑龙江",
      "city": [
        {
          "id": 1,
          "name": "哈尔滨市",
          "area": [
            {
              "id": 1,
              "name": "道里区"
            },
            {
              "id": 2,
              "name": "南岗区"
            },
            {
              "id": 3,
              "name": "道外区"
            },
            {
              "id": 4,
              "name": "香坊区"
            },
            {
              "id": 5,
              "name": "动力区"
            },
            {
              "id": 6,
              "name": "平房区"
            },
            {
              "id": 7,
              "name": "松北区"
            },
            {
              "id": 8,
              "name": "呼兰区"
            },
            {
              "id": 9,
              "name": "依兰县"
            },
            {
              "id": 10,
              "name": "方正县"
            },
            {
              "id": 11,
              "name": "宾县"
            },
            {
              "id": 12,
              "name": "巴彦县"
            },
            {
              "id": 13,
              "name": "木兰县"
            },
            {
              "id": 14,
              "name": "通河县"
            },
            {
              "id": 15,
              "name": "延寿县"
            },
            {
              "id": 16,
              "name": "阿城市"
            },
            {
              "id": 17,
              "name": "双城市"
            },
            {
              "id": 18,
              "name": "尚志市"
            },
            {
              "id": 19,
              "name": "五常市"
            },
            {
              "id": 20,
              "name": "阿城市"
            },
            {
              "id": 21,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 2,
          "name": "齐齐哈尔市",
          "area": [
            {
              "id": 22,
              "name": "龙沙区"
            },
            {
              "id": 23,
              "name": "建华区"
            },
            {
              "id": 24,
              "name": "铁锋区"
            },
            {
              "id": 25,
              "name": "昂昂溪区"
            },
            {
              "id": 26,
              "name": "富拉尔基区"
            },
            {
              "id": 27,
              "name": "碾子山区"
            },
            {
              "id": 28,
              "name": "梅里斯达斡尔族区"
            },
            {
              "id": 29,
              "name": "龙江县"
            },
            {
              "id": 30,
              "name": "依安县"
            },
            {
              "id": 31,
              "name": "泰来县"
            },
            {
              "id": 32,
              "name": "甘南县"
            },
            {
              "id": 33,
              "name": "富裕县"
            },
            {
              "id": 34,
              "name": "克山县"
            },
            {
              "id": 35,
              "name": "克东县"
            },
            {
              "id": 36,
              "name": "拜泉县"
            },
            {
              "id": 37,
              "name": "讷河市"
            },
            {
              "id": 38,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 3,
          "name": "鸡西市",
          "area": [
            {
              "id": 39,
              "name": "鸡冠区"
            },
            {
              "id": 40,
              "name": "恒山区"
            },
            {
              "id": 41,
              "name": "滴道区"
            },
            {
              "id": 42,
              "name": "梨树区"
            },
            {
              "id": 43,
              "name": "城子河区"
            },
            {
              "id": 44,
              "name": "麻山区"
            },
            {
              "id": 45,
              "name": "鸡东县"
            },
            {
              "id": 46,
              "name": "虎林市"
            },
            {
              "id": 47,
              "name": "密山市"
            },
            {
              "id": 48,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 4,
          "name": "鹤岗市",
          "area": [
            {
              "id": 49,
              "name": "向阳区"
            },
            {
              "id": 50,
              "name": "工农区"
            },
            {
              "id": 51,
              "name": "南山区"
            },
            {
              "id": 52,
              "name": "兴安区"
            },
            {
              "id": 53,
              "name": "东山区"
            },
            {
              "id": 54,
              "name": "兴山区"
            },
            {
              "id": 55,
              "name": "萝北县"
            },
            {
              "id": 56,
              "name": "绥滨县"
            },
            {
              "id": 57,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 5,
          "name": "双鸭山市",
          "area": [
            {
              "id": 58,
              "name": "尖山区"
            },
            {
              "id": 59,
              "name": "岭东区"
            },
            {
              "id": 60,
              "name": "四方台区"
            },
            {
              "id": 61,
              "name": "宝山区"
            },
            {
              "id": 62,
              "name": "集贤县"
            },
            {
              "id": 63,
              "name": "友谊县"
            },
            {
              "id": 64,
              "name": "宝清县"
            },
            {
              "id": 65,
              "name": "饶河县"
            },
            {
              "id": 66,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 6,
          "name": "大庆市",
          "area": [
            {
              "id": 67,
              "name": "萨尔图区"
            },
            {
              "id": 68,
              "name": "龙凤区"
            },
            {
              "id": 69,
              "name": "让胡路区"
            },
            {
              "id": 70,
              "name": "红岗区"
            },
            {
              "id": 71,
              "name": "大同区"
            },
            {
              "id": 72,
              "name": "肇州县"
            },
            {
              "id": 73,
              "name": "肇源县"
            },
            {
              "id": 74,
              "name": "林甸县"
            },
            {
              "id": 75,
              "name": "杜尔伯特蒙古族自治县"
            },
            {
              "id": 76,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 7,
          "name": "伊春市",
          "area": [
            {
              "id": 77,
              "name": "伊春区"
            },
            {
              "id": 78,
              "name": "南岔区"
            },
            {
              "id": 79,
              "name": "友好区"
            },
            {
              "id": 80,
              "name": "西林区"
            },
            {
              "id": 81,
              "name": "翠峦区"
            },
            {
              "id": 82,
              "name": "新青区"
            },
            {
              "id": 83,
              "name": "美溪区"
            },
            {
              "id": 84,
              "name": "金山屯区"
            },
            {
              "id": 85,
              "name": "五营区"
            },
            {
              "id": 86,
              "name": "乌马河区"
            },
            {
              "id": 87,
              "name": "汤旺河区"
            },
            {
              "id": 88,
              "name": "带岭区"
            },
            {
              "id": 89,
              "name": "乌伊岭区"
            },
            {
              "id": 90,
              "name": "红星区"
            },
            {
              "id": 91,
              "name": "上甘岭区"
            },
            {
              "id": 92,
              "name": "嘉荫县"
            },
            {
              "id": 93,
              "name": "铁力市"
            },
            {
              "id": 94,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 8,
          "name": "佳木斯市",
          "area": [
            {
              "id": 95,
              "name": "永红区"
            },
            {
              "id": 96,
              "name": "向阳区"
            },
            {
              "id": 97,
              "name": "前进区"
            },
            {
              "id": 98,
              "name": "东风区"
            },
            {
              "id": 99,
              "name": "郊区"
            },
            {
              "id": 100,
              "name": "桦南县"
            },
            {
              "id": 101,
              "name": "桦川县"
            },
            {
              "id": 102,
              "name": "汤原县"
            },
            {
              "id": 103,
              "name": "抚远县"
            },
            {
              "id": 104,
              "name": "同江市"
            },
            {
              "id": 105,
              "name": "富锦市"
            },
            {
              "id": 106,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 9,
          "name": "七台河市",
          "area": [
            {
              "id": 107,
              "name": "新兴区"
            },
            {
              "id": 108,
              "name": "桃山区"
            },
            {
              "id": 109,
              "name": "茄子河区"
            },
            {
              "id": 110,
              "name": "勃利县"
            },
            {
              "id": 111,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 10,
          "name": "牡丹江市",
          "area": [
            {
              "id": 112,
              "name": "东安区"
            },
            {
              "id": 113,
              "name": "阳明区"
            },
            {
              "id": 114,
              "name": "爱民区"
            },
            {
              "id": 115,
              "name": "西安区"
            },
            {
              "id": 116,
              "name": "东宁县"
            },
            {
              "id": 117,
              "name": "林口县"
            },
            {
              "id": 118,
              "name": "绥芬河市"
            },
            {
              "id": 119,
              "name": "海林市"
            },
            {
              "id": 120,
              "name": "宁安市"
            },
            {
              "id": 121,
              "name": "穆棱市"
            },
            {
              "id": 122,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 11,
          "name": "黑河市",
          "area": [
            {
              "id": 123,
              "name": "爱辉区"
            },
            {
              "id": 124,
              "name": "嫩江县"
            },
            {
              "id": 125,
              "name": "逊克县"
            },
            {
              "id": 126,
              "name": "孙吴县"
            },
            {
              "id": 127,
              "name": "北安市"
            },
            {
              "id": 128,
              "name": "五大连池市"
            },
            {
              "id": 129,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 12,
          "name": "绥化市",
          "area": [
            {
              "id": 130,
              "name": "北林区"
            },
            {
              "id": 131,
              "name": "望奎县"
            },
            {
              "id": 132,
              "name": "兰西县"
            },
            {
              "id": 133,
              "name": "青冈县"
            },
            {
              "id": 134,
              "name": "庆安县"
            },
            {
              "id": 135,
              "name": "明水县"
            },
            {
              "id": 136,
              "name": "绥棱县"
            },
            {
              "id": 137,
              "name": "安达市"
            },
            {
              "id": 138,
              "name": "肇东市"
            },
            {
              "id": 139,
              "name": "海伦市"
            },
            {
              "id": 140,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 13,
          "name": "大兴安岭地区",
          "area": [
            {
              "id": 141,
              "name": "呼玛县"
            },
            {
              "id": 142,
              "name": "塔河县"
            },
            {
              "id": 143,
              "name": "漠河县"
            },
            {
              "id": 144,
              "name": "加格达奇区"
            },
            {
              "id": 145,
              "name": "其它区"
            }
          ]
        }
      ]
    },
    {
      "id": 8,
      "name": "上海",
      "city": [
        {
          "id": 1,
          "name": "上海市",
          "area": [
            {
              "id": 1,
              "name": "黄浦区"
            },
            {
              "id": 2,
              "name": "卢湾区"
            },
            {
              "id": 3,
              "name": "徐汇区"
            },
            {
              "id": 4,
              "name": "长宁区"
            },
            {
              "id": 5,
              "name": "静安区"
            },
            {
              "id": 6,
              "name": "普陀区"
            },
            {
              "id": 7,
              "name": "闸北区"
            },
            {
              "id": 8,
              "name": "虹口区"
            },
            {
              "id": 9,
              "name": "杨浦区"
            },
            {
              "id": 10,
              "name": "闵行区"
            },
            {
              "id": 11,
              "name": "宝山区"
            },
            {
              "id": 12,
              "name": "嘉定区"
            },
            {
              "id": 13,
              "name": "浦东新区"
            },
            {
              "id": 14,
              "name": "金山区"
            },
            {
              "id": 15,
              "name": "松江区"
            },
            {
              "id": 16,
              "name": "青浦区"
            },
            {
              "id": 17,
              "name": "南汇区"
            },
            {
              "id": 18,
              "name": "奉贤区"
            },
            {
              "id": 19,
              "name": "川沙区"
            },
            {
              "id": 20,
              "name": "崇明县"
            },
            {
              "id": 21,
              "name": "其它区"
            }
          ]
        }
      ]
    },
    {
      "id": 9,
      "name": "江苏",
      "city": [
        {
          "id": 1,
          "name": "南京市",
          "area": [
            {
              "id": 1,
              "name": "玄武区"
            },
            {
              "id": 2,
              "name": "白下区"
            },
            {
              "id": 3,
              "name": "秦淮区"
            },
            {
              "id": 4,
              "name": "建邺区"
            },
            {
              "id": 5,
              "name": "鼓楼区"
            },
            {
              "id": 6,
              "name": "下关区"
            },
            {
              "id": 7,
              "name": "浦口区"
            },
            {
              "id": 8,
              "name": "栖霞区"
            },
            {
              "id": 9,
              "name": "雨花台区"
            },
            {
              "id": 10,
              "name": "江宁区"
            },
            {
              "id": 11,
              "name": "六合区"
            },
            {
              "id": 12,
              "name": "溧水县"
            },
            {
              "id": 13,
              "name": "高淳县"
            },
            {
              "id": 14,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 2,
          "name": "无锡市",
          "area": [
            {
              "id": 15,
              "name": "崇安区"
            },
            {
              "id": 16,
              "name": "南长区"
            },
            {
              "id": 17,
              "name": "北塘区"
            },
            {
              "id": 18,
              "name": "锡山区"
            },
            {
              "id": 19,
              "name": "惠山区"
            },
            {
              "id": 20,
              "name": "滨湖区"
            },
            {
              "id": 21,
              "name": "江阴市"
            },
            {
              "id": 22,
              "name": "宜兴市"
            },
            {
              "id": 23,
              "name": "新区"
            },
            {
              "id": 24,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 3,
          "name": "徐州市",
          "area": [
            {
              "id": 25,
              "name": "鼓楼区"
            },
            {
              "id": 26,
              "name": "云龙区"
            },
            {
              "id": 27,
              "name": "九里区"
            },
            {
              "id": 28,
              "name": "贾汪区"
            },
            {
              "id": 29,
              "name": "泉山区"
            },
            {
              "id": 30,
              "name": "丰县"
            },
            {
              "id": 31,
              "name": "沛县"
            },
            {
              "id": 32,
              "name": "铜山县"
            },
            {
              "id": 33,
              "name": "睢宁县"
            },
            {
              "id": 34,
              "name": "新沂市"
            },
            {
              "id": 35,
              "name": "邳州市"
            },
            {
              "id": 36,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 4,
          "name": "常州市",
          "area": [
            {
              "id": 37,
              "name": "天宁区"
            },
            {
              "id": 38,
              "name": "钟楼区"
            },
            {
              "id": 39,
              "name": "戚墅堰区"
            },
            {
              "id": 40,
              "name": "新北区"
            },
            {
              "id": 41,
              "name": "武进区"
            },
            {
              "id": 42,
              "name": "溧阳市"
            },
            {
              "id": 43,
              "name": "金坛市"
            },
            {
              "id": 44,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 5,
          "name": "苏州市",
          "area": [
            {
              "id": 45,
              "name": "沧浪区"
            },
            {
              "id": 46,
              "name": "平江区"
            },
            {
              "id": 47,
              "name": "金阊区"
            },
            {
              "id": 48,
              "name": "虎丘区"
            },
            {
              "id": 49,
              "name": "吴中区"
            },
            {
              "id": 50,
              "name": "相城区"
            },
            {
              "id": 51,
              "name": "常熟市"
            },
            {
              "id": 52,
              "name": "张家港市"
            },
            {
              "id": 53,
              "name": "昆山市"
            },
            {
              "id": 54,
              "name": "吴江市"
            },
            {
              "id": 55,
              "name": "太仓市"
            },
            {
              "id": 56,
              "name": "新区"
            },
            {
              "id": 57,
              "name": "园区"
            },
            {
              "id": 58,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 6,
          "name": "南通市",
          "area": [
            {
              "id": 59,
              "name": "崇川区"
            },
            {
              "id": 60,
              "name": "港闸区"
            },
            {
              "id": 61,
              "name": "海安县"
            },
            {
              "id": 62,
              "name": "如东县"
            },
            {
              "id": 63,
              "name": "启东市"
            },
            {
              "id": 64,
              "name": "如皋市"
            },
            {
              "id": 65,
              "name": "通州市"
            },
            {
              "id": 66,
              "name": "海门市"
            },
            {
              "id": 67,
              "name": "开发区"
            },
            {
              "id": 68,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 7,
          "name": "连云港市",
          "area": [
            {
              "id": 69,
              "name": "连云区"
            },
            {
              "id": 70,
              "name": "新浦区"
            },
            {
              "id": 71,
              "name": "海州区"
            },
            {
              "id": 72,
              "name": "赣榆县"
            },
            {
              "id": 73,
              "name": "东海县"
            },
            {
              "id": 74,
              "name": "灌云县"
            },
            {
              "id": 75,
              "name": "灌南县"
            },
            {
              "id": 76,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 8,
          "name": "淮安市",
          "area": [
            {
              "id": 77,
              "name": "清河区"
            },
            {
              "id": 78,
              "name": "楚州区"
            },
            {
              "id": 79,
              "name": "淮阴区"
            },
            {
              "id": 80,
              "name": "清浦区"
            },
            {
              "id": 81,
              "name": "涟水县"
            },
            {
              "id": 82,
              "name": "洪泽县"
            },
            {
              "id": 83,
              "name": "盱眙县"
            },
            {
              "id": 84,
              "name": "金湖县"
            },
            {
              "id": 85,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 9,
          "name": "盐城市",
          "area": [
            {
              "id": 86,
              "name": "亭湖区"
            },
            {
              "id": 87,
              "name": "盐都区"
            },
            {
              "id": 88,
              "name": "响水县"
            },
            {
              "id": 89,
              "name": "滨海县"
            },
            {
              "id": 90,
              "name": "阜宁县"
            },
            {
              "id": 91,
              "name": "射阳县"
            },
            {
              "id": 92,
              "name": "建湖县"
            },
            {
              "id": 93,
              "name": "东台市"
            },
            {
              "id": 94,
              "name": "大丰市"
            },
            {
              "id": 95,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 10,
          "name": "扬州市",
          "area": [
            {
              "id": 96,
              "name": "广陵区"
            },
            {
              "id": 97,
              "name": "邗江区"
            },
            {
              "id": 98,
              "name": "维扬区"
            },
            {
              "id": 99,
              "name": "宝应县"
            },
            {
              "id": 100,
              "name": "仪征市"
            },
            {
              "id": 101,
              "name": "高邮市"
            },
            {
              "id": 102,
              "name": "江都市"
            },
            {
              "id": 103,
              "name": "经济开发区"
            },
            {
              "id": 104,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 11,
          "name": "镇江市",
          "area": [
            {
              "id": 105,
              "name": "京口区"
            },
            {
              "id": 106,
              "name": "润州区"
            },
            {
              "id": 107,
              "name": "丹徒区"
            },
            {
              "id": 108,
              "name": "丹阳市"
            },
            {
              "id": 109,
              "name": "扬中市"
            },
            {
              "id": 110,
              "name": "句容市"
            },
            {
              "id": 111,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 12,
          "name": "泰州市",
          "area": [
            {
              "id": 112,
              "name": "海陵区"
            },
            {
              "id": 113,
              "name": "高港区"
            },
            {
              "id": 114,
              "name": "兴化市"
            },
            {
              "id": 115,
              "name": "靖江市"
            },
            {
              "id": 116,
              "name": "泰兴市"
            },
            {
              "id": 117,
              "name": "姜堰市"
            },
            {
              "id": 118,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 13,
          "name": "宿迁市",
          "area": [
            {
              "id": 119,
              "name": "宿城区"
            },
            {
              "id": 120,
              "name": "宿豫区"
            },
            {
              "id": 121,
              "name": "沭阳县"
            },
            {
              "id": 122,
              "name": "泗阳县"
            },
            {
              "id": 123,
              "name": "泗洪县"
            },
            {
              "id": 124,
              "name": "其它区"
            }
          ]
        }
      ]
    },
    {
      "id": 10,
      "name": "浙江",
      "city": [
        {
          "id": 1,
          "name": "杭州市",
          "area": [
            {
              "id": 1,
              "name": "上城区"
            },
            {
              "id": 2,
              "name": "下城区"
            },
            {
              "id": 3,
              "name": "江干区"
            },
            {
              "id": 4,
              "name": "拱墅区"
            },
            {
              "id": 5,
              "name": "西湖区"
            },
            {
              "id": 6,
              "name": "滨江区"
            },
            {
              "id": 7,
              "name": "萧山区"
            },
            {
              "id": 8,
              "name": "余杭区"
            },
            {
              "id": 9,
              "name": "桐庐县"
            },
            {
              "id": 10,
              "name": "淳安县"
            },
            {
              "id": 11,
              "name": "建德市"
            },
            {
              "id": 12,
              "name": "富阳市"
            },
            {
              "id": 13,
              "name": "临安市"
            },
            {
              "id": 14,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 2,
          "name": "宁波市",
          "area": [
            {
              "id": 15,
              "name": "海曙区"
            },
            {
              "id": 16,
              "name": "江东区"
            },
            {
              "id": 17,
              "name": "江北区"
            },
            {
              "id": 18,
              "name": "北仑区"
            },
            {
              "id": 19,
              "name": "镇海区"
            },
            {
              "id": 20,
              "name": "鄞州区"
            },
            {
              "id": 21,
              "name": "象山县"
            },
            {
              "id": 22,
              "name": "宁海县"
            },
            {
              "id": 23,
              "name": "余姚市"
            },
            {
              "id": 24,
              "name": "慈溪市"
            },
            {
              "id": 25,
              "name": "奉化市"
            },
            {
              "id": 26,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 3,
          "name": "温州市",
          "area": [
            {
              "id": 27,
              "name": "鹿城区"
            },
            {
              "id": 28,
              "name": "龙湾区"
            },
            {
              "id": 29,
              "name": "瓯海区"
            },
            {
              "id": 30,
              "name": "洞头县"
            },
            {
              "id": 31,
              "name": "永嘉县"
            },
            {
              "id": 32,
              "name": "平阳县"
            },
            {
              "id": 33,
              "name": "苍南县"
            },
            {
              "id": 34,
              "name": "文成县"
            },
            {
              "id": 35,
              "name": "泰顺县"
            },
            {
              "id": 36,
              "name": "瑞安市"
            },
            {
              "id": 37,
              "name": "乐清市"
            },
            {
              "id": 38,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 4,
          "name": "嘉兴市",
          "area": [
            {
              "id": 39,
              "name": "南湖区"
            },
            {
              "id": 40,
              "name": "秀洲区"
            },
            {
              "id": 41,
              "name": "嘉善县"
            },
            {
              "id": 42,
              "name": "海盐县"
            },
            {
              "id": 43,
              "name": "海宁市"
            },
            {
              "id": 44,
              "name": "平湖市"
            },
            {
              "id": 45,
              "name": "桐乡市"
            },
            {
              "id": 46,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 5,
          "name": "湖州市",
          "area": [
            {
              "id": 47,
              "name": "吴兴区"
            },
            {
              "id": 48,
              "name": "南浔区"
            },
            {
              "id": 49,
              "name": "德清县"
            },
            {
              "id": 50,
              "name": "长兴县"
            },
            {
              "id": 51,
              "name": "安吉县"
            },
            {
              "id": 52,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 6,
          "name": "绍兴市",
          "area": [
            {
              "id": 53,
              "name": "越城区"
            },
            {
              "id": 54,
              "name": "绍兴县"
            },
            {
              "id": 55,
              "name": "新昌县"
            },
            {
              "id": 56,
              "name": "诸暨市"
            },
            {
              "id": 57,
              "name": "上虞市"
            },
            {
              "id": 58,
              "name": "嵊州市"
            },
            {
              "id": 59,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 7,
          "name": "金华市",
          "area": [
            {
              "id": 60,
              "name": "婺城区"
            },
            {
              "id": 61,
              "name": "金东区"
            },
            {
              "id": 62,
              "name": "武义县"
            },
            {
              "id": 63,
              "name": "浦江县"
            },
            {
              "id": 64,
              "name": "磐安县"
            },
            {
              "id": 65,
              "name": "兰溪市"
            },
            {
              "id": 66,
              "name": "义乌市"
            },
            {
              "id": 67,
              "name": "东阳市"
            },
            {
              "id": 68,
              "name": "永康市"
            },
            {
              "id": 69,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 8,
          "name": "衢州市",
          "area": [
            {
              "id": 70,
              "name": "柯城区"
            },
            {
              "id": 71,
              "name": "衢江区"
            },
            {
              "id": 72,
              "name": "常山县"
            },
            {
              "id": 73,
              "name": "开化县"
            },
            {
              "id": 74,
              "name": "龙游县"
            },
            {
              "id": 75,
              "name": "江山市"
            },
            {
              "id": 76,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 9,
          "name": "舟山市",
          "area": [
            {
              "id": 77,
              "name": "定海区"
            },
            {
              "id": 78,
              "name": "普陀区"
            },
            {
              "id": 79,
              "name": "岱山县"
            },
            {
              "id": 80,
              "name": "嵊泗县"
            },
            {
              "id": 81,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 10,
          "name": "台州市",
          "area": [
            {
              "id": 82,
              "name": "椒江区"
            },
            {
              "id": 83,
              "name": "黄岩区"
            },
            {
              "id": 84,
              "name": "路桥区"
            },
            {
              "id": 85,
              "name": "玉环县"
            },
            {
              "id": 86,
              "name": "三门县"
            },
            {
              "id": 87,
              "name": "天台县"
            },
            {
              "id": 88,
              "name": "仙居县"
            },
            {
              "id": 89,
              "name": "温岭市"
            },
            {
              "id": 90,
              "name": "临海市"
            },
            {
              "id": 91,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 11,
          "name": "丽水市",
          "area": [
            {
              "id": 92,
              "name": "莲都区"
            },
            {
              "id": 93,
              "name": "青田县"
            },
            {
              "id": 94,
              "name": "缙云县"
            },
            {
              "id": 95,
              "name": "遂昌县"
            },
            {
              "id": 96,
              "name": "松阳县"
            },
            {
              "id": 97,
              "name": "云和县"
            },
            {
              "id": 98,
              "name": "庆元县"
            },
            {
              "id": 99,
              "name": "景宁畲族自治县"
            },
            {
              "id": 100,
              "name": "龙泉市"
            },
            {
              "id": 101,
              "name": "其它区"
            }
          ]
        }
      ]
    },
    {
      "id": 11,
      "name": "安徽",
      "city": [
        {
          "id": 1,
          "name": "合肥市",
          "area": [
            {
              "id": 1,
              "name": "瑶海区"
            },
            {
              "id": 2,
              "name": "庐阳区"
            },
            {
              "id": 3,
              "name": "蜀山区"
            },
            {
              "id": 4,
              "name": "包河区"
            },
            {
              "id": 5,
              "name": "长丰县"
            },
            {
              "id": 6,
              "name": "肥东县"
            },
            {
              "id": 7,
              "name": "肥西县"
            },
            {
              "id": 8,
              "name": "高新区"
            },
            {
              "id": 9,
              "name": "中区"
            },
            {
              "id": 10,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 2,
          "name": "芜湖市",
          "area": [
            {
              "id": 11,
              "name": "镜湖区"
            },
            {
              "id": 12,
              "name": "弋江区"
            },
            {
              "id": 13,
              "name": "鸠江区"
            },
            {
              "id": 14,
              "name": "三山区"
            },
            {
              "id": 15,
              "name": "芜湖县"
            },
            {
              "id": 16,
              "name": "繁昌县"
            },
            {
              "id": 17,
              "name": "南陵县"
            },
            {
              "id": 18,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 3,
          "name": "蚌埠市",
          "area": [
            {
              "id": 19,
              "name": "龙子湖区"
            },
            {
              "id": 20,
              "name": "蚌山区"
            },
            {
              "id": 21,
              "name": "禹会区"
            },
            {
              "id": 22,
              "name": "淮上区"
            },
            {
              "id": 23,
              "name": "怀远县"
            },
            {
              "id": 24,
              "name": "五河县"
            },
            {
              "id": 25,
              "name": "固镇县"
            },
            {
              "id": 26,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 4,
          "name": "淮南市",
          "area": [
            {
              "id": 27,
              "name": "大通区"
            },
            {
              "id": 28,
              "name": "田家庵区"
            },
            {
              "id": 29,
              "name": "谢家集区"
            },
            {
              "id": 30,
              "name": "八公山区"
            },
            {
              "id": 31,
              "name": "潘集区"
            },
            {
              "id": 32,
              "name": "凤台县"
            },
            {
              "id": 33,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 5,
          "name": "马鞍山市",
          "area": [
            {
              "id": 34,
              "name": "金家庄区"
            },
            {
              "id": 35,
              "name": "花山区"
            },
            {
              "id": 36,
              "name": "雨山区"
            },
            {
              "id": 37,
              "name": "当涂县"
            },
            {
              "id": 38,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 6,
          "name": "淮北市",
          "area": [
            {
              "id": 39,
              "name": "杜集区"
            },
            {
              "id": 40,
              "name": "相山区"
            },
            {
              "id": 41,
              "name": "烈山区"
            },
            {
              "id": 42,
              "name": "濉溪县"
            },
            {
              "id": 43,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 7,
          "name": "铜陵市",
          "area": [
            {
              "id": 44,
              "name": "铜官山区"
            },
            {
              "id": 45,
              "name": "狮子山区"
            },
            {
              "id": 46,
              "name": "郊区"
            },
            {
              "id": 47,
              "name": "铜陵县"
            },
            {
              "id": 48,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 8,
          "name": "安庆市",
          "area": [
            {
              "id": 49,
              "name": "迎江区"
            },
            {
              "id": 50,
              "name": "大观区"
            },
            {
              "id": 51,
              "name": "宜秀区"
            },
            {
              "id": 52,
              "name": "怀宁县"
            },
            {
              "id": 53,
              "name": "枞阳县"
            },
            {
              "id": 54,
              "name": "潜山县"
            },
            {
              "id": 55,
              "name": "太湖县"
            },
            {
              "id": 56,
              "name": "宿松县"
            },
            {
              "id": 57,
              "name": "望江县"
            },
            {
              "id": 58,
              "name": "岳西县"
            },
            {
              "id": 59,
              "name": "桐城市"
            },
            {
              "id": 60,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 9,
          "name": "黄山市",
          "area": [
            {
              "id": 61,
              "name": "屯溪区"
            },
            {
              "id": 62,
              "name": "黄山区"
            },
            {
              "id": 63,
              "name": "徽州区"
            },
            {
              "id": 64,
              "name": "歙县"
            },
            {
              "id": 65,
              "name": "休宁县"
            },
            {
              "id": 66,
              "name": "黟县"
            },
            {
              "id": 67,
              "name": "祁门县"
            },
            {
              "id": 68,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 10,
          "name": "滁州市",
          "area": [
            {
              "id": 69,
              "name": "琅琊区"
            },
            {
              "id": 70,
              "name": "南谯区"
            },
            {
              "id": 71,
              "name": "来安县"
            },
            {
              "id": 72,
              "name": "全椒县"
            },
            {
              "id": 73,
              "name": "定远县"
            },
            {
              "id": 74,
              "name": "凤阳县"
            },
            {
              "id": 75,
              "name": "天长市"
            },
            {
              "id": 76,
              "name": "明光市"
            },
            {
              "id": 77,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 11,
          "name": "阜阳市",
          "area": [
            {
              "id": 78,
              "name": "颍州区"
            },
            {
              "id": 79,
              "name": "颍东区"
            },
            {
              "id": 80,
              "name": "颍泉区"
            },
            {
              "id": 81,
              "name": "临泉县"
            },
            {
              "id": 82,
              "name": "太和县"
            },
            {
              "id": 83,
              "name": "阜南县"
            },
            {
              "id": 84,
              "name": "颍上县"
            },
            {
              "id": 85,
              "name": "界首市"
            },
            {
              "id": 86,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 12,
          "name": "宿州市",
          "area": [
            {
              "id": 87,
              "name": "埇桥区"
            },
            {
              "id": 88,
              "name": "砀山县"
            },
            {
              "id": 89,
              "name": "萧县"
            },
            {
              "id": 90,
              "name": "灵璧县"
            },
            {
              "id": 91,
              "name": "泗县"
            },
            {
              "id": 92,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 13,
          "name": "巢湖市",
          "area": [
            {
              "id": 93,
              "name": "居巢区"
            },
            {
              "id": 94,
              "name": "庐江县"
            },
            {
              "id": 95,
              "name": "无为县"
            },
            {
              "id": 96,
              "name": "含山县"
            },
            {
              "id": 97,
              "name": "和县"
            },
            {
              "id": 98,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 14,
          "name": "六安市",
          "area": [
            {
              "id": 99,
              "name": "金安区"
            },
            {
              "id": 100,
              "name": "裕安区"
            },
            {
              "id": 101,
              "name": "寿县"
            },
            {
              "id": 102,
              "name": "霍邱县"
            },
            {
              "id": 103,
              "name": "舒城县"
            },
            {
              "id": 104,
              "name": "金寨县"
            },
            {
              "id": 105,
              "name": "霍山县"
            },
            {
              "id": 106,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 15,
          "name": "亳州市",
          "area": [
            {
              "id": 107,
              "name": "谯城区"
            },
            {
              "id": 108,
              "name": "涡阳县"
            },
            {
              "id": 109,
              "name": "蒙城县"
            },
            {
              "id": 110,
              "name": "利辛县"
            },
            {
              "id": 111,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 16,
          "name": "池州市",
          "area": [
            {
              "id": 112,
              "name": "贵池区"
            },
            {
              "id": 113,
              "name": "东至县"
            },
            {
              "id": 114,
              "name": "石台县"
            },
            {
              "id": 115,
              "name": "青阳县"
            },
            {
              "id": 116,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 17,
          "name": "宣城市",
          "area": [
            {
              "id": 117,
              "name": "宣州区"
            },
            {
              "id": 118,
              "name": "郎溪县"
            },
            {
              "id": 119,
              "name": "广德县"
            },
            {
              "id": 120,
              "name": "泾县"
            },
            {
              "id": 121,
              "name": "绩溪县"
            },
            {
              "id": 122,
              "name": "旌德县"
            },
            {
              "id": 123,
              "name": "宁国市"
            },
            {
              "id": 124,
              "name": "其它区"
            }
          ]
        }
      ]
    },
    {
      "id": 12,
      "name": "福建",
      "city": [
        {
          "id": 1,
          "name": "福州市",
          "area": [
            {
              "id": 1,
              "name": "鼓楼区"
            },
            {
              "id": 2,
              "name": "台江区"
            },
            {
              "id": 3,
              "name": "仓山区"
            },
            {
              "id": 4,
              "name": "马尾区"
            },
            {
              "id": 5,
              "name": "晋安区"
            },
            {
              "id": 6,
              "name": "闽侯县"
            },
            {
              "id": 7,
              "name": "连江县"
            },
            {
              "id": 8,
              "name": "罗源县"
            },
            {
              "id": 9,
              "name": "闽清县"
            },
            {
              "id": 10,
              "name": "永泰县"
            },
            {
              "id": 11,
              "name": "平潭县"
            },
            {
              "id": 12,
              "name": "福清市"
            },
            {
              "id": 13,
              "name": "长乐市"
            },
            {
              "id": 14,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 2,
          "name": "厦门市",
          "area": [
            {
              "id": 15,
              "name": "思明区"
            },
            {
              "id": 16,
              "name": "海沧区"
            },
            {
              "id": 17,
              "name": "湖里区"
            },
            {
              "id": 18,
              "name": "集美区"
            },
            {
              "id": 19,
              "name": "同安区"
            },
            {
              "id": 20,
              "name": "翔安区"
            },
            {
              "id": 21,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 3,
          "name": "莆田市",
          "area": [
            {
              "id": 22,
              "name": "城厢区"
            },
            {
              "id": 23,
              "name": "涵江区"
            },
            {
              "id": 24,
              "name": "荔城区"
            },
            {
              "id": 25,
              "name": "秀屿区"
            },
            {
              "id": 26,
              "name": "仙游县"
            },
            {
              "id": 27,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 4,
          "name": "三明市",
          "area": [
            {
              "id": 28,
              "name": "梅列区"
            },
            {
              "id": 29,
              "name": "三元区"
            },
            {
              "id": 30,
              "name": "明溪县"
            },
            {
              "id": 31,
              "name": "清流县"
            },
            {
              "id": 32,
              "name": "宁化县"
            },
            {
              "id": 33,
              "name": "大田县"
            },
            {
              "id": 34,
              "name": "尤溪县"
            },
            {
              "id": 35,
              "name": "沙县"
            },
            {
              "id": 36,
              "name": "将乐县"
            },
            {
              "id": 37,
              "name": "泰宁县"
            },
            {
              "id": 38,
              "name": "建宁县"
            },
            {
              "id": 39,
              "name": "永安市"
            },
            {
              "id": 40,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 5,
          "name": "泉州市",
          "area": [
            {
              "id": 41,
              "name": "鲤城区"
            },
            {
              "id": 42,
              "name": "丰泽区"
            },
            {
              "id": 43,
              "name": "洛江区"
            },
            {
              "id": 44,
              "name": "泉港区"
            },
            {
              "id": 45,
              "name": "惠安县"
            },
            {
              "id": 46,
              "name": "安溪县"
            },
            {
              "id": 47,
              "name": "永春县"
            },
            {
              "id": 48,
              "name": "德化县"
            },
            {
              "id": 49,
              "name": "金门县"
            },
            {
              "id": 50,
              "name": "石狮市"
            },
            {
              "id": 51,
              "name": "晋江市"
            },
            {
              "id": 52,
              "name": "南安市"
            },
            {
              "id": 53,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 6,
          "name": "漳州市",
          "area": [
            {
              "id": 54,
              "name": "芗城区"
            },
            {
              "id": 55,
              "name": "龙文区"
            },
            {
              "id": 56,
              "name": "云霄县"
            },
            {
              "id": 57,
              "name": "漳浦县"
            },
            {
              "id": 58,
              "name": "诏安县"
            },
            {
              "id": 59,
              "name": "长泰县"
            },
            {
              "id": 60,
              "name": "东山县"
            },
            {
              "id": 61,
              "name": "南靖县"
            },
            {
              "id": 62,
              "name": "平和县"
            },
            {
              "id": 63,
              "name": "华安县"
            },
            {
              "id": 64,
              "name": "龙海市"
            },
            {
              "id": 65,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 7,
          "name": "南平市",
          "area": [
            {
              "id": 66,
              "name": "延平区"
            },
            {
              "id": 67,
              "name": "顺昌县"
            },
            {
              "id": 68,
              "name": "浦城县"
            },
            {
              "id": 69,
              "name": "光泽县"
            },
            {
              "id": 70,
              "name": "松溪县"
            },
            {
              "id": 71,
              "name": "政和县"
            },
            {
              "id": 72,
              "name": "邵武市"
            },
            {
              "id": 73,
              "name": "武夷山市"
            },
            {
              "id": 74,
              "name": "建瓯市"
            },
            {
              "id": 75,
              "name": "建阳市"
            },
            {
              "id": 76,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 8,
          "name": "龙岩市",
          "area": [
            {
              "id": 77,
              "name": "新罗区"
            },
            {
              "id": 78,
              "name": "长汀县"
            },
            {
              "id": 79,
              "name": "永定县"
            },
            {
              "id": 80,
              "name": "上杭县"
            },
            {
              "id": 81,
              "name": "武平县"
            },
            {
              "id": 82,
              "name": "连城县"
            },
            {
              "id": 83,
              "name": "漳平市"
            },
            {
              "id": 84,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 9,
          "name": "宁德市",
          "area": [
            {
              "id": 85,
              "name": "蕉城区"
            },
            {
              "id": 86,
              "name": "霞浦县"
            },
            {
              "id": 87,
              "name": "古田县"
            },
            {
              "id": 88,
              "name": "屏南县"
            },
            {
              "id": 89,
              "name": "寿宁县"
            },
            {
              "id": 90,
              "name": "周宁县"
            },
            {
              "id": 91,
              "name": "柘荣县"
            },
            {
              "id": 92,
              "name": "福安市"
            },
            {
              "id": 93,
              "name": "福鼎市"
            },
            {
              "id": 94,
              "name": "其它区"
            }
          ]
        }
      ]
    },
    {
      "id": 13,
      "name": "江西",
      "city": [
        {
          "id": 1,
          "name": "南昌市",
          "area": [
            {
              "id": 1,
              "name": "东湖区"
            },
            {
              "id": 2,
              "name": "西湖区"
            },
            {
              "id": 3,
              "name": "青云谱区"
            },
            {
              "id": 4,
              "name": "湾里区"
            },
            {
              "id": 5,
              "name": "青山湖区"
            },
            {
              "id": 6,
              "name": "南昌县"
            },
            {
              "id": 7,
              "name": "新建县"
            },
            {
              "id": 8,
              "name": "安义县"
            },
            {
              "id": 9,
              "name": "进贤县"
            },
            {
              "id": 10,
              "name": "红谷滩新区"
            },
            {
              "id": 11,
              "name": "经济技术开发区"
            },
            {
              "id": 12,
              "name": "昌北区"
            },
            {
              "id": 13,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 2,
          "name": "景德镇市",
          "area": [
            {
              "id": 14,
              "name": "昌江区"
            },
            {
              "id": 15,
              "name": "珠山区"
            },
            {
              "id": 16,
              "name": "浮梁县"
            },
            {
              "id": 17,
              "name": "乐平市"
            },
            {
              "id": 18,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 3,
          "name": "萍乡市",
          "area": [
            {
              "id": 19,
              "name": "安源区"
            },
            {
              "id": 20,
              "name": "湘东区"
            },
            {
              "id": 21,
              "name": "莲花县"
            },
            {
              "id": 22,
              "name": "上栗县"
            },
            {
              "id": 23,
              "name": "芦溪县"
            },
            {
              "id": 24,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 4,
          "name": "九江市",
          "area": [
            {
              "id": 25,
              "name": "庐山区"
            },
            {
              "id": 26,
              "name": "浔阳区"
            },
            {
              "id": 27,
              "name": "九江县"
            },
            {
              "id": 28,
              "name": "武宁县"
            },
            {
              "id": 29,
              "name": "修水县"
            },
            {
              "id": 30,
              "name": "永修县"
            },
            {
              "id": 31,
              "name": "德安县"
            },
            {
              "id": 32,
              "name": "星子县"
            },
            {
              "id": 33,
              "name": "都昌县"
            },
            {
              "id": 34,
              "name": "湖口县"
            },
            {
              "id": 35,
              "name": "彭泽县"
            },
            {
              "id": 36,
              "name": "瑞昌市"
            },
            {
              "id": 37,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 5,
          "name": "新余市",
          "area": [
            {
              "id": 38,
              "name": "渝水区"
            },
            {
              "id": 39,
              "name": "分宜县"
            },
            {
              "id": 40,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 6,
          "name": "鹰潭市",
          "area": [
            {
              "id": 41,
              "name": "月湖区"
            },
            {
              "id": 42,
              "name": "余江县"
            },
            {
              "id": 43,
              "name": "贵溪市"
            },
            {
              "id": 44,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 7,
          "name": "赣州市",
          "area": [
            {
              "id": 45,
              "name": "章贡区"
            },
            {
              "id": 46,
              "name": "赣县"
            },
            {
              "id": 47,
              "name": "信丰县"
            },
            {
              "id": 48,
              "name": "大余县"
            },
            {
              "id": 49,
              "name": "上犹县"
            },
            {
              "id": 50,
              "name": "崇义县"
            },
            {
              "id": 51,
              "name": "安远县"
            },
            {
              "id": 52,
              "name": "龙南县"
            },
            {
              "id": 53,
              "name": "定南县"
            },
            {
              "id": 54,
              "name": "全南县"
            },
            {
              "id": 55,
              "name": "宁都县"
            },
            {
              "id": 56,
              "name": "于都县"
            },
            {
              "id": 57,
              "name": "兴国县"
            },
            {
              "id": 58,
              "name": "会昌县"
            },
            {
              "id": 59,
              "name": "寻乌县"
            },
            {
              "id": 60,
              "name": "石城县"
            },
            {
              "id": 61,
              "name": "黄金区"
            },
            {
              "id": 62,
              "name": "瑞金市"
            },
            {
              "id": 63,
              "name": "南康市"
            },
            {
              "id": 64,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 8,
          "name": "吉安市",
          "area": [
            {
              "id": 65,
              "name": "吉州区"
            },
            {
              "id": 66,
              "name": "青原区"
            },
            {
              "id": 67,
              "name": "吉安县"
            },
            {
              "id": 68,
              "name": "吉水县"
            },
            {
              "id": 69,
              "name": "峡江县"
            },
            {
              "id": 70,
              "name": "新干县"
            },
            {
              "id": 71,
              "name": "永丰县"
            },
            {
              "id": 72,
              "name": "泰和县"
            },
            {
              "id": 73,
              "name": "遂川县"
            },
            {
              "id": 74,
              "name": "万安县"
            },
            {
              "id": 75,
              "name": "安福县"
            },
            {
              "id": 76,
              "name": "永新县"
            },
            {
              "id": 77,
              "name": "井冈山市"
            },
            {
              "id": 78,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 9,
          "name": "宜春市",
          "area": [
            {
              "id": 79,
              "name": "袁州区"
            },
            {
              "id": 80,
              "name": "奉新县"
            },
            {
              "id": 81,
              "name": "万载县"
            },
            {
              "id": 82,
              "name": "上高县"
            },
            {
              "id": 83,
              "name": "宜丰县"
            },
            {
              "id": 84,
              "name": "靖安县"
            },
            {
              "id": 85,
              "name": "铜鼓县"
            },
            {
              "id": 86,
              "name": "丰城市"
            },
            {
              "id": 87,
              "name": "樟树市"
            },
            {
              "id": 88,
              "name": "高安市"
            },
            {
              "id": 89,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 10,
          "name": "抚州市",
          "area": [
            {
              "id": 90,
              "name": "临川区"
            },
            {
              "id": 91,
              "name": "南城县"
            },
            {
              "id": 92,
              "name": "黎川县"
            },
            {
              "id": 93,
              "name": "南丰县"
            },
            {
              "id": 94,
              "name": "崇仁县"
            },
            {
              "id": 95,
              "name": "乐安县"
            },
            {
              "id": 96,
              "name": "宜黄县"
            },
            {
              "id": 97,
              "name": "金溪县"
            },
            {
              "id": 98,
              "name": "资溪县"
            },
            {
              "id": 99,
              "name": "东乡县"
            },
            {
              "id": 100,
              "name": "广昌县"
            },
            {
              "id": 101,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 11,
          "name": "上饶市",
          "area": [
            {
              "id": 102,
              "name": "信州区"
            },
            {
              "id": 103,
              "name": "上饶县"
            },
            {
              "id": 104,
              "name": "广丰县"
            },
            {
              "id": 105,
              "name": "玉山县"
            },
            {
              "id": 106,
              "name": "铅山县"
            },
            {
              "id": 107,
              "name": "横峰县"
            },
            {
              "id": 108,
              "name": "弋阳县"
            },
            {
              "id": 109,
              "name": "余干县"
            },
            {
              "id": 110,
              "name": "鄱阳县"
            },
            {
              "id": 111,
              "name": "万年县"
            },
            {
              "id": 112,
              "name": "婺源县"
            },
            {
              "id": 113,
              "name": "德兴市"
            },
            {
              "id": 114,
              "name": "其它区"
            }
          ]
        }
      ]
    },
    {
      "id": 14,
      "name": "山东",
      "city": [
        {
          "id": 1,
          "name": "济南市",
          "area": [
            {
              "id": 1,
              "name": "历下区"
            },
            {
              "id": 2,
              "name": "市中区"
            },
            {
              "id": 3,
              "name": "槐荫区"
            },
            {
              "id": 4,
              "name": "天桥区"
            },
            {
              "id": 5,
              "name": "历城区"
            },
            {
              "id": 6,
              "name": "长清区"
            },
            {
              "id": 7,
              "name": "平阴县"
            },
            {
              "id": 8,
              "name": "济阳县"
            },
            {
              "id": 9,
              "name": "商河县"
            },
            {
              "id": 10,
              "name": "章丘市"
            },
            {
              "id": 11,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 2,
          "name": "青岛市",
          "area": [
            {
              "id": 12,
              "name": "市南区"
            },
            {
              "id": 13,
              "name": "市北区"
            },
            {
              "id": 14,
              "name": "四方区"
            },
            {
              "id": 15,
              "name": "黄岛区"
            },
            {
              "id": 16,
              "name": "崂山区"
            },
            {
              "id": 17,
              "name": "李沧区"
            },
            {
              "id": 18,
              "name": "城阳区"
            },
            {
              "id": 19,
              "name": "开发区"
            },
            {
              "id": 20,
              "name": "胶州市"
            },
            {
              "id": 21,
              "name": "即墨市"
            },
            {
              "id": 22,
              "name": "平度市"
            },
            {
              "id": 23,
              "name": "胶南市"
            },
            {
              "id": 24,
              "name": "莱西市"
            },
            {
              "id": 25,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 3,
          "name": "淄博市",
          "area": [
            {
              "id": 26,
              "name": "淄川区"
            },
            {
              "id": 27,
              "name": "张店区"
            },
            {
              "id": 28,
              "name": "博山区"
            },
            {
              "id": 29,
              "name": "临淄区"
            },
            {
              "id": 30,
              "name": "周村区"
            },
            {
              "id": 31,
              "name": "桓台县"
            },
            {
              "id": 32,
              "name": "高青县"
            },
            {
              "id": 33,
              "name": "沂源县"
            },
            {
              "id": 34,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 4,
          "name": "枣庄市",
          "area": [
            {
              "id": 35,
              "name": "市中区"
            },
            {
              "id": 36,
              "name": "薛城区"
            },
            {
              "id": 37,
              "name": "峄城区"
            },
            {
              "id": 38,
              "name": "台儿庄区"
            },
            {
              "id": 39,
              "name": "山亭区"
            },
            {
              "id": 40,
              "name": "滕州市"
            },
            {
              "id": 41,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 5,
          "name": "东营市",
          "area": [
            {
              "id": 42,
              "name": "东营区"
            },
            {
              "id": 43,
              "name": "河口区"
            },
            {
              "id": 44,
              "name": "垦利县"
            },
            {
              "id": 45,
              "name": "利津县"
            },
            {
              "id": 46,
              "name": "广饶县"
            },
            {
              "id": 47,
              "name": "西城区"
            },
            {
              "id": 48,
              "name": "东城区"
            },
            {
              "id": 49,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 6,
          "name": "烟台市",
          "area": [
            {
              "id": 50,
              "name": "芝罘区"
            },
            {
              "id": 51,
              "name": "福山区"
            },
            {
              "id": 52,
              "name": "牟平区"
            },
            {
              "id": 53,
              "name": "莱山区"
            },
            {
              "id": 54,
              "name": "长岛县"
            },
            {
              "id": 55,
              "name": "龙口市"
            },
            {
              "id": 56,
              "name": "莱阳市"
            },
            {
              "id": 57,
              "name": "莱州市"
            },
            {
              "id": 58,
              "name": "蓬莱市"
            },
            {
              "id": 59,
              "name": "招远市"
            },
            {
              "id": 60,
              "name": "栖霞市"
            },
            {
              "id": 61,
              "name": "海阳市"
            },
            {
              "id": 62,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 7,
          "name": "潍坊市",
          "area": [
            {
              "id": 63,
              "name": "潍城区"
            },
            {
              "id": 64,
              "name": "寒亭区"
            },
            {
              "id": 65,
              "name": "坊子区"
            },
            {
              "id": 66,
              "name": "奎文区"
            },
            {
              "id": 67,
              "name": "临朐县"
            },
            {
              "id": 68,
              "name": "昌乐县"
            },
            {
              "id": 69,
              "name": "开发区"
            },
            {
              "id": 70,
              "name": "青州市"
            },
            {
              "id": 71,
              "name": "诸城市"
            },
            {
              "id": 72,
              "name": "寿光市"
            },
            {
              "id": 73,
              "name": "安丘市"
            },
            {
              "id": 74,
              "name": "高密市"
            },
            {
              "id": 75,
              "name": "昌邑市"
            },
            {
              "id": 76,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 8,
          "name": "济宁市",
          "area": [
            {
              "id": 77,
              "name": "市中区"
            },
            {
              "id": 78,
              "name": "任城区"
            },
            {
              "id": 79,
              "name": "微山县"
            },
            {
              "id": 80,
              "name": "鱼台县"
            },
            {
              "id": 81,
              "name": "金乡县"
            },
            {
              "id": 82,
              "name": "嘉祥县"
            },
            {
              "id": 83,
              "name": "汶上县"
            },
            {
              "id": 84,
              "name": "泗水县"
            },
            {
              "id": 85,
              "name": "梁山县"
            },
            {
              "id": 86,
              "name": "曲阜市"
            },
            {
              "id": 87,
              "name": "兖州市"
            },
            {
              "id": 88,
              "name": "邹城市"
            },
            {
              "id": 89,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 9,
          "name": "泰安市",
          "area": [
            {
              "id": 90,
              "name": "泰山区"
            },
            {
              "id": 91,
              "name": "岱岳区"
            },
            {
              "id": 92,
              "name": "宁阳县"
            },
            {
              "id": 93,
              "name": "东平县"
            },
            {
              "id": 94,
              "name": "新泰市"
            },
            {
              "id": 95,
              "name": "肥城市"
            },
            {
              "id": 96,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 10,
          "name": "威海市",
          "area": [
            {
              "id": 97,
              "name": "环翠区"
            },
            {
              "id": 98,
              "name": "文登市"
            },
            {
              "id": 99,
              "name": "荣成市"
            },
            {
              "id": 100,
              "name": "乳山市"
            },
            {
              "id": 101,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 11,
          "name": "日照市",
          "area": [
            {
              "id": 102,
              "name": "东港区"
            },
            {
              "id": 103,
              "name": "岚山区"
            },
            {
              "id": 104,
              "name": "五莲县"
            },
            {
              "id": 105,
              "name": "莒县"
            },
            {
              "id": 106,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 12,
          "name": "莱芜市",
          "area": [
            {
              "id": 107,
              "name": "莱城区"
            },
            {
              "id": 108,
              "name": "钢城区"
            },
            {
              "id": 109,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 13,
          "name": "临沂市",
          "area": [
            {
              "id": 110,
              "name": "兰山区"
            },
            {
              "id": 111,
              "name": "罗庄区"
            },
            {
              "id": 112,
              "name": "河东区"
            },
            {
              "id": 113,
              "name": "沂南县"
            },
            {
              "id": 114,
              "name": "郯城县"
            },
            {
              "id": 115,
              "name": "沂水县"
            },
            {
              "id": 116,
              "name": "苍山县"
            },
            {
              "id": 117,
              "name": "费县"
            },
            {
              "id": 118,
              "name": "平邑县"
            },
            {
              "id": 119,
              "name": "莒南县"
            },
            {
              "id": 120,
              "name": "蒙阴县"
            },
            {
              "id": 121,
              "name": "临沭县"
            },
            {
              "id": 122,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 14,
          "name": "德州市",
          "area": [
            {
              "id": 123,
              "name": "德城区"
            },
            {
              "id": 124,
              "name": "陵县"
            },
            {
              "id": 125,
              "name": "宁津县"
            },
            {
              "id": 126,
              "name": "庆云县"
            },
            {
              "id": 127,
              "name": "临邑县"
            },
            {
              "id": 128,
              "name": "齐河县"
            },
            {
              "id": 129,
              "name": "平原县"
            },
            {
              "id": 130,
              "name": "夏津县"
            },
            {
              "id": 131,
              "name": "武城县"
            },
            {
              "id": 132,
              "name": "开发区"
            },
            {
              "id": 133,
              "name": "乐陵市"
            },
            {
              "id": 134,
              "name": "禹城市"
            },
            {
              "id": 135,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 15,
          "name": "聊城市",
          "area": [
            {
              "id": 136,
              "name": "东昌府区"
            },
            {
              "id": 137,
              "name": "阳谷县"
            },
            {
              "id": 138,
              "name": "莘县"
            },
            {
              "id": 139,
              "name": "茌平县"
            },
            {
              "id": 140,
              "name": "东阿县"
            },
            {
              "id": 141,
              "name": "冠县"
            },
            {
              "id": 142,
              "name": "高唐县"
            },
            {
              "id": 143,
              "name": "临清市"
            },
            {
              "id": 144,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 16,
          "name": "滨州市",
          "area": [
            {
              "id": 145,
              "name": "滨城区"
            },
            {
              "id": 146,
              "name": "惠民县"
            },
            {
              "id": 147,
              "name": "阳信县"
            },
            {
              "id": 148,
              "name": "无棣县"
            },
            {
              "id": 149,
              "name": "沾化县"
            },
            {
              "id": 150,
              "name": "博兴县"
            },
            {
              "id": 151,
              "name": "邹平县"
            },
            {
              "id": 152,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 17,
          "name": "菏泽市",
          "area": [
            {
              "id": 153,
              "name": "牡丹区"
            },
            {
              "id": 154,
              "name": "曹县"
            },
            {
              "id": 155,
              "name": "单县"
            },
            {
              "id": 156,
              "name": "成武县"
            },
            {
              "id": 157,
              "name": "巨野县"
            },
            {
              "id": 158,
              "name": "郓城县"
            },
            {
              "id": 159,
              "name": "鄄城县"
            },
            {
              "id": 160,
              "name": "定陶县"
            },
            {
              "id": 161,
              "name": "东明县"
            },
            {
              "id": 162,
              "name": "其它区"
            }
          ]
        }
      ]
    },
    {
      "id": 15,
      "name": "河南",
      "city": [
        {
          "id": 1,
          "name": "郑州市",
          "area": [
            {
              "id": 1,
              "name": "中原区"
            },
            {
              "id": 2,
              "name": "二七区"
            },
            {
              "id": 3,
              "name": "管城回族区"
            },
            {
              "id": 4,
              "name": "金水区"
            },
            {
              "id": 5,
              "name": "上街区"
            },
            {
              "id": 6,
              "name": "惠济区"
            },
            {
              "id": 7,
              "name": "中牟县"
            },
            {
              "id": 8,
              "name": "巩义市"
            },
            {
              "id": 9,
              "name": "荥阳市"
            },
            {
              "id": 10,
              "name": "新密市"
            },
            {
              "id": 11,
              "name": "新郑市"
            },
            {
              "id": 12,
              "name": "登封市"
            },
            {
              "id": 13,
              "name": "郑东新区"
            },
            {
              "id": 14,
              "name": "高新区"
            },
            {
              "id": 15,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 2,
          "name": "开封市",
          "area": [
            {
              "id": 16,
              "name": "龙亭区"
            },
            {
              "id": 17,
              "name": "顺河回族区"
            },
            {
              "id": 18,
              "name": "鼓楼区"
            },
            {
              "id": 19,
              "name": "禹王台区"
            },
            {
              "id": 20,
              "name": "金明区"
            },
            {
              "id": 21,
              "name": "杞县"
            },
            {
              "id": 22,
              "name": "通许县"
            },
            {
              "id": 23,
              "name": "尉氏县"
            },
            {
              "id": 24,
              "name": "开封县"
            },
            {
              "id": 25,
              "name": "兰考县"
            },
            {
              "id": 26,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 3,
          "name": "洛阳市",
          "area": [
            {
              "id": 27,
              "name": "老城区"
            },
            {
              "id": 28,
              "name": "西工区"
            },
            {
              "id": 29,
              "name": "廛河回族区"
            },
            {
              "id": 30,
              "name": "涧西区"
            },
            {
              "id": 31,
              "name": "吉利区"
            },
            {
              "id": 32,
              "name": "洛龙区"
            },
            {
              "id": 33,
              "name": "孟津县"
            },
            {
              "id": 34,
              "name": "新安县"
            },
            {
              "id": 35,
              "name": "栾川县"
            },
            {
              "id": 36,
              "name": "嵩县"
            },
            {
              "id": 37,
              "name": "汝阳县"
            },
            {
              "id": 38,
              "name": "宜阳县"
            },
            {
              "id": 39,
              "name": "洛宁县"
            },
            {
              "id": 40,
              "name": "伊川县"
            },
            {
              "id": 41,
              "name": "偃师市"
            },
            {
              "id": 42,
              "name": "高新区"
            },
            {
              "id": 43,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 4,
          "name": "平顶山市",
          "area": [
            {
              "id": 44,
              "name": "新华区"
            },
            {
              "id": 45,
              "name": "卫东区"
            },
            {
              "id": 46,
              "name": "石龙区"
            },
            {
              "id": 47,
              "name": "湛河区"
            },
            {
              "id": 48,
              "name": "宝丰县"
            },
            {
              "id": 49,
              "name": "叶县"
            },
            {
              "id": 50,
              "name": "鲁山县"
            },
            {
              "id": 51,
              "name": "郏县"
            },
            {
              "id": 52,
              "name": "舞钢市"
            },
            {
              "id": 53,
              "name": "汝州市"
            },
            {
              "id": 54,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 5,
          "name": "安阳市",
          "area": [
            {
              "id": 55,
              "name": "文峰区"
            },
            {
              "id": 56,
              "name": "北关区"
            },
            {
              "id": 57,
              "name": "殷都区"
            },
            {
              "id": 58,
              "name": "龙安区"
            },
            {
              "id": 59,
              "name": "安阳县"
            },
            {
              "id": 60,
              "name": "汤阴县"
            },
            {
              "id": 61,
              "name": "滑县"
            },
            {
              "id": 62,
              "name": "内黄县"
            },
            {
              "id": 63,
              "name": "林州市"
            },
            {
              "id": 64,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 6,
          "name": "鹤壁市",
          "area": [
            {
              "id": 65,
              "name": "鹤山区"
            },
            {
              "id": 66,
              "name": "山城区"
            },
            {
              "id": 67,
              "name": "淇滨区"
            },
            {
              "id": 68,
              "name": "浚县"
            },
            {
              "id": 69,
              "name": "淇县"
            },
            {
              "id": 70,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 7,
          "name": "新乡市",
          "area": [
            {
              "id": 71,
              "name": "红旗区"
            },
            {
              "id": 72,
              "name": "卫滨区"
            },
            {
              "id": 73,
              "name": "凤泉区"
            },
            {
              "id": 74,
              "name": "牧野区"
            },
            {
              "id": 75,
              "name": "新乡县"
            },
            {
              "id": 76,
              "name": "获嘉县"
            },
            {
              "id": 77,
              "name": "原阳县"
            },
            {
              "id": 78,
              "name": "延津县"
            },
            {
              "id": 79,
              "name": "封丘县"
            },
            {
              "id": 80,
              "name": "长垣县"
            },
            {
              "id": 81,
              "name": "卫辉市"
            },
            {
              "id": 82,
              "name": "辉县市"
            },
            {
              "id": 83,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 8,
          "name": "焦作市",
          "area": [
            {
              "id": 84,
              "name": "解放区"
            },
            {
              "id": 85,
              "name": "中站区"
            },
            {
              "id": 86,
              "name": "马村区"
            },
            {
              "id": 87,
              "name": "山阳区"
            },
            {
              "id": 88,
              "name": "修武县"
            },
            {
              "id": 89,
              "name": "博爱县"
            },
            {
              "id": 90,
              "name": "武陟县"
            },
            {
              "id": 91,
              "name": "温县"
            },
            {
              "id": 92,
              "name": "沁阳市"
            },
            {
              "id": 93,
              "name": "孟州市"
            },
            {
              "id": 94,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 9,
          "name": "济源市",
          "area": []
        },
        {
          "id": 10,
          "name": "濮阳市",
          "area": [
            {
              "id": 95,
              "name": "华龙区"
            },
            {
              "id": 96,
              "name": "清丰县"
            },
            {
              "id": 97,
              "name": "南乐县"
            },
            {
              "id": 98,
              "name": "范县"
            },
            {
              "id": 99,
              "name": "台前县"
            },
            {
              "id": 100,
              "name": "濮阳县"
            },
            {
              "id": 101,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 11,
          "name": "许昌市",
          "area": [
            {
              "id": 102,
              "name": "魏都区"
            },
            {
              "id": 103,
              "name": "许昌县"
            },
            {
              "id": 104,
              "name": "鄢陵县"
            },
            {
              "id": 105,
              "name": "襄城县"
            },
            {
              "id": 106,
              "name": "禹州市"
            },
            {
              "id": 107,
              "name": "长葛市"
            },
            {
              "id": 108,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 12,
          "name": "漯河市",
          "area": [
            {
              "id": 109,
              "name": "源汇区"
            },
            {
              "id": 110,
              "name": "郾城区"
            },
            {
              "id": 111,
              "name": "召陵区"
            },
            {
              "id": 112,
              "name": "舞阳县"
            },
            {
              "id": 113,
              "name": "临颍县"
            },
            {
              "id": 114,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 13,
          "name": "三门峡市",
          "area": [
            {
              "id": 115,
              "name": "湖滨区"
            },
            {
              "id": 116,
              "name": "渑池县"
            },
            {
              "id": 117,
              "name": "陕县"
            },
            {
              "id": 118,
              "name": "卢氏县"
            },
            {
              "id": 119,
              "name": "义马市"
            },
            {
              "id": 120,
              "name": "灵宝市"
            },
            {
              "id": 121,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 14,
          "name": "南阳市",
          "area": [
            {
              "id": 122,
              "name": "宛城区"
            },
            {
              "id": 123,
              "name": "卧龙区"
            },
            {
              "id": 124,
              "name": "南召县"
            },
            {
              "id": 125,
              "name": "方城县"
            },
            {
              "id": 126,
              "name": "西峡县"
            },
            {
              "id": 127,
              "name": "镇平县"
            },
            {
              "id": 128,
              "name": "内乡县"
            },
            {
              "id": 129,
              "name": "淅川县"
            },
            {
              "id": 130,
              "name": "社旗县"
            },
            {
              "id": 131,
              "name": "唐河县"
            },
            {
              "id": 132,
              "name": "新野县"
            },
            {
              "id": 133,
              "name": "桐柏县"
            },
            {
              "id": 134,
              "name": "邓州市"
            },
            {
              "id": 135,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 15,
          "name": "商丘市",
          "area": [
            {
              "id": 136,
              "name": "梁园区"
            },
            {
              "id": 137,
              "name": "睢阳区"
            },
            {
              "id": 138,
              "name": "民权县"
            },
            {
              "id": 139,
              "name": "睢县"
            },
            {
              "id": 140,
              "name": "宁陵县"
            },
            {
              "id": 141,
              "name": "柘城县"
            },
            {
              "id": 142,
              "name": "虞城县"
            },
            {
              "id": 143,
              "name": "夏邑县"
            },
            {
              "id": 144,
              "name": "永城市"
            },
            {
              "id": 145,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 16,
          "name": "信阳市",
          "area": [
            {
              "id": 146,
              "name": "浉河区"
            },
            {
              "id": 147,
              "name": "平桥区"
            },
            {
              "id": 148,
              "name": "罗山县"
            },
            {
              "id": 149,
              "name": "光山县"
            },
            {
              "id": 150,
              "name": "新县"
            },
            {
              "id": 151,
              "name": "商城县"
            },
            {
              "id": 152,
              "name": "固始县"
            },
            {
              "id": 153,
              "name": "潢川县"
            },
            {
              "id": 154,
              "name": "淮滨县"
            },
            {
              "id": 155,
              "name": "息县"
            },
            {
              "id": 156,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 17,
          "name": "周口市",
          "area": [
            {
              "id": 157,
              "name": "川汇区"
            },
            {
              "id": 158,
              "name": "扶沟县"
            },
            {
              "id": 159,
              "name": "西华县"
            },
            {
              "id": 160,
              "name": "商水县"
            },
            {
              "id": 161,
              "name": "沈丘县"
            },
            {
              "id": 162,
              "name": "郸城县"
            },
            {
              "id": 163,
              "name": "淮阳县"
            },
            {
              "id": 164,
              "name": "太康县"
            },
            {
              "id": 165,
              "name": "鹿邑县"
            },
            {
              "id": 166,
              "name": "项城市"
            },
            {
              "id": 167,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 18,
          "name": "驻马店市",
          "area": [
            {
              "id": 168,
              "name": "驿城区"
            },
            {
              "id": 169,
              "name": "西平县"
            },
            {
              "id": 170,
              "name": "上蔡县"
            },
            {
              "id": 171,
              "name": "平舆县"
            },
            {
              "id": 172,
              "name": "正阳县"
            },
            {
              "id": 173,
              "name": "确山县"
            },
            {
              "id": 174,
              "name": "泌阳县"
            },
            {
              "id": 175,
              "name": "汝南县"
            },
            {
              "id": 176,
              "name": "遂平县"
            },
            {
              "id": 177,
              "name": "新蔡县"
            },
            {
              "id": 178,
              "name": "其它区"
            }
          ]
        }
      ]
    },
    {
      "id": 16,
      "name": "湖北",
      "city": [
        {
          "id": 1,
          "name": "武汉市",
          "area": [
            {
              "id": 1,
              "name": "江岸区"
            },
            {
              "id": 2,
              "name": "江汉区"
            },
            {
              "id": 3,
              "name": "硚口区"
            },
            {
              "id": 4,
              "name": "汉阳区"
            },
            {
              "id": 5,
              "name": "武昌区"
            },
            {
              "id": 6,
              "name": "青山区"
            },
            {
              "id": 7,
              "name": "洪山区"
            },
            {
              "id": 8,
              "name": "东西湖区"
            },
            {
              "id": 9,
              "name": "汉南区"
            },
            {
              "id": 10,
              "name": "蔡甸区"
            },
            {
              "id": 11,
              "name": "江夏区"
            },
            {
              "id": 12,
              "name": "黄陂区"
            },
            {
              "id": 13,
              "name": "新洲区"
            },
            {
              "id": 14,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 2,
          "name": "黄石市",
          "area": [
            {
              "id": 15,
              "name": "黄石港区"
            },
            {
              "id": 16,
              "name": "西塞山区"
            },
            {
              "id": 17,
              "name": "下陆区"
            },
            {
              "id": 18,
              "name": "铁山区"
            },
            {
              "id": 19,
              "name": "阳新县"
            },
            {
              "id": 20,
              "name": "大冶市"
            },
            {
              "id": 21,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 3,
          "name": "十堰市",
          "area": [
            {
              "id": 22,
              "name": "茅箭区"
            },
            {
              "id": 23,
              "name": "张湾区"
            },
            {
              "id": 24,
              "name": "郧县"
            },
            {
              "id": 25,
              "name": "郧西县"
            },
            {
              "id": 26,
              "name": "竹山县"
            },
            {
              "id": 27,
              "name": "竹溪县"
            },
            {
              "id": 28,
              "name": "房县"
            },
            {
              "id": 29,
              "name": "丹江口市"
            },
            {
              "id": 30,
              "name": "城区"
            },
            {
              "id": 31,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 4,
          "name": "宜昌市",
          "area": [
            {
              "id": 32,
              "name": "西陵区"
            },
            {
              "id": 33,
              "name": "伍家岗区"
            },
            {
              "id": 34,
              "name": "点军区"
            },
            {
              "id": 35,
              "name": "猇亭区"
            },
            {
              "id": 36,
              "name": "夷陵区"
            },
            {
              "id": 37,
              "name": "远安县"
            },
            {
              "id": 38,
              "name": "兴山县"
            },
            {
              "id": 39,
              "name": "秭归县"
            },
            {
              "id": 40,
              "name": "长阳土家族自治县"
            },
            {
              "id": 41,
              "name": "五峰土家族自治县"
            },
            {
              "id": 42,
              "name": "葛洲坝区"
            },
            {
              "id": 43,
              "name": "开发区"
            },
            {
              "id": 44,
              "name": "宜都市"
            },
            {
              "id": 45,
              "name": "当阳市"
            },
            {
              "id": 46,
              "name": "枝江市"
            },
            {
              "id": 47,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 5,
          "name": "襄樊市",
          "area": [
            {
              "id": 48,
              "name": "襄城区"
            },
            {
              "id": 49,
              "name": "樊城区"
            },
            {
              "id": 50,
              "name": "襄阳区"
            },
            {
              "id": 51,
              "name": "南漳县"
            },
            {
              "id": 52,
              "name": "谷城县"
            },
            {
              "id": 53,
              "name": "保康县"
            },
            {
              "id": 54,
              "name": "老河口市"
            },
            {
              "id": 55,
              "name": "枣阳市"
            },
            {
              "id": 56,
              "name": "宜城市"
            },
            {
              "id": 57,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 6,
          "name": "鄂州市",
          "area": [
            {
              "id": 58,
              "name": "梁子湖区"
            },
            {
              "id": 59,
              "name": "华容区"
            },
            {
              "id": 60,
              "name": "鄂城区"
            },
            {
              "id": 61,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 7,
          "name": "荆门市",
          "area": [
            {
              "id": 62,
              "name": "东宝区"
            },
            {
              "id": 63,
              "name": "掇刀区"
            },
            {
              "id": 64,
              "name": "京山县"
            },
            {
              "id": 65,
              "name": "沙洋县"
            },
            {
              "id": 66,
              "name": "钟祥市"
            },
            {
              "id": 67,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 8,
          "name": "孝感市",
          "area": [
            {
              "id": 68,
              "name": "孝南区"
            },
            {
              "id": 69,
              "name": "孝昌县"
            },
            {
              "id": 70,
              "name": "大悟县"
            },
            {
              "id": 71,
              "name": "云梦县"
            },
            {
              "id": 72,
              "name": "应城市"
            },
            {
              "id": 73,
              "name": "安陆市"
            },
            {
              "id": 74,
              "name": "汉川市"
            },
            {
              "id": 75,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 9,
          "name": "荆州市",
          "area": [
            {
              "id": 76,
              "name": "沙市区"
            },
            {
              "id": 77,
              "name": "荆州区"
            },
            {
              "id": 78,
              "name": "公安县"
            },
            {
              "id": 79,
              "name": "监利县"
            },
            {
              "id": 80,
              "name": "江陵县"
            },
            {
              "id": 81,
              "name": "石首市"
            },
            {
              "id": 82,
              "name": "洪湖市"
            },
            {
              "id": 83,
              "name": "松滋市"
            },
            {
              "id": 84,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 10,
          "name": "黄冈市",
          "area": [
            {
              "id": 85,
              "name": "黄州区"
            },
            {
              "id": 86,
              "name": "团风县"
            },
            {
              "id": 87,
              "name": "红安县"
            },
            {
              "id": 88,
              "name": "罗田县"
            },
            {
              "id": 89,
              "name": "英山县"
            },
            {
              "id": 90,
              "name": "浠水县"
            },
            {
              "id": 91,
              "name": "蕲春县"
            },
            {
              "id": 92,
              "name": "黄梅县"
            },
            {
              "id": 93,
              "name": "麻城市"
            },
            {
              "id": 94,
              "name": "武穴市"
            },
            {
              "id": 95,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 11,
          "name": "咸宁市",
          "area": [
            {
              "id": 96,
              "name": "咸安区"
            },
            {
              "id": 97,
              "name": "嘉鱼县"
            },
            {
              "id": 98,
              "name": "通城县"
            },
            {
              "id": 99,
              "name": "崇阳县"
            },
            {
              "id": 100,
              "name": "通山县"
            },
            {
              "id": 101,
              "name": "赤壁市"
            },
            {
              "id": 102,
              "name": "温泉城区"
            },
            {
              "id": 103,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 12,
          "name": "随州市",
          "area": [
            {
              "id": 104,
              "name": "曾都区"
            },
            {
              "id": 105,
              "name": "广水市"
            },
            {
              "id": 106,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 13,
          "name": "恩施土家族苗族自治州",
          "area": [
            {
              "id": 107,
              "name": "恩施市"
            },
            {
              "id": 108,
              "name": "利川市"
            },
            {
              "id": 109,
              "name": "建始县"
            },
            {
              "id": 110,
              "name": "巴东县"
            },
            {
              "id": 111,
              "name": "宣恩县"
            },
            {
              "id": 112,
              "name": "咸丰县"
            },
            {
              "id": 113,
              "name": "来凤县"
            },
            {
              "id": 114,
              "name": "鹤峰县"
            },
            {
              "id": 115,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 14,
          "name": "仙桃市",
          "area": []
        },
        {
          "id": 15,
          "name": "潜江市",
          "area": []
        },
        {
          "id": 16,
          "name": "天门市",
          "area": []
        },
        {
          "id": 17,
          "name": "神农架林区",
          "area": []
        }
      ]
    },
    {
      "id": 17,
      "name": "湖南",
      "city": [
        {
          "id": 1,
          "name": "长沙市",
          "area": [
            {
              "id": 1,
              "name": "芙蓉区"
            },
            {
              "id": 2,
              "name": "天心区"
            },
            {
              "id": 3,
              "name": "岳麓区"
            },
            {
              "id": 4,
              "name": "开福区"
            },
            {
              "id": 5,
              "name": "雨花区"
            },
            {
              "id": 6,
              "name": "长沙县"
            },
            {
              "id": 7,
              "name": "望城县"
            },
            {
              "id": 8,
              "name": "宁乡县"
            },
            {
              "id": 9,
              "name": "浏阳市"
            },
            {
              "id": 10,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 2,
          "name": "株洲市",
          "area": [
            {
              "id": 11,
              "name": "荷塘区"
            },
            {
              "id": 12,
              "name": "芦淞区"
            },
            {
              "id": 13,
              "name": "石峰区"
            },
            {
              "id": 14,
              "name": "天元区"
            },
            {
              "id": 15,
              "name": "株洲县"
            },
            {
              "id": 16,
              "name": "攸县"
            },
            {
              "id": 17,
              "name": "茶陵县"
            },
            {
              "id": 18,
              "name": "炎陵县"
            },
            {
              "id": 19,
              "name": "醴陵市"
            },
            {
              "id": 20,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 3,
          "name": "湘潭市",
          "area": [
            {
              "id": 21,
              "name": "雨湖区"
            },
            {
              "id": 22,
              "name": "岳塘区"
            },
            {
              "id": 23,
              "name": "湘潭县"
            },
            {
              "id": 24,
              "name": "湘乡市"
            },
            {
              "id": 25,
              "name": "韶山市"
            },
            {
              "id": 26,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 4,
          "name": "衡阳市",
          "area": [
            {
              "id": 27,
              "name": "珠晖区"
            },
            {
              "id": 28,
              "name": "雁峰区"
            },
            {
              "id": 29,
              "name": "石鼓区"
            },
            {
              "id": 30,
              "name": "蒸湘区"
            },
            {
              "id": 31,
              "name": "南岳区"
            },
            {
              "id": 32,
              "name": "衡阳县"
            },
            {
              "id": 33,
              "name": "衡南县"
            },
            {
              "id": 34,
              "name": "衡山县"
            },
            {
              "id": 35,
              "name": "衡东县"
            },
            {
              "id": 36,
              "name": "祁东县"
            },
            {
              "id": 37,
              "name": "耒阳市"
            },
            {
              "id": 38,
              "name": "常宁市"
            },
            {
              "id": 39,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 5,
          "name": "邵阳市",
          "area": [
            {
              "id": 40,
              "name": "双清区"
            },
            {
              "id": 41,
              "name": "大祥区"
            },
            {
              "id": 42,
              "name": "北塔区"
            },
            {
              "id": 43,
              "name": "邵东县"
            },
            {
              "id": 44,
              "name": "新邵县"
            },
            {
              "id": 45,
              "name": "邵阳县"
            },
            {
              "id": 46,
              "name": "隆回县"
            },
            {
              "id": 47,
              "name": "洞口县"
            },
            {
              "id": 48,
              "name": "绥宁县"
            },
            {
              "id": 49,
              "name": "新宁县"
            },
            {
              "id": 50,
              "name": "城步苗族自治县"
            },
            {
              "id": 51,
              "name": "武冈市"
            },
            {
              "id": 52,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 6,
          "name": "岳阳市",
          "area": [
            {
              "id": 53,
              "name": "岳阳楼区"
            },
            {
              "id": 54,
              "name": "云溪区"
            },
            {
              "id": 55,
              "name": "君山区"
            },
            {
              "id": 56,
              "name": "岳阳县"
            },
            {
              "id": 57,
              "name": "华容县"
            },
            {
              "id": 58,
              "name": "湘阴县"
            },
            {
              "id": 59,
              "name": "平江县"
            },
            {
              "id": 60,
              "name": "汨罗市"
            },
            {
              "id": 61,
              "name": "临湘市"
            },
            {
              "id": 62,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 7,
          "name": "常德市",
          "area": [
            {
              "id": 63,
              "name": "武陵区"
            },
            {
              "id": 64,
              "name": "鼎城区"
            },
            {
              "id": 65,
              "name": "安乡县"
            },
            {
              "id": 66,
              "name": "汉寿县"
            },
            {
              "id": 67,
              "name": "澧县"
            },
            {
              "id": 68,
              "name": "临澧县"
            },
            {
              "id": 69,
              "name": "桃源县"
            },
            {
              "id": 70,
              "name": "石门县"
            },
            {
              "id": 71,
              "name": "津市市"
            },
            {
              "id": 72,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 8,
          "name": "张家界市",
          "area": [
            {
              "id": 73,
              "name": "永定区"
            },
            {
              "id": 74,
              "name": "武陵源区"
            },
            {
              "id": 75,
              "name": "慈利县"
            },
            {
              "id": 76,
              "name": "桑植县"
            },
            {
              "id": 77,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 9,
          "name": "益阳市",
          "area": [
            {
              "id": 78,
              "name": "资阳区"
            },
            {
              "id": 79,
              "name": "赫山区"
            },
            {
              "id": 80,
              "name": "南县"
            },
            {
              "id": 81,
              "name": "桃江县"
            },
            {
              "id": 82,
              "name": "安化县"
            },
            {
              "id": 83,
              "name": "沅江市"
            },
            {
              "id": 84,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 10,
          "name": "郴州市",
          "area": [
            {
              "id": 85,
              "name": "北湖区"
            },
            {
              "id": 86,
              "name": "苏仙区"
            },
            {
              "id": 87,
              "name": "桂阳县"
            },
            {
              "id": 88,
              "name": "宜章县"
            },
            {
              "id": 89,
              "name": "永兴县"
            },
            {
              "id": 90,
              "name": "嘉禾县"
            },
            {
              "id": 91,
              "name": "临武县"
            },
            {
              "id": 92,
              "name": "汝城县"
            },
            {
              "id": 93,
              "name": "桂东县"
            },
            {
              "id": 94,
              "name": "安仁县"
            },
            {
              "id": 95,
              "name": "资兴市"
            },
            {
              "id": 96,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 11,
          "name": "永州市",
          "area": [
            {
              "id": 97,
              "name": "零陵区"
            },
            {
              "id": 98,
              "name": "冷水滩区"
            },
            {
              "id": 99,
              "name": "祁阳县"
            },
            {
              "id": 100,
              "name": "东安县"
            },
            {
              "id": 101,
              "name": "双牌县"
            },
            {
              "id": 102,
              "name": "道县"
            },
            {
              "id": 103,
              "name": "江永县"
            },
            {
              "id": 104,
              "name": "宁远县"
            },
            {
              "id": 105,
              "name": "蓝山县"
            },
            {
              "id": 106,
              "name": "新田县"
            },
            {
              "id": 107,
              "name": "江华瑶族自治县"
            },
            {
              "id": 108,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 12,
          "name": "怀化市",
          "area": [
            {
              "id": 109,
              "name": "鹤城区"
            },
            {
              "id": 110,
              "name": "中方县"
            },
            {
              "id": 111,
              "name": "沅陵县"
            },
            {
              "id": 112,
              "name": "辰溪县"
            },
            {
              "id": 113,
              "name": "溆浦县"
            },
            {
              "id": 114,
              "name": "会同县"
            },
            {
              "id": 115,
              "name": "麻阳苗族自治县"
            },
            {
              "id": 116,
              "name": "新晃侗族自治县"
            },
            {
              "id": 117,
              "name": "芷江侗族自治县"
            },
            {
              "id": 118,
              "name": "靖州苗族侗族自治县"
            },
            {
              "id": 119,
              "name": "通道侗族自治县"
            },
            {
              "id": 120,
              "name": "洪江市"
            },
            {
              "id": 121,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 13,
          "name": "娄底市",
          "area": [
            {
              "id": 122,
              "name": "娄星区"
            },
            {
              "id": 123,
              "name": "双峰县"
            },
            {
              "id": 124,
              "name": "新化县"
            },
            {
              "id": 125,
              "name": "冷水江市"
            },
            {
              "id": 126,
              "name": "涟源市"
            },
            {
              "id": 127,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 14,
          "name": "湘西土家族苗族自治州",
          "area": [
            {
              "id": 128,
              "name": "吉首市"
            },
            {
              "id": 129,
              "name": "泸溪县"
            },
            {
              "id": 130,
              "name": "凤凰县"
            },
            {
              "id": 131,
              "name": "花垣县"
            },
            {
              "id": 132,
              "name": "保靖县"
            },
            {
              "id": 133,
              "name": "古丈县"
            },
            {
              "id": 134,
              "name": "永顺县"
            },
            {
              "id": 135,
              "name": "龙山县"
            },
            {
              "id": 136,
              "name": "其它区"
            }
          ]
        }
      ]
    },
    {
      "id": 18,
      "name": "广东",
      "city": [
        {
          "id": 1,
          "name": "广州市",
          "area": [
            {
              "id": 1,
              "name": "荔湾区"
            },
            {
              "id": 2,
              "name": "越秀区"
            },
            {
              "id": 3,
              "name": "海珠区"
            },
            {
              "id": 4,
              "name": "天河区"
            },
            {
              "id": 5,
              "name": "白云区"
            },
            {
              "id": 6,
              "name": "黄埔区"
            },
            {
              "id": 7,
              "name": "番禺区"
            },
            {
              "id": 8,
              "name": "花都区"
            },
            {
              "id": 9,
              "name": "南沙区"
            },
            {
              "id": 10,
              "name": "萝岗区"
            },
            {
              "id": 11,
              "name": "增城市"
            },
            {
              "id": 12,
              "name": "从化市"
            },
            {
              "id": 13,
              "name": "东山区"
            },
            {
              "id": 14,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 2,
          "name": "韶关市",
          "area": [
            {
              "id": 15,
              "name": "武江区"
            },
            {
              "id": 16,
              "name": "浈江区"
            },
            {
              "id": 17,
              "name": "曲江区"
            },
            {
              "id": 18,
              "name": "始兴县"
            },
            {
              "id": 19,
              "name": "仁化县"
            },
            {
              "id": 20,
              "name": "翁源县"
            },
            {
              "id": 21,
              "name": "乳源瑶族自治县"
            },
            {
              "id": 22,
              "name": "新丰县"
            },
            {
              "id": 23,
              "name": "乐昌市"
            },
            {
              "id": 24,
              "name": "南雄市"
            },
            {
              "id": 25,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 3,
          "name": "深圳市",
          "area": [
            {
              "id": 26,
              "name": "罗湖区"
            },
            {
              "id": 27,
              "name": "福田区"
            },
            {
              "id": 28,
              "name": "南山区"
            },
            {
              "id": 29,
              "name": "宝安区"
            },
            {
              "id": 30,
              "name": "龙岗区"
            },
            {
              "id": 31,
              "name": "盐田区"
            },
            {
              "id": 32,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 4,
          "name": "珠海市",
          "area": [
            {
              "id": 33,
              "name": "香洲区"
            },
            {
              "id": 34,
              "name": "斗门区"
            },
            {
              "id": 35,
              "name": "金湾区"
            },
            {
              "id": 36,
              "name": "金唐区"
            },
            {
              "id": 37,
              "name": "南湾区"
            },
            {
              "id": 38,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 5,
          "name": "汕头市",
          "area": [
            {
              "id": 39,
              "name": "龙湖区"
            },
            {
              "id": 40,
              "name": "金平区"
            },
            {
              "id": 41,
              "name": "濠江区"
            },
            {
              "id": 42,
              "name": "潮阳区"
            },
            {
              "id": 43,
              "name": "潮南区"
            },
            {
              "id": 44,
              "name": "澄海区"
            },
            {
              "id": 45,
              "name": "南澳县"
            },
            {
              "id": 46,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 6,
          "name": "佛山市",
          "area": [
            {
              "id": 47,
              "name": "禅城区"
            },
            {
              "id": 48,
              "name": "南海区"
            },
            {
              "id": 49,
              "name": "顺德区"
            },
            {
              "id": 50,
              "name": "三水区"
            },
            {
              "id": 51,
              "name": "高明区"
            },
            {
              "id": 52,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 7,
          "name": "江门市",
          "area": [
            {
              "id": 53,
              "name": "蓬江区"
            },
            {
              "id": 54,
              "name": "江海区"
            },
            {
              "id": 55,
              "name": "新会区"
            },
            {
              "id": 56,
              "name": "台山市"
            },
            {
              "id": 57,
              "name": "开平市"
            },
            {
              "id": 58,
              "name": "鹤山市"
            },
            {
              "id": 59,
              "name": "恩平市"
            },
            {
              "id": 60,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 8,
          "name": "湛江市",
          "area": [
            {
              "id": 61,
              "name": "赤坎区"
            },
            {
              "id": 62,
              "name": "霞山区"
            },
            {
              "id": 63,
              "name": "坡头区"
            },
            {
              "id": 64,
              "name": "麻章区"
            },
            {
              "id": 65,
              "name": "遂溪县"
            },
            {
              "id": 66,
              "name": "徐闻县"
            },
            {
              "id": 67,
              "name": "廉江市"
            },
            {
              "id": 68,
              "name": "雷州市"
            },
            {
              "id": 69,
              "name": "吴川市"
            },
            {
              "id": 70,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 9,
          "name": "茂名市",
          "area": [
            {
              "id": 71,
              "name": "茂南区"
            },
            {
              "id": 72,
              "name": "茂港区"
            },
            {
              "id": 73,
              "name": "电白县"
            },
            {
              "id": 74,
              "name": "高州市"
            },
            {
              "id": 75,
              "name": "化州市"
            },
            {
              "id": 76,
              "name": "信宜市"
            },
            {
              "id": 77,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 10,
          "name": "肇庆市",
          "area": [
            {
              "id": 78,
              "name": "端州区"
            },
            {
              "id": 79,
              "name": "鼎湖区"
            },
            {
              "id": 80,
              "name": "广宁县"
            },
            {
              "id": 81,
              "name": "怀集县"
            },
            {
              "id": 82,
              "name": "封开县"
            },
            {
              "id": 83,
              "name": "德庆县"
            },
            {
              "id": 84,
              "name": "高要市"
            },
            {
              "id": 85,
              "name": "四会市"
            },
            {
              "id": 86,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 11,
          "name": "惠州市",
          "area": [
            {
              "id": 87,
              "name": "惠城区"
            },
            {
              "id": 88,
              "name": "惠阳区"
            },
            {
              "id": 89,
              "name": "博罗县"
            },
            {
              "id": 90,
              "name": "惠东县"
            },
            {
              "id": 91,
              "name": "龙门县"
            },
            {
              "id": 92,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 12,
          "name": "梅州市",
          "area": [
            {
              "id": 93,
              "name": "梅江区"
            },
            {
              "id": 94,
              "name": "梅县"
            },
            {
              "id": 95,
              "name": "大埔县"
            },
            {
              "id": 96,
              "name": "丰顺县"
            },
            {
              "id": 97,
              "name": "五华县"
            },
            {
              "id": 98,
              "name": "平远县"
            },
            {
              "id": 99,
              "name": "蕉岭县"
            },
            {
              "id": 100,
              "name": "兴宁市"
            },
            {
              "id": 101,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 13,
          "name": "汕尾市",
          "area": [
            {
              "id": 102,
              "name": "城区"
            },
            {
              "id": 103,
              "name": "海丰县"
            },
            {
              "id": 104,
              "name": "陆河县"
            },
            {
              "id": 105,
              "name": "陆丰市"
            },
            {
              "id": 106,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 14,
          "name": "河源市",
          "area": [
            {
              "id": 107,
              "name": "源城区"
            },
            {
              "id": 108,
              "name": "紫金县"
            },
            {
              "id": 109,
              "name": "龙川县"
            },
            {
              "id": 110,
              "name": "连平县"
            },
            {
              "id": 111,
              "name": "和平县"
            },
            {
              "id": 112,
              "name": "东源县"
            },
            {
              "id": 113,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 15,
          "name": "阳江市",
          "area": [
            {
              "id": 114,
              "name": "江城区"
            },
            {
              "id": 115,
              "name": "阳西县"
            },
            {
              "id": 116,
              "name": "阳东县"
            },
            {
              "id": 117,
              "name": "阳春市"
            },
            {
              "id": 118,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 16,
          "name": "清远市",
          "area": [
            {
              "id": 119,
              "name": "清城区"
            },
            {
              "id": 120,
              "name": "佛冈县"
            },
            {
              "id": 121,
              "name": "阳山县"
            },
            {
              "id": 122,
              "name": "连山壮族瑶族自治县"
            },
            {
              "id": 123,
              "name": "连南瑶族自治县"
            },
            {
              "id": 124,
              "name": "清新县"
            },
            {
              "id": 125,
              "name": "英德市"
            },
            {
              "id": 126,
              "name": "连州市"
            },
            {
              "id": 127,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 17,
          "name": "东莞市",
          "area": []
        },
        {
          "id": 18,
          "name": "中山市",
          "area": []
        },
        {
          "id": 19,
          "name": "潮州市",
          "area": [
            {
              "id": 128,
              "name": "湘桥区"
            },
            {
              "id": 129,
              "name": "潮安县"
            },
            {
              "id": 130,
              "name": "饶平县"
            },
            {
              "id": 131,
              "name": "枫溪区"
            },
            {
              "id": 132,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 20,
          "name": "揭阳市",
          "area": [
            {
              "id": 133,
              "name": "榕城区"
            },
            {
              "id": 134,
              "name": "揭东县"
            },
            {
              "id": 135,
              "name": "揭西县"
            },
            {
              "id": 136,
              "name": "惠来县"
            },
            {
              "id": 137,
              "name": "普宁市"
            },
            {
              "id": 138,
              "name": "东山区"
            },
            {
              "id": 139,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 21,
          "name": "云浮市",
          "area": [
            {
              "id": 140,
              "name": "云城区"
            },
            {
              "id": 141,
              "name": "新兴县"
            },
            {
              "id": 142,
              "name": "郁南县"
            },
            {
              "id": 143,
              "name": "云安县"
            },
            {
              "id": 144,
              "name": "罗定市"
            },
            {
              "id": 145,
              "name": "其它区"
            }
          ]
        }
      ]
    },
    {
      "id": 19,
      "name": "广西",
      "city": [
        {
          "id": 1,
          "name": "南宁市",
          "area": [
            {
              "id": 1,
              "name": "兴宁区"
            },
            {
              "id": 2,
              "name": "青秀区"
            },
            {
              "id": 3,
              "name": "江南区"
            },
            {
              "id": 4,
              "name": "西乡塘区"
            },
            {
              "id": 5,
              "name": "良庆区"
            },
            {
              "id": 6,
              "name": "邕宁区"
            },
            {
              "id": 7,
              "name": "武鸣县"
            },
            {
              "id": 8,
              "name": "隆安县"
            },
            {
              "id": 9,
              "name": "马山县"
            },
            {
              "id": 10,
              "name": "上林县"
            },
            {
              "id": 11,
              "name": "宾阳县"
            },
            {
              "id": 12,
              "name": "横县"
            },
            {
              "id": 13,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 2,
          "name": "柳州市",
          "area": [
            {
              "id": 14,
              "name": "城中区"
            },
            {
              "id": 15,
              "name": "鱼峰区"
            },
            {
              "id": 16,
              "name": "柳南区"
            },
            {
              "id": 17,
              "name": "柳北区"
            },
            {
              "id": 18,
              "name": "柳江县"
            },
            {
              "id": 19,
              "name": "柳城县"
            },
            {
              "id": 20,
              "name": "鹿寨县"
            },
            {
              "id": 21,
              "name": "融安县"
            },
            {
              "id": 22,
              "name": "融水苗族自治县"
            },
            {
              "id": 23,
              "name": "三江侗族自治县"
            },
            {
              "id": 24,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 3,
          "name": "桂林市",
          "area": [
            {
              "id": 25,
              "name": "秀峰区"
            },
            {
              "id": 26,
              "name": "叠彩区"
            },
            {
              "id": 27,
              "name": "象山区"
            },
            {
              "id": 28,
              "name": "七星区"
            },
            {
              "id": 29,
              "name": "雁山区"
            },
            {
              "id": 30,
              "name": "阳朔县"
            },
            {
              "id": 31,
              "name": "临桂县"
            },
            {
              "id": 32,
              "name": "灵川县"
            },
            {
              "id": 33,
              "name": "全州县"
            },
            {
              "id": 34,
              "name": "兴安县"
            },
            {
              "id": 35,
              "name": "永福县"
            },
            {
              "id": 36,
              "name": "灌阳县"
            },
            {
              "id": 37,
              "name": "龙胜各族自治县"
            },
            {
              "id": 38,
              "name": "资源县"
            },
            {
              "id": 39,
              "name": "平乐县"
            },
            {
              "id": 40,
              "name": "荔浦县"
            },
            {
              "id": 41,
              "name": "恭城瑶族自治县"
            },
            {
              "id": 42,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 4,
          "name": "梧州市",
          "area": [
            {
              "id": 43,
              "name": "万秀区"
            },
            {
              "id": 44,
              "name": "蝶山区"
            },
            {
              "id": 45,
              "name": "长洲区"
            },
            {
              "id": 46,
              "name": "苍梧县"
            },
            {
              "id": 47,
              "name": "藤县"
            },
            {
              "id": 48,
              "name": "蒙山县"
            },
            {
              "id": 49,
              "name": "岑溪市"
            },
            {
              "id": 50,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 5,
          "name": "北海市",
          "area": [
            {
              "id": 51,
              "name": "海城区"
            },
            {
              "id": 52,
              "name": "银海区"
            },
            {
              "id": 53,
              "name": "铁山港区"
            },
            {
              "id": 54,
              "name": "合浦县"
            },
            {
              "id": 55,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 6,
          "name": "防城港市",
          "area": [
            {
              "id": 56,
              "name": "港口区"
            },
            {
              "id": 57,
              "name": "防城区"
            },
            {
              "id": 58,
              "name": "上思县"
            },
            {
              "id": 59,
              "name": "东兴市"
            },
            {
              "id": 60,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 7,
          "name": "钦州市",
          "area": [
            {
              "id": 61,
              "name": "钦南区"
            },
            {
              "id": 62,
              "name": "钦北区"
            },
            {
              "id": 63,
              "name": "灵山县"
            },
            {
              "id": 64,
              "name": "浦北县"
            },
            {
              "id": 65,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 8,
          "name": "贵港市",
          "area": [
            {
              "id": 66,
              "name": "港北区"
            },
            {
              "id": 67,
              "name": "港南区"
            },
            {
              "id": 68,
              "name": "覃塘区"
            },
            {
              "id": 69,
              "name": "平南县"
            },
            {
              "id": 70,
              "name": "桂平市"
            },
            {
              "id": 71,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 9,
          "name": "玉林市",
          "area": [
            {
              "id": 72,
              "name": "玉州区"
            },
            {
              "id": 73,
              "name": "容县"
            },
            {
              "id": 74,
              "name": "陆川县"
            },
            {
              "id": 75,
              "name": "博白县"
            },
            {
              "id": 76,
              "name": "兴业县"
            },
            {
              "id": 77,
              "name": "北流市"
            },
            {
              "id": 78,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 10,
          "name": "百色市",
          "area": [
            {
              "id": 79,
              "name": "右江区"
            },
            {
              "id": 80,
              "name": "田阳县"
            },
            {
              "id": 81,
              "name": "田东县"
            },
            {
              "id": 82,
              "name": "平果县"
            },
            {
              "id": 83,
              "name": "德保县"
            },
            {
              "id": 84,
              "name": "靖西县"
            },
            {
              "id": 85,
              "name": "那坡县"
            },
            {
              "id": 86,
              "name": "凌云县"
            },
            {
              "id": 87,
              "name": "乐业县"
            },
            {
              "id": 88,
              "name": "田林县"
            },
            {
              "id": 89,
              "name": "西林县"
            },
            {
              "id": 90,
              "name": "隆林各族自治县"
            },
            {
              "id": 91,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 11,
          "name": "贺州市",
          "area": [
            {
              "id": 92,
              "name": "八步区"
            },
            {
              "id": 93,
              "name": "昭平县"
            },
            {
              "id": 94,
              "name": "钟山县"
            },
            {
              "id": 95,
              "name": "富川瑶族自治县"
            },
            {
              "id": 96,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 12,
          "name": "河池市",
          "area": [
            {
              "id": 97,
              "name": "金城江区"
            },
            {
              "id": 98,
              "name": "南丹县"
            },
            {
              "id": 99,
              "name": "天峨县"
            },
            {
              "id": 100,
              "name": "凤山县"
            },
            {
              "id": 101,
              "name": "东兰县"
            },
            {
              "id": 102,
              "name": "罗城仫佬族自治县"
            },
            {
              "id": 103,
              "name": "环江毛南族自治县"
            },
            {
              "id": 104,
              "name": "巴马瑶族自治县"
            },
            {
              "id": 105,
              "name": "都安瑶族自治县"
            },
            {
              "id": 106,
              "name": "大化瑶族自治县"
            },
            {
              "id": 107,
              "name": "宜州市"
            },
            {
              "id": 108,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 13,
          "name": "来宾市",
          "area": [
            {
              "id": 109,
              "name": "兴宾区"
            },
            {
              "id": 110,
              "name": "忻城县"
            },
            {
              "id": 111,
              "name": "象州县"
            },
            {
              "id": 112,
              "name": "武宣县"
            },
            {
              "id": 113,
              "name": "金秀瑶族自治县"
            },
            {
              "id": 114,
              "name": "合山市"
            },
            {
              "id": 115,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 14,
          "name": "崇左市",
          "area": [
            {
              "id": 116,
              "name": "江州区"
            },
            {
              "id": 117,
              "name": "扶绥县"
            },
            {
              "id": 118,
              "name": "宁明县"
            },
            {
              "id": 119,
              "name": "龙州县"
            },
            {
              "id": 120,
              "name": "大新县"
            },
            {
              "id": 121,
              "name": "天等县"
            },
            {
              "id": 122,
              "name": "凭祥市"
            },
            {
              "id": 123,
              "name": "其它区"
            }
          ]
        }
      ]
    },
    {
      "id": 20,
      "name": "海南",
      "city": [
        {
          "id": 1,
          "name": "海口市",
          "area": [
            {
              "id": 1,
              "name": "秀英区"
            },
            {
              "id": 2,
              "name": "龙华区"
            },
            {
              "id": 3,
              "name": "琼山区"
            },
            {
              "id": 4,
              "name": "美兰区"
            },
            {
              "id": 5,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 2,
          "name": "三亚市",
          "area": []
        },
        {
          "id": 3,
          "name": "五指山市",
          "area": []
        },
        {
          "id": 4,
          "name": "琼海市",
          "area": []
        },
        {
          "id": 5,
          "name": "儋州市",
          "area": []
        },
        {
          "id": 6,
          "name": "文昌市",
          "area": []
        },
        {
          "id": 7,
          "name": "万宁市",
          "area": []
        },
        {
          "id": 8,
          "name": "东方市",
          "area": []
        },
        {
          "id": 9,
          "name": "定安县",
          "area": []
        },
        {
          "id": 10,
          "name": "屯昌县",
          "area": []
        },
        {
          "id": 11,
          "name": "澄迈县",
          "area": []
        },
        {
          "id": 12,
          "name": "临高县",
          "area": []
        },
        {
          "id": 13,
          "name": "白沙黎族自治县",
          "area": []
        },
        {
          "id": 14,
          "name": "昌江黎族自治县",
          "area": []
        },
        {
          "id": 15,
          "name": "乐东黎族自治县",
          "area": []
        },
        {
          "id": 16,
          "name": "陵水黎族自治县",
          "area": []
        },
        {
          "id": 17,
          "name": "保亭黎族苗族自治县",
          "area": []
        },
        {
          "id": 18,
          "name": "琼中黎族苗族自治县",
          "area": []
        },
        {
          "id": 19,
          "name": "西沙群岛",
          "area": []
        },
        {
          "id": 20,
          "name": "南沙群岛",
          "area": []
        },
        {
          "id": 21,
          "name": "中沙群岛的岛礁及其海域",
          "area": []
        }
      ]
    },
    {
      "id": 21,
      "name": "重庆",
      "city": [
        {
          "id": 1,
          "name": "重庆市",
          "area": [
            {
              "id": 1,
              "name": "万州区"
            },
            {
              "id": 2,
              "name": "涪陵区"
            },
            {
              "id": 3,
              "name": "渝中区"
            },
            {
              "id": 4,
              "name": "大渡口区"
            },
            {
              "id": 5,
              "name": "江北区"
            },
            {
              "id": 6,
              "name": "沙坪坝区"
            },
            {
              "id": 7,
              "name": "九龙坡区"
            },
            {
              "id": 8,
              "name": "南岸区"
            },
            {
              "id": 9,
              "name": "北碚区"
            },
            {
              "id": 10,
              "name": "万盛区"
            },
            {
              "id": 11,
              "name": "双桥区"
            },
            {
              "id": 12,
              "name": "渝北区"
            },
            {
              "id": 13,
              "name": "巴南区"
            },
            {
              "id": 14,
              "name": "黔江区"
            },
            {
              "id": 15,
              "name": "长寿区"
            },
            {
              "id": 16,
              "name": "綦江县"
            },
            {
              "id": 17,
              "name": "潼南县"
            },
            {
              "id": 18,
              "name": "铜梁县"
            },
            {
              "id": 19,
              "name": "大足县"
            },
            {
              "id": 20,
              "name": "荣昌县"
            },
            {
              "id": 21,
              "name": "璧山县"
            },
            {
              "id": 22,
              "name": "梁平县"
            },
            {
              "id": 23,
              "name": "城口县"
            },
            {
              "id": 24,
              "name": "丰都县"
            },
            {
              "id": 25,
              "name": "垫江县"
            },
            {
              "id": 26,
              "name": "武隆县"
            },
            {
              "id": 27,
              "name": "忠县"
            },
            {
              "id": 28,
              "name": "开县"
            },
            {
              "id": 29,
              "name": "云阳县"
            },
            {
              "id": 30,
              "name": "奉节县"
            },
            {
              "id": 31,
              "name": "巫山县"
            },
            {
              "id": 32,
              "name": "巫溪县"
            },
            {
              "id": 33,
              "name": "石柱土家族自治县"
            },
            {
              "id": 34,
              "name": "秀山土家族苗族自治县"
            },
            {
              "id": 35,
              "name": "酉阳土家族苗族自治县"
            },
            {
              "id": 36,
              "name": "彭水苗族土家族自治县"
            },
            {
              "id": 37,
              "name": "江津区"
            },
            {
              "id": 38,
              "name": "合川区"
            },
            {
              "id": 39,
              "name": "永川区"
            },
            {
              "id": 40,
              "name": "南川区"
            },
            {
              "id": 41,
              "name": "其它区"
            }
          ]
        }
      ]
    },
    {
      "id": 22,
      "name": "四川",
      "city": [
        {
          "id": 1,
          "name": "成都市",
          "area": [
            {
              "id": 1,
              "name": "锦江区"
            },
            {
              "id": 2,
              "name": "青羊区"
            },
            {
              "id": 3,
              "name": "金牛区"
            },
            {
              "id": 4,
              "name": "武侯区"
            },
            {
              "id": 5,
              "name": "成华区"
            },
            {
              "id": 6,
              "name": "龙泉驿区"
            },
            {
              "id": 7,
              "name": "青白江区"
            },
            {
              "id": 8,
              "name": "新都区"
            },
            {
              "id": 9,
              "name": "温江区"
            },
            {
              "id": 10,
              "name": "金堂县"
            },
            {
              "id": 11,
              "name": "双流县"
            },
            {
              "id": 12,
              "name": "郫县"
            },
            {
              "id": 13,
              "name": "大邑县"
            },
            {
              "id": 14,
              "name": "蒲江县"
            },
            {
              "id": 15,
              "name": "新津县"
            },
            {
              "id": 16,
              "name": "都江堰市"
            },
            {
              "id": 17,
              "name": "彭州市"
            },
            {
              "id": 18,
              "name": "邛崃市"
            },
            {
              "id": 19,
              "name": "崇州市"
            },
            {
              "id": 20,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 2,
          "name": "自贡市",
          "area": [
            {
              "id": 21,
              "name": "自流井区"
            },
            {
              "id": 22,
              "name": "贡井区"
            },
            {
              "id": 23,
              "name": "大安区"
            },
            {
              "id": 24,
              "name": "沿滩区"
            },
            {
              "id": 25,
              "name": "荣县"
            },
            {
              "id": 26,
              "name": "富顺县"
            },
            {
              "id": 27,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 3,
          "name": "攀枝花市",
          "area": [
            {
              "id": 28,
              "name": "东区"
            },
            {
              "id": 29,
              "name": "西区"
            },
            {
              "id": 30,
              "name": "仁和区"
            },
            {
              "id": 31,
              "name": "米易县"
            },
            {
              "id": 32,
              "name": "盐边县"
            },
            {
              "id": 33,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 4,
          "name": "泸州市",
          "area": [
            {
              "id": 34,
              "name": "江阳区"
            },
            {
              "id": 35,
              "name": "纳溪区"
            },
            {
              "id": 36,
              "name": "龙马潭区"
            },
            {
              "id": 37,
              "name": "泸县"
            },
            {
              "id": 38,
              "name": "合江县"
            },
            {
              "id": 39,
              "name": "叙永县"
            },
            {
              "id": 40,
              "name": "古蔺县"
            },
            {
              "id": 41,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 5,
          "name": "德阳市",
          "area": [
            {
              "id": 42,
              "name": "旌阳区"
            },
            {
              "id": 43,
              "name": "中江县"
            },
            {
              "id": 44,
              "name": "罗江县"
            },
            {
              "id": 45,
              "name": "广汉市"
            },
            {
              "id": 46,
              "name": "什邡市"
            },
            {
              "id": 47,
              "name": "绵竹市"
            },
            {
              "id": 48,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 6,
          "name": "绵阳市",
          "area": [
            {
              "id": 49,
              "name": "涪城区"
            },
            {
              "id": 50,
              "name": "游仙区"
            },
            {
              "id": 51,
              "name": "三台县"
            },
            {
              "id": 52,
              "name": "盐亭县"
            },
            {
              "id": 53,
              "name": "安县"
            },
            {
              "id": 54,
              "name": "梓潼县"
            },
            {
              "id": 55,
              "name": "北川羌族自治县"
            },
            {
              "id": 56,
              "name": "平武县"
            },
            {
              "id": 57,
              "name": "高新区"
            },
            {
              "id": 58,
              "name": "江油市"
            },
            {
              "id": 59,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 7,
          "name": "广元市",
          "area": [
            {
              "id": 60,
              "name": "利州区"
            },
            {
              "id": 61,
              "name": "元坝区"
            },
            {
              "id": 62,
              "name": "朝天区"
            },
            {
              "id": 63,
              "name": "旺苍县"
            },
            {
              "id": 64,
              "name": "青川县"
            },
            {
              "id": 65,
              "name": "剑阁县"
            },
            {
              "id": 66,
              "name": "苍溪县"
            },
            {
              "id": 67,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 8,
          "name": "遂宁市",
          "area": [
            {
              "id": 68,
              "name": "船山区"
            },
            {
              "id": 69,
              "name": "安居区"
            },
            {
              "id": 70,
              "name": "蓬溪县"
            },
            {
              "id": 71,
              "name": "射洪县"
            },
            {
              "id": 72,
              "name": "大英县"
            },
            {
              "id": 73,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 9,
          "name": "内江市",
          "area": [
            {
              "id": 74,
              "name": "市中区"
            },
            {
              "id": 75,
              "name": "东兴区"
            },
            {
              "id": 76,
              "name": "威远县"
            },
            {
              "id": 77,
              "name": "资中县"
            },
            {
              "id": 78,
              "name": "隆昌县"
            },
            {
              "id": 79,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 10,
          "name": "乐山市",
          "area": [
            {
              "id": 80,
              "name": "市中区"
            },
            {
              "id": 81,
              "name": "沙湾区"
            },
            {
              "id": 82,
              "name": "五通桥区"
            },
            {
              "id": 83,
              "name": "金口河区"
            },
            {
              "id": 84,
              "name": "犍为县"
            },
            {
              "id": 85,
              "name": "井研县"
            },
            {
              "id": 86,
              "name": "夹江县"
            },
            {
              "id": 87,
              "name": "沐川县"
            },
            {
              "id": 88,
              "name": "峨边彝族自治县"
            },
            {
              "id": 89,
              "name": "马边彝族自治县"
            },
            {
              "id": 90,
              "name": "峨眉山市"
            },
            {
              "id": 91,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 11,
          "name": "南充市",
          "area": [
            {
              "id": 92,
              "name": "顺庆区"
            },
            {
              "id": 93,
              "name": "高坪区"
            },
            {
              "id": 94,
              "name": "嘉陵区"
            },
            {
              "id": 95,
              "name": "南部县"
            },
            {
              "id": 96,
              "name": "营山县"
            },
            {
              "id": 97,
              "name": "蓬安县"
            },
            {
              "id": 98,
              "name": "仪陇县"
            },
            {
              "id": 99,
              "name": "西充县"
            },
            {
              "id": 100,
              "name": "阆中市"
            },
            {
              "id": 101,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 12,
          "name": "眉山市",
          "area": [
            {
              "id": 102,
              "name": "东坡区"
            },
            {
              "id": 103,
              "name": "仁寿县"
            },
            {
              "id": 104,
              "name": "彭山县"
            },
            {
              "id": 105,
              "name": "洪雅县"
            },
            {
              "id": 106,
              "name": "丹棱县"
            },
            {
              "id": 107,
              "name": "青神县"
            },
            {
              "id": 108,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 13,
          "name": "宜宾市",
          "area": [
            {
              "id": 109,
              "name": "翠屏区"
            },
            {
              "id": 110,
              "name": "宜宾县"
            },
            {
              "id": 111,
              "name": "南溪县"
            },
            {
              "id": 112,
              "name": "江安县"
            },
            {
              "id": 113,
              "name": "长宁县"
            },
            {
              "id": 114,
              "name": "高县"
            },
            {
              "id": 115,
              "name": "珙县"
            },
            {
              "id": 116,
              "name": "筠连县"
            },
            {
              "id": 117,
              "name": "兴文县"
            },
            {
              "id": 118,
              "name": "屏山县"
            },
            {
              "id": 119,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 14,
          "name": "广安市",
          "area": [
            {
              "id": 120,
              "name": "广安区"
            },
            {
              "id": 121,
              "name": "岳池县"
            },
            {
              "id": 122,
              "name": "武胜县"
            },
            {
              "id": 123,
              "name": "邻水县"
            },
            {
              "id": 124,
              "name": "华蓥市"
            },
            {
              "id": 125,
              "name": "市辖区"
            },
            {
              "id": 126,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 15,
          "name": "达州市",
          "area": [
            {
              "id": 127,
              "name": "通川区"
            },
            {
              "id": 128,
              "name": "达县"
            },
            {
              "id": 129,
              "name": "宣汉县"
            },
            {
              "id": 130,
              "name": "开江县"
            },
            {
              "id": 131,
              "name": "大竹县"
            },
            {
              "id": 132,
              "name": "渠县"
            },
            {
              "id": 133,
              "name": "万源市"
            },
            {
              "id": 134,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 16,
          "name": "雅安市",
          "area": [
            {
              "id": 135,
              "name": "雨城区"
            },
            {
              "id": 136,
              "name": "名山县"
            },
            {
              "id": 137,
              "name": "荥经县"
            },
            {
              "id": 138,
              "name": "汉源县"
            },
            {
              "id": 139,
              "name": "石棉县"
            },
            {
              "id": 140,
              "name": "天全县"
            },
            {
              "id": 141,
              "name": "芦山县"
            },
            {
              "id": 142,
              "name": "宝兴县"
            },
            {
              "id": 143,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 17,
          "name": "巴中市",
          "area": [
            {
              "id": 144,
              "name": "巴州区"
            },
            {
              "id": 145,
              "name": "通江县"
            },
            {
              "id": 146,
              "name": "南江县"
            },
            {
              "id": 147,
              "name": "平昌县"
            },
            {
              "id": 148,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 18,
          "name": "资阳市",
          "area": [
            {
              "id": 149,
              "name": "雁江区"
            },
            {
              "id": 150,
              "name": "安岳县"
            },
            {
              "id": 151,
              "name": "乐至县"
            },
            {
              "id": 152,
              "name": "简阳市"
            },
            {
              "id": 153,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 19,
          "name": "阿坝藏族羌族自治州",
          "area": [
            {
              "id": 154,
              "name": "汶川县"
            },
            {
              "id": 155,
              "name": "理县"
            },
            {
              "id": 156,
              "name": "茂县"
            },
            {
              "id": 157,
              "name": "松潘县"
            },
            {
              "id": 158,
              "name": "九寨沟县"
            },
            {
              "id": 159,
              "name": "金川县"
            },
            {
              "id": 160,
              "name": "小金县"
            },
            {
              "id": 161,
              "name": "黑水县"
            },
            {
              "id": 162,
              "name": "马尔康县"
            },
            {
              "id": 163,
              "name": "壤塘县"
            },
            {
              "id": 164,
              "name": "阿坝县"
            },
            {
              "id": 165,
              "name": "若尔盖县"
            },
            {
              "id": 166,
              "name": "红原县"
            },
            {
              "id": 167,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 20,
          "name": "甘孜藏族自治州",
          "area": [
            {
              "id": 168,
              "name": "康定县"
            },
            {
              "id": 169,
              "name": "泸定县"
            },
            {
              "id": 170,
              "name": "丹巴县"
            },
            {
              "id": 171,
              "name": "九龙县"
            },
            {
              "id": 172,
              "name": "雅江县"
            },
            {
              "id": 173,
              "name": "道孚县"
            },
            {
              "id": 174,
              "name": "炉霍县"
            },
            {
              "id": 175,
              "name": "甘孜县"
            },
            {
              "id": 176,
              "name": "新龙县"
            },
            {
              "id": 177,
              "name": "德格县"
            },
            {
              "id": 178,
              "name": "白玉县"
            },
            {
              "id": 179,
              "name": "石渠县"
            },
            {
              "id": 180,
              "name": "色达县"
            },
            {
              "id": 181,
              "name": "理塘县"
            },
            {
              "id": 182,
              "name": "巴塘县"
            },
            {
              "id": 183,
              "name": "乡城县"
            },
            {
              "id": 184,
              "name": "稻城县"
            },
            {
              "id": 185,
              "name": "得荣县"
            },
            {
              "id": 186,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 21,
          "name": "凉山彝族自治州",
          "area": [
            {
              "id": 187,
              "name": "西昌市"
            },
            {
              "id": 188,
              "name": "木里藏族自治县"
            },
            {
              "id": 189,
              "name": "盐源县"
            },
            {
              "id": 190,
              "name": "德昌县"
            },
            {
              "id": 191,
              "name": "会理县"
            },
            {
              "id": 192,
              "name": "会东县"
            },
            {
              "id": 193,
              "name": "宁南县"
            },
            {
              "id": 194,
              "name": "普格县"
            },
            {
              "id": 195,
              "name": "布拖县"
            },
            {
              "id": 196,
              "name": "金阳县"
            },
            {
              "id": 197,
              "name": "昭觉县"
            },
            {
              "id": 198,
              "name": "喜德县"
            },
            {
              "id": 199,
              "name": "冕宁县"
            },
            {
              "id": 200,
              "name": "越西县"
            },
            {
              "id": 201,
              "name": "甘洛县"
            },
            {
              "id": 202,
              "name": "美姑县"
            },
            {
              "id": 203,
              "name": "雷波县"
            },
            {
              "id": 204,
              "name": "其它区"
            }
          ]
        }
      ]
    },
    {
      "id": 23,
      "name": "贵州",
      "city": [
        {
          "id": 1,
          "name": "贵阳市",
          "area": [
            {
              "id": 1,
              "name": "南明区"
            },
            {
              "id": 2,
              "name": "云岩区"
            },
            {
              "id": 3,
              "name": "花溪区"
            },
            {
              "id": 4,
              "name": "乌当区"
            },
            {
              "id": 5,
              "name": "白云区"
            },
            {
              "id": 6,
              "name": "小河区"
            },
            {
              "id": 7,
              "name": "开阳县"
            },
            {
              "id": 8,
              "name": "息烽县"
            },
            {
              "id": 9,
              "name": "修文县"
            },
            {
              "id": 10,
              "name": "金阳开发区"
            },
            {
              "id": 11,
              "name": "清镇市"
            },
            {
              "id": 12,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 2,
          "name": "六盘水市",
          "area": [
            {
              "id": 13,
              "name": "钟山区"
            },
            {
              "id": 14,
              "name": "六枝特区"
            },
            {
              "id": 15,
              "name": "水城县"
            },
            {
              "id": 16,
              "name": "盘县"
            },
            {
              "id": 17,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 3,
          "name": "遵义市",
          "area": [
            {
              "id": 18,
              "name": "红花岗区"
            },
            {
              "id": 19,
              "name": "汇川区"
            },
            {
              "id": 20,
              "name": "遵义县"
            },
            {
              "id": 21,
              "name": "桐梓县"
            },
            {
              "id": 22,
              "name": "绥阳县"
            },
            {
              "id": 23,
              "name": "正安县"
            },
            {
              "id": 24,
              "name": "道真仡佬族苗族自治县"
            },
            {
              "id": 25,
              "name": "务川仡佬族苗族自治县"
            },
            {
              "id": 26,
              "name": "凤冈县"
            },
            {
              "id": 27,
              "name": "湄潭县"
            },
            {
              "id": 28,
              "name": "余庆县"
            },
            {
              "id": 29,
              "name": "习水县"
            },
            {
              "id": 30,
              "name": "赤水市"
            },
            {
              "id": 31,
              "name": "仁怀市"
            },
            {
              "id": 32,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 4,
          "name": "安顺市",
          "area": [
            {
              "id": 33,
              "name": "西秀区"
            },
            {
              "id": 34,
              "name": "平坝县"
            },
            {
              "id": 35,
              "name": "普定县"
            },
            {
              "id": 36,
              "name": "镇宁布依族苗族自治县"
            },
            {
              "id": 37,
              "name": "关岭布依族苗族自治县"
            },
            {
              "id": 38,
              "name": "紫云苗族布依族自治县"
            },
            {
              "id": 39,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 5,
          "name": "铜仁地区",
          "area": [
            {
              "id": 40,
              "name": "铜仁市"
            },
            {
              "id": 41,
              "name": "江口县"
            },
            {
              "id": 42,
              "name": "玉屏侗族自治县"
            },
            {
              "id": 43,
              "name": "石阡县"
            },
            {
              "id": 44,
              "name": "思南县"
            },
            {
              "id": 45,
              "name": "印江土家族苗族自治县"
            },
            {
              "id": 46,
              "name": "德江县"
            },
            {
              "id": 47,
              "name": "沿河土家族自治县"
            },
            {
              "id": 48,
              "name": "松桃苗族自治县"
            },
            {
              "id": 49,
              "name": "万山特区"
            },
            {
              "id": 50,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 6,
          "name": "黔西南布依族苗族自治州",
          "area": [
            {
              "id": 51,
              "name": "兴义市"
            },
            {
              "id": 52,
              "name": "兴仁县"
            },
            {
              "id": 53,
              "name": "普安县"
            },
            {
              "id": 54,
              "name": "晴隆县"
            },
            {
              "id": 55,
              "name": "贞丰县"
            },
            {
              "id": 56,
              "name": "望谟县"
            },
            {
              "id": 57,
              "name": "册亨县"
            },
            {
              "id": 58,
              "name": "安龙县"
            },
            {
              "id": 59,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 7,
          "name": "毕节地区",
          "area": [
            {
              "id": 60,
              "name": "毕节市"
            },
            {
              "id": 61,
              "name": "大方县"
            },
            {
              "id": 62,
              "name": "黔西县"
            },
            {
              "id": 63,
              "name": "金沙县"
            },
            {
              "id": 64,
              "name": "织金县"
            },
            {
              "id": 65,
              "name": "纳雍县"
            },
            {
              "id": 66,
              "name": "威宁彝族回族苗族自治县"
            },
            {
              "id": 67,
              "name": "赫章县"
            },
            {
              "id": 68,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 8,
          "name": "黔东南苗族侗族自治州",
          "area": [
            {
              "id": 69,
              "name": "凯里市"
            },
            {
              "id": 70,
              "name": "黄平县"
            },
            {
              "id": 71,
              "name": "施秉县"
            },
            {
              "id": 72,
              "name": "三穗县"
            },
            {
              "id": 73,
              "name": "镇远县"
            },
            {
              "id": 74,
              "name": "岑巩县"
            },
            {
              "id": 75,
              "name": "天柱县"
            },
            {
              "id": 76,
              "name": "锦屏县"
            },
            {
              "id": 77,
              "name": "剑河县"
            },
            {
              "id": 78,
              "name": "台江县"
            },
            {
              "id": 79,
              "name": "黎平县"
            },
            {
              "id": 80,
              "name": "榕江县"
            },
            {
              "id": 81,
              "name": "从江县"
            },
            {
              "id": 82,
              "name": "雷山县"
            },
            {
              "id": 83,
              "name": "麻江县"
            },
            {
              "id": 84,
              "name": "丹寨县"
            },
            {
              "id": 85,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 9,
          "name": "黔南布依族苗族自治州",
          "area": [
            {
              "id": 86,
              "name": "都匀市"
            },
            {
              "id": 87,
              "name": "福泉市"
            },
            {
              "id": 88,
              "name": "荔波县"
            },
            {
              "id": 89,
              "name": "贵定县"
            },
            {
              "id": 90,
              "name": "瓮安县"
            },
            {
              "id": 91,
              "name": "独山县"
            },
            {
              "id": 92,
              "name": "平塘县"
            },
            {
              "id": 93,
              "name": "罗甸县"
            },
            {
              "id": 94,
              "name": "长顺县"
            },
            {
              "id": 95,
              "name": "龙里县"
            },
            {
              "id": 96,
              "name": "惠水县"
            },
            {
              "id": 97,
              "name": "三都水族自治县"
            },
            {
              "id": 98,
              "name": "其它区"
            }
          ]
        }
      ]
    },
    {
      "id": 24,
      "name": "云南",
      "city": [
        {
          "id": 1,
          "name": "昆明市",
          "area": [
            {
              "id": 1,
              "name": "五华区"
            },
            {
              "id": 2,
              "name": "盘龙区"
            },
            {
              "id": 3,
              "name": "官渡区"
            },
            {
              "id": 4,
              "name": "西山区"
            },
            {
              "id": 5,
              "name": "东川区"
            },
            {
              "id": 6,
              "name": "呈贡县"
            },
            {
              "id": 7,
              "name": "晋宁县"
            },
            {
              "id": 8,
              "name": "富民县"
            },
            {
              "id": 9,
              "name": "宜良县"
            },
            {
              "id": 10,
              "name": "石林彝族自治县"
            },
            {
              "id": 11,
              "name": "嵩明县"
            },
            {
              "id": 12,
              "name": "禄劝彝族苗族自治县"
            },
            {
              "id": 13,
              "name": "寻甸回族彝族自治县"
            },
            {
              "id": 14,
              "name": "安宁市"
            },
            {
              "id": 15,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 2,
          "name": "曲靖市",
          "area": [
            {
              "id": 16,
              "name": "麒麟区"
            },
            {
              "id": 17,
              "name": "马龙县"
            },
            {
              "id": 18,
              "name": "陆良县"
            },
            {
              "id": 19,
              "name": "师宗县"
            },
            {
              "id": 20,
              "name": "罗平县"
            },
            {
              "id": 21,
              "name": "富源县"
            },
            {
              "id": 22,
              "name": "会泽县"
            },
            {
              "id": 23,
              "name": "沾益县"
            },
            {
              "id": 24,
              "name": "宣威市"
            },
            {
              "id": 25,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 3,
          "name": "玉溪市",
          "area": [
            {
              "id": 26,
              "name": "红塔区"
            },
            {
              "id": 27,
              "name": "江川县"
            },
            {
              "id": 28,
              "name": "澄江县"
            },
            {
              "id": 29,
              "name": "通海县"
            },
            {
              "id": 30,
              "name": "华宁县"
            },
            {
              "id": 31,
              "name": "易门县"
            },
            {
              "id": 32,
              "name": "峨山彝族自治县"
            },
            {
              "id": 33,
              "name": "新平彝族傣族自治县"
            },
            {
              "id": 34,
              "name": "元江哈尼族彝族傣族自治县"
            },
            {
              "id": 35,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 4,
          "name": "保山市",
          "area": [
            {
              "id": 36,
              "name": "隆阳区"
            },
            {
              "id": 37,
              "name": "施甸县"
            },
            {
              "id": 38,
              "name": "腾冲县"
            },
            {
              "id": 39,
              "name": "龙陵县"
            },
            {
              "id": 40,
              "name": "昌宁县"
            },
            {
              "id": 41,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 5,
          "name": "昭通市",
          "area": [
            {
              "id": 42,
              "name": "昭阳区"
            },
            {
              "id": 43,
              "name": "鲁甸县"
            },
            {
              "id": 44,
              "name": "巧家县"
            },
            {
              "id": 45,
              "name": "盐津县"
            },
            {
              "id": 46,
              "name": "大关县"
            },
            {
              "id": 47,
              "name": "永善县"
            },
            {
              "id": 48,
              "name": "绥江县"
            },
            {
              "id": 49,
              "name": "镇雄县"
            },
            {
              "id": 50,
              "name": "彝良县"
            },
            {
              "id": 51,
              "name": "威信县"
            },
            {
              "id": 52,
              "name": "水富县"
            },
            {
              "id": 53,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 6,
          "name": "丽江市",
          "area": [
            {
              "id": 54,
              "name": "古城区"
            },
            {
              "id": 55,
              "name": "玉龙纳西族自治县"
            },
            {
              "id": 56,
              "name": "永胜县"
            },
            {
              "id": 57,
              "name": "华坪县"
            },
            {
              "id": 58,
              "name": "宁蒗彝族自治县"
            },
            {
              "id": 59,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 7,
          "name": "普洱市",
          "area": [
            {
              "id": 60,
              "name": "思茅区"
            },
            {
              "id": 61,
              "name": "宁洱哈尼族彝族自治县"
            },
            {
              "id": 62,
              "name": "墨江哈尼族自治县"
            },
            {
              "id": 63,
              "name": "景东彝族自治县"
            },
            {
              "id": 64,
              "name": "景谷傣族彝族自治县"
            },
            {
              "id": 65,
              "name": "镇沅彝族哈尼族拉祜族自治县"
            },
            {
              "id": 66,
              "name": "江城哈尼族彝族自治县"
            },
            {
              "id": 67,
              "name": "孟连傣族拉祜族佤族自治县"
            },
            {
              "id": 68,
              "name": "澜沧拉祜族自治县"
            },
            {
              "id": 69,
              "name": "西盟佤族自治县"
            },
            {
              "id": 70,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 8,
          "name": "临沧市",
          "area": [
            {
              "id": 71,
              "name": "临翔区"
            },
            {
              "id": 72,
              "name": "凤庆县"
            },
            {
              "id": 73,
              "name": "云县"
            },
            {
              "id": 74,
              "name": "永德县"
            },
            {
              "id": 75,
              "name": "镇康县"
            },
            {
              "id": 76,
              "name": "双江拉祜族佤族布朗族傣族自治县"
            },
            {
              "id": 77,
              "name": "耿马傣族佤族自治县"
            },
            {
              "id": 78,
              "name": "沧源佤族自治县"
            },
            {
              "id": 79,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 9,
          "name": "楚雄彝族自治州",
          "area": [
            {
              "id": 80,
              "name": "楚雄市"
            },
            {
              "id": 81,
              "name": "双柏县"
            },
            {
              "id": 82,
              "name": "牟定县"
            },
            {
              "id": 83,
              "name": "南华县"
            },
            {
              "id": 84,
              "name": "姚安县"
            },
            {
              "id": 85,
              "name": "大姚县"
            },
            {
              "id": 86,
              "name": "永仁县"
            },
            {
              "id": 87,
              "name": "元谋县"
            },
            {
              "id": 88,
              "name": "武定县"
            },
            {
              "id": 89,
              "name": "禄丰县"
            },
            {
              "id": 90,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 10,
          "name": "红河哈尼族彝族自治州",
          "area": [
            {
              "id": 91,
              "name": "个旧市"
            },
            {
              "id": 92,
              "name": "开远市"
            },
            {
              "id": 93,
              "name": "蒙自县"
            },
            {
              "id": 94,
              "name": "屏边苗族自治县"
            },
            {
              "id": 95,
              "name": "建水县"
            },
            {
              "id": 96,
              "name": "石屏县"
            },
            {
              "id": 97,
              "name": "弥勒县"
            },
            {
              "id": 98,
              "name": "泸西县"
            },
            {
              "id": 99,
              "name": "元阳县"
            },
            {
              "id": 100,
              "name": "红河县"
            },
            {
              "id": 101,
              "name": "金平苗族瑶族傣族自治县"
            },
            {
              "id": 102,
              "name": "绿春县"
            },
            {
              "id": 103,
              "name": "河口瑶族自治县"
            },
            {
              "id": 104,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 11,
          "name": "文山壮族苗族自治州",
          "area": [
            {
              "id": 105,
              "name": "文山县"
            },
            {
              "id": 106,
              "name": "砚山县"
            },
            {
              "id": 107,
              "name": "西畴县"
            },
            {
              "id": 108,
              "name": "麻栗坡县"
            },
            {
              "id": 109,
              "name": "马关县"
            },
            {
              "id": 110,
              "name": "丘北县"
            },
            {
              "id": 111,
              "name": "广南县"
            },
            {
              "id": 112,
              "name": "富宁县"
            },
            {
              "id": 113,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 12,
          "name": "西双版纳傣族自治州",
          "area": [
            {
              "id": 114,
              "name": "景洪市"
            },
            {
              "id": 115,
              "name": "勐海县"
            },
            {
              "id": 116,
              "name": "勐腊县"
            },
            {
              "id": 117,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 13,
          "name": "大理白族自治州",
          "area": [
            {
              "id": 118,
              "name": "大理市"
            },
            {
              "id": 119,
              "name": "漾濞彝族自治县"
            },
            {
              "id": 120,
              "name": "祥云县"
            },
            {
              "id": 121,
              "name": "宾川县"
            },
            {
              "id": 122,
              "name": "弥渡县"
            },
            {
              "id": 123,
              "name": "南涧彝族自治县"
            },
            {
              "id": 124,
              "name": "巍山彝族回族自治县"
            },
            {
              "id": 125,
              "name": "永平县"
            },
            {
              "id": 126,
              "name": "云龙县"
            },
            {
              "id": 127,
              "name": "洱源县"
            },
            {
              "id": 128,
              "name": "剑川县"
            },
            {
              "id": 129,
              "name": "鹤庆县"
            },
            {
              "id": 130,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 14,
          "name": "德宏傣族景颇族自治州",
          "area": [
            {
              "id": 131,
              "name": "瑞丽市"
            },
            {
              "id": 132,
              "name": "潞西市"
            },
            {
              "id": 133,
              "name": "梁河县"
            },
            {
              "id": 134,
              "name": "盈江县"
            },
            {
              "id": 135,
              "name": "陇川县"
            },
            {
              "id": 136,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 15,
          "name": "怒江傈僳族自治州",
          "area": [
            {
              "id": 137,
              "name": "泸水县"
            },
            {
              "id": 138,
              "name": "福贡县"
            },
            {
              "id": 139,
              "name": "贡山独龙族怒族自治县"
            },
            {
              "id": 140,
              "name": "兰坪白族普米族自治县"
            },
            {
              "id": 141,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 16,
          "name": "迪庆藏族自治州",
          "area": [
            {
              "id": 142,
              "name": "香格里拉县"
            },
            {
              "id": 143,
              "name": "德钦县"
            },
            {
              "id": 144,
              "name": "维西傈僳族自治县"
            },
            {
              "id": 145,
              "name": "其它区"
            }
          ]
        }
      ]
    },
    {
      "id": 25,
      "name": "西藏",
      "city": [
        {
          "id": 1,
          "name": "拉萨市",
          "area": [
            {
              "id": 1,
              "name": "城关区"
            },
            {
              "id": 2,
              "name": "林周县"
            },
            {
              "id": 3,
              "name": "当雄县"
            },
            {
              "id": 4,
              "name": "尼木县"
            },
            {
              "id": 5,
              "name": "曲水县"
            },
            {
              "id": 6,
              "name": "堆龙德庆县"
            },
            {
              "id": 7,
              "name": "达孜县"
            },
            {
              "id": 8,
              "name": "墨竹工卡县"
            },
            {
              "id": 9,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 2,
          "name": "昌都地区",
          "area": [
            {
              "id": 10,
              "name": "昌都县"
            },
            {
              "id": 11,
              "name": "江达县"
            },
            {
              "id": 12,
              "name": "贡觉县"
            },
            {
              "id": 13,
              "name": "类乌齐县"
            },
            {
              "id": 14,
              "name": "丁青县"
            },
            {
              "id": 15,
              "name": "察雅县"
            },
            {
              "id": 16,
              "name": "八宿县"
            },
            {
              "id": 17,
              "name": "左贡县"
            },
            {
              "id": 18,
              "name": "芒康县"
            },
            {
              "id": 19,
              "name": "洛隆县"
            },
            {
              "id": 20,
              "name": "边坝县"
            },
            {
              "id": 21,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 3,
          "name": "山南地区",
          "area": [
            {
              "id": 22,
              "name": "乃东县"
            },
            {
              "id": 23,
              "name": "扎囊县"
            },
            {
              "id": 24,
              "name": "贡嘎县"
            },
            {
              "id": 25,
              "name": "桑日县"
            },
            {
              "id": 26,
              "name": "琼结县"
            },
            {
              "id": 27,
              "name": "曲松县"
            },
            {
              "id": 28,
              "name": "措美县"
            },
            {
              "id": 29,
              "name": "洛扎县"
            },
            {
              "id": 30,
              "name": "加查县"
            },
            {
              "id": 31,
              "name": "隆子县"
            },
            {
              "id": 32,
              "name": "错那县"
            },
            {
              "id": 33,
              "name": "浪卡子县"
            },
            {
              "id": 34,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 4,
          "name": "日喀则地区",
          "area": [
            {
              "id": 35,
              "name": "日喀则市"
            },
            {
              "id": 36,
              "name": "南木林县"
            },
            {
              "id": 37,
              "name": "江孜县"
            },
            {
              "id": 38,
              "name": "定日县"
            },
            {
              "id": 39,
              "name": "萨迦县"
            },
            {
              "id": 40,
              "name": "拉孜县"
            },
            {
              "id": 41,
              "name": "昂仁县"
            },
            {
              "id": 42,
              "name": "谢通门县"
            },
            {
              "id": 43,
              "name": "白朗县"
            },
            {
              "id": 44,
              "name": "仁布县"
            },
            {
              "id": 45,
              "name": "康马县"
            },
            {
              "id": 46,
              "name": "定结县"
            },
            {
              "id": 47,
              "name": "仲巴县"
            },
            {
              "id": 48,
              "name": "亚东县"
            },
            {
              "id": 49,
              "name": "吉隆县"
            },
            {
              "id": 50,
              "name": "聂拉木县"
            },
            {
              "id": 51,
              "name": "萨嘎县"
            },
            {
              "id": 52,
              "name": "岗巴县"
            },
            {
              "id": 53,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 5,
          "name": "那曲地区",
          "area": [
            {
              "id": 54,
              "name": "那曲县"
            },
            {
              "id": 55,
              "name": "嘉黎县"
            },
            {
              "id": 56,
              "name": "比如县"
            },
            {
              "id": 57,
              "name": "聂荣县"
            },
            {
              "id": 58,
              "name": "安多县"
            },
            {
              "id": 59,
              "name": "申扎县"
            },
            {
              "id": 60,
              "name": "索县"
            },
            {
              "id": 61,
              "name": "班戈县"
            },
            {
              "id": 62,
              "name": "巴青县"
            },
            {
              "id": 63,
              "name": "尼玛县"
            },
            {
              "id": 64,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 6,
          "name": "阿里地区",
          "area": [
            {
              "id": 65,
              "name": "普兰县"
            },
            {
              "id": 66,
              "name": "札达县"
            },
            {
              "id": 67,
              "name": "噶尔县"
            },
            {
              "id": 68,
              "name": "日土县"
            },
            {
              "id": 69,
              "name": "革吉县"
            },
            {
              "id": 70,
              "name": "改则县"
            },
            {
              "id": 71,
              "name": "措勤县"
            },
            {
              "id": 72,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 7,
          "name": "林芝地区",
          "area": [
            {
              "id": 73,
              "name": "林芝县"
            },
            {
              "id": 74,
              "name": "工布江达县"
            },
            {
              "id": 75,
              "name": "米林县"
            },
            {
              "id": 76,
              "name": "墨脱县"
            },
            {
              "id": 77,
              "name": "波密县"
            },
            {
              "id": 78,
              "name": "察隅县"
            },
            {
              "id": 79,
              "name": "朗县"
            },
            {
              "id": 80,
              "name": "其它区"
            }
          ]
        }
      ]
    },
    {
      "id": 26,
      "name": "陕西",
      "city": [
        {
          "id": 1,
          "name": "西安市",
          "area": [
            {
              "id": 1,
              "name": "新城区"
            },
            {
              "id": 2,
              "name": "碑林区"
            },
            {
              "id": 3,
              "name": "莲湖区"
            },
            {
              "id": 4,
              "name": "灞桥区"
            },
            {
              "id": 5,
              "name": "未央区"
            },
            {
              "id": 6,
              "name": "雁塔区"
            },
            {
              "id": 7,
              "name": "阎良区"
            },
            {
              "id": 8,
              "name": "临潼区"
            },
            {
              "id": 9,
              "name": "长安区"
            },
            {
              "id": 10,
              "name": "蓝田县"
            },
            {
              "id": 11,
              "name": "周至县"
            },
            {
              "id": 12,
              "name": "户县"
            },
            {
              "id": 13,
              "name": "高陵县"
            },
            {
              "id": 14,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 2,
          "name": "铜川市",
          "area": [
            {
              "id": 15,
              "name": "王益区"
            },
            {
              "id": 16,
              "name": "印台区"
            },
            {
              "id": 17,
              "name": "耀州区"
            },
            {
              "id": 18,
              "name": "宜君县"
            },
            {
              "id": 19,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 3,
          "name": "宝鸡市",
          "area": [
            {
              "id": 20,
              "name": "渭滨区"
            },
            {
              "id": 21,
              "name": "金台区"
            },
            {
              "id": 22,
              "name": "陈仓区"
            },
            {
              "id": 23,
              "name": "凤翔县"
            },
            {
              "id": 24,
              "name": "岐山县"
            },
            {
              "id": 25,
              "name": "扶风县"
            },
            {
              "id": 26,
              "name": "眉县"
            },
            {
              "id": 27,
              "name": "陇县"
            },
            {
              "id": 28,
              "name": "千阳县"
            },
            {
              "id": 29,
              "name": "麟游县"
            },
            {
              "id": 30,
              "name": "凤县"
            },
            {
              "id": 31,
              "name": "太白县"
            },
            {
              "id": 32,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 4,
          "name": "咸阳市",
          "area": [
            {
              "id": 33,
              "name": "秦都区"
            },
            {
              "id": 34,
              "name": "杨凌区"
            },
            {
              "id": 35,
              "name": "渭城区"
            },
            {
              "id": 36,
              "name": "三原县"
            },
            {
              "id": 37,
              "name": "泾阳县"
            },
            {
              "id": 38,
              "name": "乾县"
            },
            {
              "id": 39,
              "name": "礼泉县"
            },
            {
              "id": 40,
              "name": "永寿县"
            },
            {
              "id": 41,
              "name": "彬县"
            },
            {
              "id": 42,
              "name": "长武县"
            },
            {
              "id": 43,
              "name": "旬邑县"
            },
            {
              "id": 44,
              "name": "淳化县"
            },
            {
              "id": 45,
              "name": "武功县"
            },
            {
              "id": 46,
              "name": "兴平市"
            },
            {
              "id": 47,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 5,
          "name": "渭南市",
          "area": [
            {
              "id": 48,
              "name": "临渭区"
            },
            {
              "id": 49,
              "name": "华县"
            },
            {
              "id": 50,
              "name": "潼关县"
            },
            {
              "id": 51,
              "name": "大荔县"
            },
            {
              "id": 52,
              "name": "合阳县"
            },
            {
              "id": 53,
              "name": "澄城县"
            },
            {
              "id": 54,
              "name": "蒲城县"
            },
            {
              "id": 55,
              "name": "白水县"
            },
            {
              "id": 56,
              "name": "富平县"
            },
            {
              "id": 57,
              "name": "韩城市"
            },
            {
              "id": 58,
              "name": "华阴市"
            },
            {
              "id": 59,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 6,
          "name": "延安市",
          "area": [
            {
              "id": 60,
              "name": "宝塔区"
            },
            {
              "id": 61,
              "name": "延长县"
            },
            {
              "id": 62,
              "name": "延川县"
            },
            {
              "id": 63,
              "name": "子长县"
            },
            {
              "id": 64,
              "name": "安塞县"
            },
            {
              "id": 65,
              "name": "志丹县"
            },
            {
              "id": 66,
              "name": "吴起县"
            },
            {
              "id": 67,
              "name": "甘泉县"
            },
            {
              "id": 68,
              "name": "富县"
            },
            {
              "id": 69,
              "name": "洛川县"
            },
            {
              "id": 70,
              "name": "宜川县"
            },
            {
              "id": 71,
              "name": "黄龙县"
            },
            {
              "id": 72,
              "name": "黄陵县"
            },
            {
              "id": 73,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 7,
          "name": "汉中市",
          "area": [
            {
              "id": 74,
              "name": "汉台区"
            },
            {
              "id": 75,
              "name": "南郑县"
            },
            {
              "id": 76,
              "name": "城固县"
            },
            {
              "id": 77,
              "name": "洋县"
            },
            {
              "id": 78,
              "name": "西乡县"
            },
            {
              "id": 79,
              "name": "勉县"
            },
            {
              "id": 80,
              "name": "宁强县"
            },
            {
              "id": 81,
              "name": "略阳县"
            },
            {
              "id": 82,
              "name": "镇巴县"
            },
            {
              "id": 83,
              "name": "留坝县"
            },
            {
              "id": 84,
              "name": "佛坪县"
            },
            {
              "id": 85,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 8,
          "name": "榆林市",
          "area": [
            {
              "id": 86,
              "name": "榆阳区"
            },
            {
              "id": 87,
              "name": "神木县"
            },
            {
              "id": 88,
              "name": "府谷县"
            },
            {
              "id": 89,
              "name": "横山县"
            },
            {
              "id": 90,
              "name": "靖边县"
            },
            {
              "id": 91,
              "name": "定边县"
            },
            {
              "id": 92,
              "name": "绥德县"
            },
            {
              "id": 93,
              "name": "米脂县"
            },
            {
              "id": 94,
              "name": "佳县"
            },
            {
              "id": 95,
              "name": "吴堡县"
            },
            {
              "id": 96,
              "name": "清涧县"
            },
            {
              "id": 97,
              "name": "子洲县"
            },
            {
              "id": 98,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 9,
          "name": "安康市",
          "area": [
            {
              "id": 99,
              "name": "汉滨区"
            },
            {
              "id": 100,
              "name": "汉阴县"
            },
            {
              "id": 101,
              "name": "石泉县"
            },
            {
              "id": 102,
              "name": "宁陕县"
            },
            {
              "id": 103,
              "name": "紫阳县"
            },
            {
              "id": 104,
              "name": "岚皋县"
            },
            {
              "id": 105,
              "name": "平利县"
            },
            {
              "id": 106,
              "name": "镇坪县"
            },
            {
              "id": 107,
              "name": "旬阳县"
            },
            {
              "id": 108,
              "name": "白河县"
            },
            {
              "id": 109,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 10,
          "name": "商洛市",
          "area": [
            {
              "id": 110,
              "name": "商州区"
            },
            {
              "id": 111,
              "name": "洛南县"
            },
            {
              "id": 112,
              "name": "丹凤县"
            },
            {
              "id": 113,
              "name": "商南县"
            },
            {
              "id": 114,
              "name": "山阳县"
            },
            {
              "id": 115,
              "name": "镇安县"
            },
            {
              "id": 116,
              "name": "柞水县"
            },
            {
              "id": 117,
              "name": "其它区"
            }
          ]
        }
      ]
    },
    {
      "id": 27,
      "name": "甘肃",
      "city": [
        {
          "id": 1,
          "name": "兰州市",
          "area": [
            {
              "id": 1,
              "name": "城关区"
            },
            {
              "id": 2,
              "name": "七里河区"
            },
            {
              "id": 3,
              "name": "西固区"
            },
            {
              "id": 4,
              "name": "安宁区"
            },
            {
              "id": 5,
              "name": "红古区"
            },
            {
              "id": 6,
              "name": "永登县"
            },
            {
              "id": 7,
              "name": "皋兰县"
            },
            {
              "id": 8,
              "name": "榆中县"
            },
            {
              "id": 9,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 2,
          "name": "嘉峪关市",
          "area": []
        },
        {
          "id": 3,
          "name": "金昌市",
          "area": [
            {
              "id": 10,
              "name": "金川区"
            },
            {
              "id": 11,
              "name": "永昌县"
            },
            {
              "id": 12,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 4,
          "name": "白银市",
          "area": [
            {
              "id": 13,
              "name": "白银区"
            },
            {
              "id": 14,
              "name": "平川区"
            },
            {
              "id": 15,
              "name": "靖远县"
            },
            {
              "id": 16,
              "name": "会宁县"
            },
            {
              "id": 17,
              "name": "景泰县"
            },
            {
              "id": 18,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 5,
          "name": "天水市",
          "area": [
            {
              "id": 19,
              "name": "秦州区"
            },
            {
              "id": 20,
              "name": "麦积区"
            },
            {
              "id": 21,
              "name": "清水县"
            },
            {
              "id": 22,
              "name": "秦安县"
            },
            {
              "id": 23,
              "name": "甘谷县"
            },
            {
              "id": 24,
              "name": "武山县"
            },
            {
              "id": 25,
              "name": "张家川回族自治县"
            },
            {
              "id": 26,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 6,
          "name": "武威市",
          "area": [
            {
              "id": 27,
              "name": "凉州区"
            },
            {
              "id": 28,
              "name": "民勤县"
            },
            {
              "id": 29,
              "name": "古浪县"
            },
            {
              "id": 30,
              "name": "天祝藏族自治县"
            },
            {
              "id": 31,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 7,
          "name": "张掖市",
          "area": [
            {
              "id": 32,
              "name": "甘州区"
            },
            {
              "id": 33,
              "name": "肃南裕固族自治县"
            },
            {
              "id": 34,
              "name": "民乐县"
            },
            {
              "id": 35,
              "name": "临泽县"
            },
            {
              "id": 36,
              "name": "高台县"
            },
            {
              "id": 37,
              "name": "山丹县"
            },
            {
              "id": 38,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 8,
          "name": "平凉市",
          "area": [
            {
              "id": 39,
              "name": "崆峒区"
            },
            {
              "id": 40,
              "name": "泾川县"
            },
            {
              "id": 41,
              "name": "灵台县"
            },
            {
              "id": 42,
              "name": "崇信县"
            },
            {
              "id": 43,
              "name": "华亭县"
            },
            {
              "id": 44,
              "name": "庄浪县"
            },
            {
              "id": 45,
              "name": "静宁县"
            },
            {
              "id": 46,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 9,
          "name": "酒泉市",
          "area": [
            {
              "id": 47,
              "name": "肃州区"
            },
            {
              "id": 48,
              "name": "金塔县"
            },
            {
              "id": 49,
              "name": "安西县"
            },
            {
              "id": 50,
              "name": "肃北蒙古族自治县"
            },
            {
              "id": 51,
              "name": "阿克塞哈萨克族自治县"
            },
            {
              "id": 52,
              "name": "玉门市"
            },
            {
              "id": 53,
              "name": "敦煌市"
            },
            {
              "id": 54,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 10,
          "name": "庆阳市",
          "area": [
            {
              "id": 55,
              "name": "西峰区"
            },
            {
              "id": 56,
              "name": "庆城县"
            },
            {
              "id": 57,
              "name": "环县"
            },
            {
              "id": 58,
              "name": "华池县"
            },
            {
              "id": 59,
              "name": "合水县"
            },
            {
              "id": 60,
              "name": "正宁县"
            },
            {
              "id": 61,
              "name": "宁县"
            },
            {
              "id": 62,
              "name": "镇原县"
            },
            {
              "id": 63,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 11,
          "name": "定西市",
          "area": [
            {
              "id": 64,
              "name": "安定区"
            },
            {
              "id": 65,
              "name": "通渭县"
            },
            {
              "id": 66,
              "name": "陇西县"
            },
            {
              "id": 67,
              "name": "渭源县"
            },
            {
              "id": 68,
              "name": "临洮县"
            },
            {
              "id": 69,
              "name": "漳县"
            },
            {
              "id": 70,
              "name": "岷县"
            },
            {
              "id": 71,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 12,
          "name": "陇南市",
          "area": [
            {
              "id": 72,
              "name": "武都区"
            },
            {
              "id": 73,
              "name": "成县"
            },
            {
              "id": 74,
              "name": "文县"
            },
            {
              "id": 75,
              "name": "宕昌县"
            },
            {
              "id": 76,
              "name": "康县"
            },
            {
              "id": 77,
              "name": "西和县"
            },
            {
              "id": 78,
              "name": "礼县"
            },
            {
              "id": 79,
              "name": "徽县"
            },
            {
              "id": 80,
              "name": "两当县"
            },
            {
              "id": 81,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 13,
          "name": "临夏回族自治州",
          "area": [
            {
              "id": 82,
              "name": "临夏市"
            },
            {
              "id": 83,
              "name": "临夏县"
            },
            {
              "id": 84,
              "name": "康乐县"
            },
            {
              "id": 85,
              "name": "永靖县"
            },
            {
              "id": 86,
              "name": "广河县"
            },
            {
              "id": 87,
              "name": "和政县"
            },
            {
              "id": 88,
              "name": "东乡族自治县"
            },
            {
              "id": 89,
              "name": "积石山保安族东乡族撒拉族自治县"
            },
            {
              "id": 90,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 14,
          "name": "甘南藏族自治州",
          "area": [
            {
              "id": 91,
              "name": "合作市"
            },
            {
              "id": 92,
              "name": "临潭县"
            },
            {
              "id": 93,
              "name": "卓尼县"
            },
            {
              "id": 94,
              "name": "舟曲县"
            },
            {
              "id": 95,
              "name": "迭部县"
            },
            {
              "id": 96,
              "name": "玛曲县"
            },
            {
              "id": 97,
              "name": "碌曲县"
            },
            {
              "id": 98,
              "name": "夏河县"
            },
            {
              "id": 99,
              "name": "其它区"
            }
          ]
        }
      ]
    },
    {
      "id": 28,
      "name": "青海",
      "city": [
        {
          "id": 1,
          "name": "西宁市",
          "area": [
            {
              "id": 1,
              "name": "城东区"
            },
            {
              "id": 2,
              "name": "城中区"
            },
            {
              "id": 3,
              "name": "城西区"
            },
            {
              "id": 4,
              "name": "城北区"
            },
            {
              "id": 5,
              "name": "大通回族土族自治县"
            },
            {
              "id": 6,
              "name": "湟中县"
            },
            {
              "id": 7,
              "name": "湟源县"
            },
            {
              "id": 8,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 2,
          "name": "海东地区",
          "area": [
            {
              "id": 9,
              "name": "平安县"
            },
            {
              "id": 10,
              "name": "民和回族土族自治县"
            },
            {
              "id": 11,
              "name": "乐都县"
            },
            {
              "id": 12,
              "name": "互助土族自治县"
            },
            {
              "id": 13,
              "name": "化隆回族自治县"
            },
            {
              "id": 14,
              "name": "循化撒拉族自治县"
            },
            {
              "id": 15,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 3,
          "name": "海北藏族自治州",
          "area": [
            {
              "id": 16,
              "name": "门源回族自治县"
            },
            {
              "id": 17,
              "name": "祁连县"
            },
            {
              "id": 18,
              "name": "海晏县"
            },
            {
              "id": 19,
              "name": "刚察县"
            },
            {
              "id": 20,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 4,
          "name": "黄南藏族自治州",
          "area": [
            {
              "id": 21,
              "name": "同仁县"
            },
            {
              "id": 22,
              "name": "尖扎县"
            },
            {
              "id": 23,
              "name": "泽库县"
            },
            {
              "id": 24,
              "name": "河南蒙古族自治县"
            },
            {
              "id": 25,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 5,
          "name": "海南藏族自治州",
          "area": [
            {
              "id": 26,
              "name": "共和县"
            },
            {
              "id": 27,
              "name": "同德县"
            },
            {
              "id": 28,
              "name": "贵德县"
            },
            {
              "id": 29,
              "name": "兴海县"
            },
            {
              "id": 30,
              "name": "贵南县"
            },
            {
              "id": 31,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 6,
          "name": "果洛藏族自治州",
          "area": [
            {
              "id": 32,
              "name": "玛沁县"
            },
            {
              "id": 33,
              "name": "班玛县"
            },
            {
              "id": 34,
              "name": "甘德县"
            },
            {
              "id": 35,
              "name": "达日县"
            },
            {
              "id": 36,
              "name": "久治县"
            },
            {
              "id": 37,
              "name": "玛多县"
            },
            {
              "id": 38,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 7,
          "name": "玉树藏族自治州",
          "area": [
            {
              "id": 39,
              "name": "玉树县"
            },
            {
              "id": 40,
              "name": "杂多县"
            },
            {
              "id": 41,
              "name": "称多县"
            },
            {
              "id": 42,
              "name": "治多县"
            },
            {
              "id": 43,
              "name": "囊谦县"
            },
            {
              "id": 44,
              "name": "曲麻莱县"
            },
            {
              "id": 45,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 8,
          "name": "海西蒙古族藏族自治州",
          "area": [
            {
              "id": 46,
              "name": "格尔木市"
            },
            {
              "id": 47,
              "name": "德令哈市"
            },
            {
              "id": 48,
              "name": "乌兰县"
            },
            {
              "id": 49,
              "name": "都兰县"
            },
            {
              "id": 50,
              "name": "天峻县"
            },
            {
              "id": 51,
              "name": "其它区"
            }
          ]
        }
      ]
    },
    {
      "id": 29,
      "name": "宁夏",
      "city": [
        {
          "id": 1,
          "name": "银川市",
          "area": [
            {
              "id": 1,
              "name": "兴庆区"
            },
            {
              "id": 2,
              "name": "西夏区"
            },
            {
              "id": 3,
              "name": "金凤区"
            },
            {
              "id": 4,
              "name": "永宁县"
            },
            {
              "id": 5,
              "name": "贺兰县"
            },
            {
              "id": 6,
              "name": "灵武市"
            },
            {
              "id": 7,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 2,
          "name": "石嘴山市",
          "area": [
            {
              "id": 8,
              "name": "大武口区"
            },
            {
              "id": 9,
              "name": "惠农区"
            },
            {
              "id": 10,
              "name": "平罗县"
            },
            {
              "id": 11,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 3,
          "name": "吴忠市",
          "area": [
            {
              "id": 12,
              "name": "利通区"
            },
            {
              "id": 13,
              "name": "盐池县"
            },
            {
              "id": 14,
              "name": "同心县"
            },
            {
              "id": 15,
              "name": "青铜峡市"
            },
            {
              "id": 16,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 4,
          "name": "固原市",
          "area": [
            {
              "id": 17,
              "name": "原州区"
            },
            {
              "id": 18,
              "name": "西吉县"
            },
            {
              "id": 19,
              "name": "隆德县"
            },
            {
              "id": 20,
              "name": "泾源县"
            },
            {
              "id": 21,
              "name": "彭阳县"
            },
            {
              "id": 22,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 5,
          "name": "中卫市",
          "area": [
            {
              "id": 23,
              "name": "沙坡头区"
            },
            {
              "id": 24,
              "name": "中宁县"
            },
            {
              "id": 25,
              "name": "海原县"
            },
            {
              "id": 26,
              "name": "其它区"
            }
          ]
        }
      ]
    },
    {
      "id": 30,
      "name": "新疆",
      "city": [
        {
          "id": 1,
          "name": "乌鲁木齐市",
          "area": [
            {
              "id": 1,
              "name": "天山区"
            },
            {
              "id": 2,
              "name": "沙依巴克区"
            },
            {
              "id": 3,
              "name": "新市区"
            },
            {
              "id": 4,
              "name": "水磨沟区"
            },
            {
              "id": 5,
              "name": "头屯河区"
            },
            {
              "id": 6,
              "name": "达坂城区"
            },
            {
              "id": 7,
              "name": "东山区"
            },
            {
              "id": 8,
              "name": "米东区"
            },
            {
              "id": 9,
              "name": "乌鲁木齐县"
            },
            {
              "id": 10,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 2,
          "name": "克拉玛依市",
          "area": [
            {
              "id": 11,
              "name": "独山子区"
            },
            {
              "id": 12,
              "name": "克拉玛依区"
            },
            {
              "id": 13,
              "name": "白碱滩区"
            },
            {
              "id": 14,
              "name": "乌尔禾区"
            },
            {
              "id": 15,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 3,
          "name": "吐鲁番地区",
          "area": [
            {
              "id": 16,
              "name": "吐鲁番市"
            },
            {
              "id": 17,
              "name": "鄯善县"
            },
            {
              "id": 18,
              "name": "托克逊县"
            },
            {
              "id": 19,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 4,
          "name": "哈密地区",
          "area": [
            {
              "id": 20,
              "name": "哈密市"
            },
            {
              "id": 21,
              "name": "巴里坤哈萨克自治县"
            },
            {
              "id": 22,
              "name": "伊吾县"
            },
            {
              "id": 23,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 5,
          "name": "昌吉回族自治州",
          "area": [
            {
              "id": 24,
              "name": "昌吉市"
            },
            {
              "id": 25,
              "name": "阜康市"
            },
            {
              "id": 26,
              "name": "米泉市"
            },
            {
              "id": 27,
              "name": "呼图壁县"
            },
            {
              "id": 28,
              "name": "玛纳斯县"
            },
            {
              "id": 29,
              "name": "奇台县"
            },
            {
              "id": 30,
              "name": "吉木萨尔县"
            },
            {
              "id": 31,
              "name": "木垒哈萨克自治县"
            },
            {
              "id": 32,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 6,
          "name": "博尔塔拉蒙古自治州",
          "area": [
            {
              "id": 33,
              "name": "博乐市"
            },
            {
              "id": 34,
              "name": "精河县"
            },
            {
              "id": 35,
              "name": "温泉县"
            },
            {
              "id": 36,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 7,
          "name": "巴音郭楞蒙古自治州",
          "area": [
            {
              "id": 37,
              "name": "库尔勒市"
            },
            {
              "id": 38,
              "name": "轮台县"
            },
            {
              "id": 39,
              "name": "尉犁县"
            },
            {
              "id": 40,
              "name": "若羌县"
            },
            {
              "id": 41,
              "name": "且末县"
            },
            {
              "id": 42,
              "name": "焉耆回族自治县"
            },
            {
              "id": 43,
              "name": "和静县"
            },
            {
              "id": 44,
              "name": "和硕县"
            },
            {
              "id": 45,
              "name": "博湖县"
            },
            {
              "id": 46,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 8,
          "name": "阿克苏地区",
          "area": [
            {
              "id": 47,
              "name": "阿克苏市"
            },
            {
              "id": 48,
              "name": "温宿县"
            },
            {
              "id": 49,
              "name": "库车县"
            },
            {
              "id": 50,
              "name": "沙雅县"
            },
            {
              "id": 51,
              "name": "新和县"
            },
            {
              "id": 52,
              "name": "拜城县"
            },
            {
              "id": 53,
              "name": "乌什县"
            },
            {
              "id": 54,
              "name": "阿瓦提县"
            },
            {
              "id": 55,
              "name": "柯坪县"
            },
            {
              "id": 56,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 9,
          "name": "克孜勒苏柯尔克孜自治州",
          "area": [
            {
              "id": 57,
              "name": "阿图什市"
            },
            {
              "id": 58,
              "name": "阿克陶县"
            },
            {
              "id": 59,
              "name": "阿合奇县"
            },
            {
              "id": 60,
              "name": "乌恰县"
            },
            {
              "id": 61,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 10,
          "name": "喀什地区",
          "area": [
            {
              "id": 62,
              "name": "喀什市"
            },
            {
              "id": 63,
              "name": "疏附县"
            },
            {
              "id": 64,
              "name": "疏勒县"
            },
            {
              "id": 65,
              "name": "英吉沙县"
            },
            {
              "id": 66,
              "name": "泽普县"
            },
            {
              "id": 67,
              "name": "莎车县"
            },
            {
              "id": 68,
              "name": "叶城县"
            },
            {
              "id": 69,
              "name": "麦盖提县"
            },
            {
              "id": 70,
              "name": "岳普湖县"
            },
            {
              "id": 71,
              "name": "伽师县"
            },
            {
              "id": 72,
              "name": "巴楚县"
            },
            {
              "id": 73,
              "name": "塔什库尔干塔吉克自治县"
            },
            {
              "id": 74,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 11,
          "name": "和田地区",
          "area": [
            {
              "id": 75,
              "name": "和田市"
            },
            {
              "id": 76,
              "name": "和田县"
            },
            {
              "id": 77,
              "name": "墨玉县"
            },
            {
              "id": 78,
              "name": "皮山县"
            },
            {
              "id": 79,
              "name": "洛浦县"
            },
            {
              "id": 80,
              "name": "策勒县"
            },
            {
              "id": 81,
              "name": "于田县"
            },
            {
              "id": 82,
              "name": "民丰县"
            },
            {
              "id": 83,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 12,
          "name": "伊犁哈萨克自治州",
          "area": [
            {
              "id": 84,
              "name": "伊宁市"
            },
            {
              "id": 85,
              "name": "奎屯市"
            },
            {
              "id": 86,
              "name": "伊宁县"
            },
            {
              "id": 87,
              "name": "察布查尔锡伯自治县"
            },
            {
              "id": 88,
              "name": "霍城县"
            },
            {
              "id": 89,
              "name": "巩留县"
            },
            {
              "id": 90,
              "name": "新源县"
            },
            {
              "id": 91,
              "name": "昭苏县"
            },
            {
              "id": 92,
              "name": "特克斯县"
            },
            {
              "id": 93,
              "name": "尼勒克县"
            },
            {
              "id": 94,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 13,
          "name": "塔城地区",
          "area": [
            {
              "id": 95,
              "name": "塔城市"
            },
            {
              "id": 96,
              "name": "乌苏市"
            },
            {
              "id": 97,
              "name": "额敏县"
            },
            {
              "id": 98,
              "name": "沙湾县"
            },
            {
              "id": 99,
              "name": "托里县"
            },
            {
              "id": 100,
              "name": "裕民县"
            },
            {
              "id": 101,
              "name": "和布克赛尔蒙古自治县"
            },
            {
              "id": 102,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 14,
          "name": "阿勒泰地区",
          "area": [
            {
              "id": 103,
              "name": "阿勒泰市"
            },
            {
              "id": 104,
              "name": "布尔津县"
            },
            {
              "id": 105,
              "name": "富蕴县"
            },
            {
              "id": 106,
              "name": "福海县"
            },
            {
              "id": 107,
              "name": "哈巴河县"
            },
            {
              "id": 108,
              "name": "青河县"
            },
            {
              "id": 109,
              "name": "吉木乃县"
            },
            {
              "id": 110,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 15,
          "name": "石河子市",
          "area": []
        },
        {
          "id": 16,
          "name": "阿拉尔市",
          "area": []
        },
        {
          "id": 17,
          "name": "图木舒克市",
          "area": []
        },
        {
          "id": 18,
          "name": "五家渠市",
          "area": []
        }
      ]
    },
    {
      "id": 31,
      "name": "台湾",
      "city": [
        {
          "id": 1,
          "name": "台北市",
          "area": [
            {
              "id": 1,
              "name": "中正区"
            },
            {
              "id": 2,
              "name": "大同区"
            },
            {
              "id": 3,
              "name": "中山区"
            },
            {
              "id": 4,
              "name": "松山区"
            },
            {
              "id": 5,
              "name": "大安区"
            },
            {
              "id": 6,
              "name": "万华区"
            },
            {
              "id": 7,
              "name": "信义区"
            },
            {
              "id": 8,
              "name": "士林区"
            },
            {
              "id": 9,
              "name": "北投区"
            },
            {
              "id": 10,
              "name": "内湖区"
            },
            {
              "id": 11,
              "name": "南港区"
            },
            {
              "id": 12,
              "name": "文山区"
            },
            {
              "id": 13,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 2,
          "name": "高雄市",
          "area": [
            {
              "id": 14,
              "name": "新兴区"
            },
            {
              "id": 15,
              "name": "前金区"
            },
            {
              "id": 16,
              "name": "芩雅区"
            },
            {
              "id": 17,
              "name": "盐埕区"
            },
            {
              "id": 18,
              "name": "鼓山区"
            },
            {
              "id": 19,
              "name": "旗津区"
            },
            {
              "id": 20,
              "name": "前镇区"
            },
            {
              "id": 21,
              "name": "三民区"
            },
            {
              "id": 22,
              "name": "左营区"
            },
            {
              "id": 23,
              "name": "楠梓区"
            },
            {
              "id": 24,
              "name": "小港区"
            },
            {
              "id": 25,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 3,
          "name": "台南市",
          "area": [
            {
              "id": 26,
              "name": "中西区"
            },
            {
              "id": 27,
              "name": "东区"
            },
            {
              "id": 28,
              "name": "南区"
            },
            {
              "id": 29,
              "name": "北区"
            },
            {
              "id": 30,
              "name": "安平区"
            },
            {
              "id": 31,
              "name": "安南区"
            },
            {
              "id": 32,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 4,
          "name": "台中市",
          "area": [
            {
              "id": 33,
              "name": "中区"
            },
            {
              "id": 34,
              "name": "东区"
            },
            {
              "id": 35,
              "name": "南区"
            },
            {
              "id": 36,
              "name": "西区"
            },
            {
              "id": 37,
              "name": "北区"
            },
            {
              "id": 38,
              "name": "北屯区"
            },
            {
              "id": 39,
              "name": "西屯区"
            },
            {
              "id": 40,
              "name": "南屯区"
            },
            {
              "id": 41,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 5,
          "name": "金门县",
          "area": []
        },
        {
          "id": 6,
          "name": "南投县",
          "area": []
        },
        {
          "id": 7,
          "name": "基隆市",
          "area": [
            {
              "id": 42,
              "name": "仁爱区"
            },
            {
              "id": 43,
              "name": "信义区"
            },
            {
              "id": 44,
              "name": "中正区"
            },
            {
              "id": 45,
              "name": "中山区"
            },
            {
              "id": 46,
              "name": "安乐区"
            },
            {
              "id": 47,
              "name": "暖暖区"
            },
            {
              "id": 48,
              "name": "七堵区"
            },
            {
              "id": 49,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 8,
          "name": "新竹市",
          "area": [
            {
              "id": 50,
              "name": "东区"
            },
            {
              "id": 51,
              "name": "北区"
            },
            {
              "id": 52,
              "name": "香山区"
            },
            {
              "id": 53,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 9,
          "name": "嘉义市",
          "area": [
            {
              "id": 54,
              "name": "东区"
            },
            {
              "id": 55,
              "name": "西区"
            },
            {
              "id": 56,
              "name": "其它区"
            }
          ]
        },
        {
          "id": 10,
          "name": "台北县",
          "area": []
        },
        {
          "id": 11,
          "name": "宜兰县",
          "area": []
        },
        {
          "id": 12,
          "name": "新竹县",
          "area": []
        },
        {
          "id": 13,
          "name": "桃园县",
          "area": []
        },
        {
          "id": 14,
          "name": "苗栗县",
          "area": []
        },
        {
          "id": 15,
          "name": "台中县",
          "area": []
        },
        {
          "id": 16,
          "name": "彰化县",
          "area": []
        },
        {
          "id": 17,
          "name": "嘉义县",
          "area": []
        },
        {
          "id": 18,
          "name": "云林县",
          "area": []
        },
        {
          "id": 19,
          "name": "台南县",
          "area": []
        },
        {
          "id": 20,
          "name": "高雄县",
          "area": []
        },
        {
          "id": 21,
          "name": "屏东县",
          "area": []
        },
        {
          "id": 22,
          "name": "台东县",
          "area": []
        },
        {
          "id": 23,
          "name": "花莲县",
          "area": []
        },
        {
          "id": 24,
          "name": "澎湖县",
          "area": []
        }
      ]
    },
    {
      "id": 32,
      "name": "香港",
      "city": [
        {
          "id": 1,
          "name": "香港岛",
          "area": []
        },
        {
          "id": 2,
          "name": "九龙",
          "area": []
        },
        {
          "id": 3,
          "name": "新界",
          "area": []
        }
      ]
    },
    {
      "id": 33,
      "name": "澳门",
      "city": [
        {
          "id": 1,
          "name": "澳门半岛",
          "area": []
        },
        {
          "id": 2,
          "name": "离岛",
          "area": []
        }
      ]
    },
    {
      "id": 34,
      "name": "海外",
      "city": [
        {
          "id": 1,
          "name": "海外",
          "area": []
        }
      ]
    }
  ]
}

module.exports = cityList;



